[{"date":"2022-05-20T00:00:00.000+00:00","title":"Wifisfuneral","url":"https://wl.seetickets.us/event/Wifisfuneral/470168?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/470168/fab29b80488344d3ae9bf30ef50e2dfb.image!jpeg.513544.jpeg.Wifisfuneraladmat.jpeg","details":"Doors 8pm // Show 9pm // All Ages // $19 Advance \u0026 $24 Day of Show // VIP $69\nCornerstone Presents:\n\nWIFISFUNERAL"},{"date":"2022-05-21T00:00:00.000+00:00","title":"22 \u0026 GOOD 4 U","url":"https://wl.seetickets.us/event/22-and-GOOD-4-U/469940?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/469940/a24bc23e93ac4a82acab1b294696ef50.image!png.2407846.png.ScreenShot2022-03-03at1.48.06PM.png","details":"Doors 9:30pm // Show 10pm // All Ages // $15 Early Bird, $18 Advance \u0026 $22 Day of Show\nCornerstone Presents:\n22 \u0026 Good 4 U\n'22 \u0026 Good 4 U' is a dance party for lovers of Taylor Swift and Olivia Rodrigo. We play music all night long from the likes of both artists for you to dance to!"},{"date":"2022-05-21T00:00:00.000+00:00","title":"mewithoutYou","url":"https://wl.seetickets.us/event/The-mewithoutyou-Farewell-Tour/474513?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/474513/ef5e3dc8ad5d4417ab0213786a5fafeb.image!png.687228.png.ScreenShot2022-03-23at4.38.39PM.png","details":"(EARLY SHOW)\n\nDoors 5pm // Show 6pm // All Ages // $34 Advance \u0026 $39 Day of Show\nCornerstone Presents:\nMEWITHOUTYOU\nIt is no mistake that mewithoutYou have become one of today’s most fascinating experimental rock acts. The last 15 years have borne witness to the Philadelphia five-piece exercising stylistic evolutions and aerial dynamics with humbling dexterity and untamed ambition. At their roots may be a theatrical progressive punk/post-hardcore band, but they’ve never been content to remain comfortably within a familiar genre. Their continuous multi-directional movements have left them increasingly difficult to classify, the growth of their branches impossible to predict. The group’s sixth full-length album, Pale Horses, is the best evidence to date of their eclectic agility.\nThe one constant in mewithoutYou’s storied career has been lead singer Aaron Weiss’ ability to sketch ornate, thought-provoking narratives. Seamlessly weaving his signature holler amidst whispered storytelling and stream-of-consciousness outpourings, his latest offerings vacillate between the emotionally wracked, vibrantly symbolic, and ambiguously metaphysical. His meandering, technicolor vision of a world apocalyptic—populated with werewolves and vulturemen, shape-shifters and apparitions, android whales and an Idaho bride—combines the fantastic opulence of the group’s recent albums with the vulnerable personal confessions of their earliest work.\nLongtime band-mates Mike Weiss, Rickie Mazzotta and Greg Jehanian continue to craft dramatic, nightmare soundscapes which lavishly complement their singer’s ecstatic hallucinations. The addition of Brandon Beaver (of Buried Beds, the Silver Ages) allows the group as a 5-piece to revisit its earlier intricate, layered fretwork, while adding new depths of vocal harmonies and ever-peculiar arrangements. Musically, the group hearkens boldly to the raw intensity of 2004’s Catch for Us the Foxes, while building on the rich imagery of 2006’s Brother, Sister. Epic in scope, Pale Horses is mewithoutYou at their best, breathing fresh life into the end times, gloriously terrifying and hauntingly iconic.\nTheir latest album also marks a new beginning for the band, as it’s their first to be released on Run for Cover Records. Teaming with the rising Boston independent label was the outgrowth of their partnership with Will Yip, whose masterful production transforms the band’s transcendental musings into a widescreen experience. Drums and bass lines quake with the faults of the earth, as an army of guitars and multi-instrumental nuances ring in the paranoia, mass hysteria and peaceful exaltation. The result is a stunning collage—fitfully disturbing, steadily bizarre, uniquely celebratory—undoubtedly the grandest musical adventure yet conceived within mewithoutYou’s expanding tapestry."},{"date":"2022-05-22T00:00:00.000+00:00","title":"Girl Ultra, Jasper Bones","url":"https://wl.seetickets.us/event/Girl-Ultra/466589?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/466589/b5be5cafd2d349cc9535ff36ab68c2c4.image!png.424750.png.ScreenShot2022-02-04at3.18.13PM.png","details":"Doors 7pm // Show 8pm // All Ages // $20 Advance \u0026 $25 Day of Show\nCornerstone Presents:\nGIRL ULTRA\nGirl Ultra is a Mexican singer / writer / creative from Mexico City known for her relationship between nostalgia and her music \u0026 art. With 1 album and 2 EP's, it has made its way into the Latin r \u0026 b movement and other genres, being recognized by different media and festivals in Mexico, Latin America, the United States and Europe in the last 5 years.\nShe has been part of high-level platforms such as the A COLORS SHOW sessions in Berlin, the Primavera Sound sessions in Barcelona and Fader Fort in the USA.\nshe has had features and appearances in the New York Times, in El País, Vogue México, on the cover of Galore magazine, among others.\nwith JASPER BONES"},{"date":"2022-05-22T00:00:00.000+00:00","title":"BandWorks Presents: Spring Rock Festival","url":"https://wl.seetickets.us/event/BandWorks-Presents-Spring-Rock-Festival/477115?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/477115/fcce32254d6f4c43b686560affe56428.image!png.1757318.png.ScreenShot2022-04-04at10.01.38PM.png","details":"Doors 10:30am // Show 11am // All Ages // $10 General Admission\nBandworks Presents:\nSPRING ROCK FESTIVAL\nwith MIDNIGHT DAYDREAM, KONTROL, MAHOGANY LEOPARD, DRY HEAT, BABY ON A RAMPAGE, VALENTINA, ALLIGATOR RIOT, THE JONAS SISTERS, BRAKELXGHTS, and WOODSHOP"},{"date":"2022-05-25T00:00:00.000+00:00","title":"Ramirez","url":"https://wl.seetickets.us/event/RAMIREZ-A-Concert-To-Benefit-Boys-and-Girls-Club-Oakland/480336?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/480336/901d7e554186475f8dc69b09488ca2ce.image!png.1334188.png.ScreenShot2022-04-22at12.26.47PM.png","details":"Doors 7pm // Show 8pm // All Ages // $25 Advance \u0026 $30 Day of Show\nCornerstone Presents:\nRAMIREZ\n\nA Concert To Benefit Boys \u0026 Girls Club Oakland \n\nall proceeds will go to Boys \u0026 Girls Club\n\nHailing from the Bay Area, G59's Ramirez has an expansive and diverse catalog of sounds influenced by both West Coast Rap and Southern Trap alike. Not only does Ramirez possess a discography of unique sounds dating back to 2013, but his lyricism transcends the confines of the modern day cloud-rapper. This penchant for dark and melodic rhythms combined with vivid lyrics have allowed Ramirez to climb to the top of his lane and have aligned him with the likes of juggernauts such as $uicideboy$ (G.R.E.Y.G.O.D.S \u0026 G.R.E.Y.G.O.D.S. I.I.), Yung Gravy (The Boys Are Back In Town), Ghostemane (Bermuda), Pouya, and others on multiple EPs and singles.\n\nIn 2019 Ramirez released the widely acclaimed Son of Serpentine, which also featured appearances by Pouya and Zillakami of City Morgue on the versatile 14-track album. In February of 2020 the Bay Area-native released \"The Voices in the Dark\" ahead of his North American tour in which he sold out 13 straight shows with no support acts. G59's Ramirez has both a significant amount of music and live shows coming down the pipeline in 2020 and beyond as he continues his steady climb to the peak of the genre."},{"date":"2022-05-27T00:00:00.000+00:00","title":"Rivers of Nihil, Fallujah / Alluvial / Warforged / The Zenith Passage","url":"https://wl.seetickets.us/event/Rivers-of-Nihil/466239?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/466239/d48f6b19464849e18eaedbbab491e2da.image!jpeg.494618.jpg.5.27.22-Rivers_Of_Nihil-11x17-500kb.jpg","details":"Doors 6:30pm // Show 7pm // All Ages // $15 Advance \u0026 $19 Day of Show\nCornerstone Presents:\nRIVERS OF NIHIL\n\nplus FALLUJAH, THE ZENITH PASSAGE, ALLUVIAL, and WARFORGED"},{"date":"2022-05-28T00:00:00.000+00:00","title":"Ravyn Lenae, Unusual Demont","url":"https://wl.seetickets.us/event/Ravyn-Lenae/479421?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/479421/3f2a1ffd9bb745e3949432884c51fb61.image!png.3920062.png.ScreenShot2022-04-15at2.39.32PM.png","details":"Doors 7pm // Show 8pm // All Ages // $32 Advance \u0026 $36 Day of Show\nCornerstone Presents:\nRAVYN LENAE\nwith UNUSUAL DEMONT"},{"date":"2022-05-29T00:00:00.000+00:00","title":"DB.Boutabag, Kai Bandz / 1100 Himself \u0026 Mitchell","url":"https://wl.seetickets.us/event/DBBoutabag/473830?afflky=CornerstoneBerkeley","img":"","details":"Doors 8pm // Show 9pm // All Ages // $20 Advance \u0026 $25 Day of Show\nCornerstone Presents: \nDB.BOUTABAG\nwith KAI BANDZ and 1100 Himself \u0026 Mitchell "},{"date":"2022-05-30T00:00:00.000+00:00","title":"The Strike / Sub Radio","url":"https://wl.seetickets.us/event/The-Strike-and-Sub-Radio/478650?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/478650/1169cd47fe884a3eb9a4bcbc2ec34378.image!png.2642744.png.ScreenShot2022-04-12at10.17.01AM.png","details":"Doors 7pm // Show 8pm // All Ages // $15 Advance \u0026 $19 Day of Show\nCornerstone Presents:\nTHE STRIKE X SUB RADIO\nThe Strike is a 5 member independent band based in Los Angeles, CA.  The band is headed by front man Chris Crabb and supported by Alex Palazzo -guitar, David Maemone - keys, Frank Ojeda-bass, and Jay Tibbitts-drums.\nThe Strike released their debut album \"Faint of Heart\" in June of 2017, which was met with great enthusiasm nationally. The success of the record allowed them to expand their presence into Los Angeles from the greater Mountain West region where the band began.\nThe Strike is known for their captivating live performances. In an age of musical minimalism, The Strike is reminiscent of rock bands from the 70's and 80's. They feature true showmanship in an age where the art of performance has been forgotten. Chris Crabb's vocal style is akin to rock vocalists such as Lou Gramm, or Steve Perry. The band members are all students at their craft. Those who attend Strike shows become instant fans.\n\nSUB-RADIO\nSub-Radio makes indie pop that grooves, stabs, winks, punches, inspires. Founded by six childhood friends, they built a worldwide following on the strength of ecstatic virtual and live shows and a stream of releases. Following the release of their 2020 EP Thoughts Lights Colors Sounds, produced by Andrew Maury (Shawn Mendes, Lizzo, COIN), the band embarked on a pandemic-induced virtual Reddit tour, reaching over 4 million unique viewers in just 5 months. Their latest single “What You Want To Hear”, debuting in February 2021, is a pop blast of love and compassion in the face of adversity."},{"date":"2022-06-04T00:00:00.000+00:00","title":"Atsuko Okatsuka","url":"https://wl.seetickets.us/event/Atsuko-Okatsuka/479164?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/479164/73be1d3490a947e6bcb1010edbf1a7fa.image!png.1326777.png.ScreenShot2022-04-14at11.49.57AM.png","details":"Doors 6pm // Show 7pm // All Ages // $20 Advance \u0026 $24 Day of Show \nCornerstone Presents:\nATSUKO OKATUKA\n\nWhen confronted with a home intruder, Atsuko realises that her unconventional upbringing may have actually prepared her for just this moment. Named “One of the best in the biz” Vulture, and “Refreshing, artistic, and boundlessly confident” Time Out.\n\nAtsuko Okatsuka is a comedian, writer, and actor seen on CBS's The Late Late Show with James Corden. VULTURE stated that her set \"won late-night\" the week that it aired. She is currently a cast member on Stephen Colbert's animated projects Fairview and Washingtonia on Comedy Central and Paramount +.\nShe regularly makes viral videos with her 86-year-old grandmother, such as the Beyonce \"Drop Challenge\" that they accidentally created, which took off and recreated internationally and amassed a viewership of over 7 million.\n\nHer comedy has been written about in Paste Magazine, Variety, and The New York Times to name a few, and her debut comedy album \"But I Control Me\" was featured on NPR's Bullseye with Jesse Thorn as one of the best comedy albums released in 2020."},{"date":"2022-06-09T00:00:00.000+00:00","title":"Lyte Mike Love \u0026 The Full Circle / Dub Inc.","url":"https://wl.seetickets.us/event/Mike-Love-and-The-Full-Circle-with-Dub-Inc/462001?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/462001/ba9dec5824a348b3bbd8ea28eb066603.image!png.344602.png.ScreenShot2022-01-07at11.24.11AM.png","details":"Doors 7pm // Show 8pm // All Ages // $22 Advance \u0026 $25 Day of Show\nCornerstone Presents:\nMIKE LOVE \u0026 THE FULL CIRCLE \n\nwith DUB INC. "},{"date":"2022-06-11T00:00:00.000+00:00","title":"Los Pericos","url":"https://wl.seetickets.us/event/Los-Pericos/444784?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/444784/3c14882d1ad7407cb84c0f301fbedb93.image!jpeg.264667.jpeg.los-pericos-1_orig.jpeg","details":"Doors 8pm // Show 930pm // All Ages // $45 Advance \u0026 $55 VIP Balcony / Meet and Greet $70 \nJaffe Events Presents:\nLOS PERICOS"},{"date":"2022-06-12T00:00:00.000+00:00","title":"Fangirl Fantasy: One Direction vs 5 Seconds of Summer","url":"https://wl.seetickets.us/event/Fangirl-Fantasy-One-Direction-vs-5-Seconds-of-Summer/478978?afflky=CornerstoneBerkeley","img":"","details":"Doors 7pm // Show 8pm // 18+ // $15 Early Bird (limited amount) // $18 Advance // $20 Day of Show\nFangirl Fantasy Presents:\nOne Direction vs 5 Seconds of Summer\nFangirl Fantasy is the ultimate fangirl experience created by a fangirl for a fangirl. A night where all your favorite music is played in one place. It's a night where you can be unapologetically yourself."},{"date":"2022-06-16T00:00:00.000+00:00","title":"The Hip Abduction, Surfer Girl","url":"https://wl.seetickets.us/event/The-Hip-Abduction/477272?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/477272/f5efaba877314548b977b15bff25d082.image!png.2951647.png.ScreenShot2022-04-05at4.44.16PM.png","details":"Doors 7pm // Show 8pm // All Ages // $15 Advance \u0026 $19 Day of Show\nCornerstone Presents:\nTHE HIP ABDUCTION\nEvoking the ocean and guided by the spirit of travel, The Hip Abduction pilot a sonic expedition past genre barriers. The band is the moniker for singer/songwriter David New who writes and produces music in between travel excursions and touring. Live shows morph into a versatile musical ensemble consisting of Matt Poynter (drums), Chris Powers (bass), Justino Walker (guitar, vocals, ngoni), and Cody Moore (keys, sax); each of whom have a mutual appreciation for African (Afrobeat/Soukous/Malian Blues), Reggae, and American (jam/electronic/indie) music. Since 2012, the band has played almost every noteworthy music festival in the country, has landed major TV/Movie syncs and Sirius Xm radio spins, have ~400k mo listeners on Spotify, have provided direct cross country tour support for artists like Dirty Heads, Galactic, Slightly Stoopid, The Revivalists, and who’s highly energized live show have landed the 5-piece a sizable fanbase across the US and Canada.\n with SURFER GIRL"}]