[{"date":"2022-06-04T00:00:00.000+00:00","title":"Atsuko Okatsuka, Sureni Weerasekera","url":"https://wl.seetickets.us/event/Atsuko-Okatsuka/479164?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/479164/73be1d3490a947e6bcb1010edbf1a7fa.image!png.1326777.png.ScreenShot2022-04-14at11.49.57AM.png","details":"Doors 6pm // Show 7pm // All Ages // $20 Advance \u0026 $24 Day of Show \nCornerstone Presents:\nATSUKO OKATUKA\n\nWhen confronted with a home intruder, Atsuko realises that her unconventional upbringing may have actually prepared her for just this moment. Named “One of the best in the biz” Vulture, and “Refreshing, artistic, and boundlessly confident” Time Out.\n\nAtsuko Okatsuka is a comedian, writer, and actor seen on CBS's The Late Late Show with James Corden. VULTURE stated that her set \"won late-night\" the week that it aired. She is currently a cast member on Stephen Colbert's animated projects Fairview and Washingtonia on Comedy Central and Paramount +.\nShe regularly makes viral videos with her 86-year-old grandmother, such as the Beyonce \"Drop Challenge\" that they accidentally created, which took off and recreated internationally and amassed a viewership of over 7 million.\n\nHer comedy has been written about in Paste Magazine, Variety, and The New York Times to name a few, and her debut comedy album \"But I Control Me\" was featured on NPR's Bullseye with Jesse Thorn as one of the best comedy albums released in 2020.\n\nPlus SURENI WEERASEKERA"},{"date":"2022-06-09T00:00:00.000+00:00","title":"Lyte Mike Love \u0026 The Full Circle / Dub Inc.","url":"https://wl.seetickets.us/event/Mike-Love-and-The-Full-Circle-with-Dub-Inc/462001?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/462001/ba9dec5824a348b3bbd8ea28eb066603.image!png.344602.png.ScreenShot2022-01-07at11.24.11AM.png","details":"Doors 7pm // Show 8pm // All Ages // $22 Advance \u0026 $25 Day of Show\nCornerstone Presents:\nMIKE LOVE \u0026 THE FULL CIRCLE \n\nwith DUB INC. "},{"date":"2022-06-11T00:00:00.000+00:00","title":"Los Pericos","url":"https://wl.seetickets.us/event/Los-Pericos/444784?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/444784/3c14882d1ad7407cb84c0f301fbedb93.image!jpeg.264667.jpeg.los-pericos-1_orig.jpeg","details":"Doors 8pm // Show 930pm // All Ages // $45 Advance \u0026 $55 VIP Balcony / Meet and Greet $70 \nJaffe Events Presents:\nLOS PERICOS"},{"date":"2022-06-12T00:00:00.000+00:00","title":"Fangirl Fantasy: One Direction vs 5 Seconds of Summer","url":"https://wl.seetickets.us/event/Fangirl-Fantasy-One-Direction-vs-5-Seconds-of-Summer/478978?afflky=CornerstoneBerkeley","img":"","details":"Doors 7pm // Show 8pm // 18+ // $15 Early Bird (limited amount) // $18 Advance // $20 Day of Show\nFangirl Fantasy Presents:\nOne Direction vs 5 Seconds of Summer\nFangirl Fantasy is the ultimate fangirl experience created by a fangirl for a fangirl. A night where all your favorite music is played in one place. It's a night where you can be unapologetically yourself."},{"date":"2022-06-16T00:00:00.000+00:00","title":"The Hip Abduction, Surfer Girl","url":"https://wl.seetickets.us/event/The-Hip-Abduction/477272?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/477272/f5efaba877314548b977b15bff25d082.image!png.2951647.png.ScreenShot2022-04-05at4.44.16PM.png","details":"Doors 7pm // Show 8pm // All Ages // $15 Advance \u0026 $19 Day of Show\nCornerstone Presents:\nTHE HIP ABDUCTION\nEvoking the ocean and guided by the spirit of travel, The Hip Abduction pilot a sonic expedition past genre barriers. The band is the moniker for singer/songwriter David New who writes and produces music in between travel excursions and touring. Live shows morph into a versatile musical ensemble consisting of Matt Poynter (drums), Chris Powers (bass), Justino Walker (guitar, vocals, ngoni), and Cody Moore (keys, sax); each of whom have a mutual appreciation for African (Afrobeat/Soukous/Malian Blues), Reggae, and American (jam/electronic/indie) music. Since 2012, the band has played almost every noteworthy music festival in the country, has landed major TV/Movie syncs and Sirius Xm radio spins, have ~400k mo listeners on Spotify, have provided direct cross country tour support for artists like Dirty Heads, Galactic, Slightly Stoopid, The Revivalists, and who’s highly energized live show have landed the 5-piece a sizable fanbase across the US and Canada.\n with SURFER GIRL"},{"date":"2022-06-17T00:00:00.000+00:00","title":"Through The Roots","url":"https://wl.seetickets.us/event/Through-The-Roots/472592?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/472592/ca587b445c3848e0a12557136b8edcea.image!png.2523156.png.ScreenShot2022-03-11at4.35.16PM.png","details":"Doors 8pm // Show 9pm // All Ages // $14 Advance \u0026 $17 Day of Show\nCornerstone Presents:\nTHROUGH THE ROOTS\n\nFew things ever grow tall without roots. For the five members of Through The Roots, it took a decade of inspired songwriting and heavy touring to develop the band's unique sound: a modern blend of roots reggae, hip-hop, rock, and electronic pop. It's a sound that nods to the band's diverse influences while also reaching far beyond them, and it began humbly enough, with the guys hosting their own backyard shows in college towns across southern California. \n\nWord spread. Crowds grew. Through The Roots bought a renovated school bus and hit the road hard, graduating from college frat parties to larger clubs, building their audience show by energetic show. Proudly based in San Diego, they also found mentors in Cali-based reggae bands like the Grammy-nominated Rebelution, who began inviting Through The Roots on a series of nationwide tours. Again, word spread and crowds grew. Throughout it all, the band kept writing and exploring new sounds, working their way toward a truly unique sound that blended tradition with technology. \n\nTheir identity now fully formed, Through The Roots make their reintroduction with 2019's Arrival, an album that straddles the borders between the band's various influences. This is collective, collaborative music, filled with messages as positive and upbeat as the songs themselves. There are grooves and guitars, melodic hooks and rapped verses, tight bass patterns and gauzy keyboards, digital samples and organic songwriting. From the digital dancehall beats of \"Distant Memory\" to the spacey wash of synthesizers that kickstarts \"Stop the Clock,\" Arrlval's 13 songs serve as a sort of musical mission statement, shining light on a band of brothers who remain dedicated to evolving and expanding their approach. \n\nPart of that evolution includes working with an outside producer for the first time. Looking for a new perspective, Through the Roots recruited Hawaiian producer Lapana Ieriko, who personally sequenced the bulk of the record's drum parts. The result is a big-hearted album with a digital pulse. \"It allowed us to create something we've never made before,\" says frontman Evan Hawkins. \"We're moving away from the grassroots beginnings, diving into samples and utilizing technology, creating a different sound. It's still us, but it's a new, refreshing us.\"\n\nYears before forming the band, Through The Roots' five members all grew up near the ocean. Hawkins spent his childhood in the north county of San Diego. Drummer Taylor Boatwright grew up in Florida, while lead guitarist Corrick Watson was raised in Oahu, Hawaii. Keyboardist Brady O'Rear and bass player Budda Foster both came from Hawaii, too, having spent their earlier years on the Big Island. When they all met in San Diego, they were five musicians with different backgrounds and mixed musical interests. Together, they dedicated themselves to a common goal: creating their own version of reggae music, one that honored their roots but also pushed through them. The band's name was born, and Through The Roots got to work. \n\nBlending roots reggae, Cali reggae/rock, Hawaiian Islands reggae, electronic sounds, and modern pop into the same mix, Arrival is every bit the grand entrance that its name suggests. It's also a reminder of Through The Roots' drive and dedication. Still a proudly independent band, they've weathered lineup changes and other challenges throughout their decade-plus past. The band's tour bus even burnt to the ground in 2015, while Through The Roots drove through North Carolina on their way to a show in Wilmington. The guys still made it to the show that night, refusing to let another obstacle get in their way of their connection with their fans. Arrival takes much of its strength from that intimate link between the band and the audience, delivering a track list that's as exciting as the group's live show. It's been a long trip to get here, but Though The Roots have officially arrived. They're announced their presence. And they're here to stay. "},{"date":"2022-06-18T00:00:00.000+00:00","title":"Prof, Mac Turner / Tae Supreme / Willie Wonka","url":"https://wl.seetickets.us/event/Prof/475759?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/475759/429c77952c7e494ebe32d3fbb286ef6f.image!png.1033775.png.ScreenShot2022-03-30at12.32.40PM.png","details":"Doors 8pm // Show 9pm // All Ages // $22 Advance \u0026 $25 Day of Show\nCornerstone Presents:\nPROF\nwith MAC TURNER, TAE SUPREME, and WILLIE WONKA"},{"date":"2022-06-23T00:00:00.000+00:00","title":"Leotrix","url":"https://wl.seetickets.us/event/EPTIC-Presents-The-End-Of-The-World-Tour/473804?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/473804/7e4ba395c24f4a998578f80c7943e8b6.image!png.896575.png.ScreenShot2022-03-18at4.22.15PM.png","details":"Doors 7pm // Show 8pm // All Ages // $20 Advance \u0026 $24 Day of Show\nCornerstone Presents: \nEPTIC\nwith LEOTRIX"},{"date":"2022-06-24T00:00:00.000+00:00","title":"Mars Junction","url":"https://wl.seetickets.us/event/Mars-Junction/483296?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/483296/946befad83e7499c8fbfe50b6fcb6f95.image!png.1436007.png.ScreenShot2022-05-10at5.37.07PM.png","details":"Doors 8pm // Show 9pm // Ages 21+ // $15 Advance \u0026 $19 Day of Show\n***This is a standing room general admissions show. There will be a limited number of chairs located in the back of the concert hall. Seating will be first come first served. The restaurant will be open for dinner starting at 4pm.\nFelton Music Hall Presents:\nMARS JUNCTION\nMars Junction, featuring Tyler (vocals) and Cameron (guitar) Winklevoss, is a newly formed hard-hitting rock band that will have you singing and dancing all night long to your favorite songs from artists like “The Killers”, “Blink 182”, “Rage Against The Machine”, and many more. Come on out and party with us!"},{"date":"2022-06-30T00:00:00.000+00:00","title":"girlfriends, 93FEETOFSMOKE","url":"https://wl.seetickets.us/event/Girlfriends/481789?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/481789/895933c0420348e9b8671f4ccb8e7606.image!png.754209.png.ScreenShot2022-05-02at1.35.31PM.png","details":"Doors 7pm // Show 8pm // All Ages // $15 Advance \u0026 $20 Day of Show\nCornerstone Presents: \nGIRLFRIENDS\nAs the exceedingly prolific pair known as girlfriends, Travis Mills and Nick Gross conjure songs that are at once pleasingly familiar and warmly unique. In less than three years, the duo created not one but two urgent, inspired, and original albums. \n They’ve already sold out the Roxy in LA; opened for Machine Gun Kelly; toured with Mod Sun and Grayscale; and played a festival with Twenty One Pilots. SPIN called girlfriends’ self-titled debut “polished, impassioned, and commanding,” comparing their cross-genre appeal to MGK and Trippie Redd. Fans streamed the first album more than 46 million times on Spotify alone, driven by songs like “California,” “Where Were You” (ft. Travis Barker), and “Jessica.” \n 2022 saw the release of standout singles like “High Again,” “Toaster For A Swim,” “Missing You,” “Pretty Mouth” and “Tattoo.” Their sophomore album (e)motion sickness comes out in June 2022. \n Before girlfriends formed, neither Travis nor Nick were strangers to creativity or community. The brash rap songs Travis posted on MySpace as T. Mills led to a major label deal, Warped Tour, and diehard fans. He later became a host for Apple Music 1. Nick played in a major label rock band before founding Gross Labs. Both guys are equally enthusiastic about having another go at the style of caffeinated pop-punk that first shaped them. \n The group’s music is a vehicle for self-expression and catharsis, a means to process grief, uncertainty, and renewed vigor for life destined to connect with others who struggle. \n That’s something girlfriends will never take for granted.\n\nwith 93FEETOFSMOKE "},{"date":"2022-07-01T00:00:00.000+00:00","title":"Capolow, Fredo Bagz","url":"https://wl.seetickets.us/event/Capolow/477098?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/477098/8f13345db9b84b639c7435ac86c7e075.image!png.1159044.png.ScreenShot2022-04-04at8.39.22PM.png","details":"Doors 7pm // Show 8pm // All Ages // $24 Advance \u0026 $29 Day of Show\nCornerstone Presents:\nCAPOLOW \nwith FREDO BAGZ"},{"date":"2022-07-07T00:00:00.000+00:00","title":"ANVIL, White Wizard / Midnite Hellion","url":"https://wl.seetickets.us/event/ANVIL/474652?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/474652/c23579156fda423bb8adffaa6ad6870b.image!png.1259616.png.ScreenShot2022-04-12at10.51.29AM.png","details":"Doors 6:30pm // Show 7:30pm // All Ages // $17 Advance \u0026 $19 Day of Show\nCornerstone Presents:\nANVIL\nAFM Records is proud to announce Canadian legends Anvil US tour to compliment their crushing new album “Impact Is Imminent” out May 20th!  Their nineteen studio album with fourteen songs feature plenty of highlights and special features: ‘Ghost Shadow’ the first single/ video.  The first single is at full pedal-to-the-metal mode, featuring extraordinary harmonies and a strange, dark ghost train atmosphere.\nLips states returning to the stage– “Hell and high water has come and gone now it's time to rock! It can't happen soon enough!”\nThe Canadian trio belongs to one of the most distinctive bands of their genre, often cited as having influenced notable metal acts such as Slayer, Megadeath, Metallica or Anthrax. After 40 years in the music industry, touring the world in sold-out venues, and garnering critically acclaim for Anvil! The Story Of Anvil – the number #1 music documentary of every metalhead – the iconic band returns with their nineteenth album.\nNew album “Impact Is Imminent” fires off merciless riff attacks, relentlessly driving drums and impressive bass grooves, complemented by vocal melodies and lyrics that inevitably drill themselves into the listener’s aural tract. As always, Kudlow and founding member and drummer Robb Reiner, are at the epicentre of this heavy metal extravaganza. For the past eight years, they have been supported by bassist Chris Robertson, who not only complements the Anvil fold on a personal level, but also enhances the tracks with his powerful low frequency bass parts and backing vocals.\nRobb Reiner said – “FUCK COVID…After 2+yrs away here we come….Looking forward to seeing all you pounders…Let’s make sure to Rock That Shit!”\nwith WHITE WIZARD and MIDNITE HELLION"},{"date":"2022-07-10T00:00:00.000+00:00","title":"Drugdealer","url":"https://wl.seetickets.us/event/Drugdealer/480789?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/480789/32dee07abc894d7ab0a54c6763238918.image!png.1692882.png.ScreenShot2022-04-26at10.05.16AM.png","details":"Doors 7pm // Show 8pm // All Ages // $22 Advance \u0026 $24 Day of Show\nCornerstone Presents:\nDRUGDEALER\n“All anyone wants to be is what they can.”\nIn an era when networked access to information is nearly universal and wearing influences on your sleeve is normalized, it often feels like everything’s been done. Which begs the questions: What’s the point of creating? Does the world need another still life of fruit? Another film about love? Does the world need another melody?\nOn Raw Honey, his second album as Drugdealer, Michael Collins colors these existential conundrums with lush arrangements, memetic melodies, and a vulnerable tunefulness that tries to make sense of self-doubt and connected loneliness in our shared simulacra.\nCollins, who never played an instrument, let alone received musical training in any formal capacity, began experimenting with sounds in 2009 after traversing the US on freight trains. After a few years crafting abstract sampledelia, he decided to forgo his experimental exercises in favor of teaching himself how to write the traditional song. In doing so, he made the decision to approach songwriting from the perspective of a listener, rather than a “musician.”\nIn 2013, Collins headed west and enmeshed himself in the Los Angeles underground scene. It was then that he began collaborating with players in the orbit of Ariel Pink, slowly over time crafting what would become Drugdealer’s debut album, The End of Comedy, a collection of sunlit songs as indebted to Laurel Canyon psych pop as it is Bacharian orchestration.\nRaw Honey continues where The End of Comedy left off, with Collins once again leading an ace crew of collaborators to coalesce the spirit of Drugdealer’s classically modern pop. Built on the foundation of a creative partnership between Collins, Sasha Winn (vocals) and Shags Chamberlain (bass, production), Drugdealer is more a collective than band. Raw Honey features contributions of Josh Da Costa (drums), Jackson MacIntosh (guitar), Danny Garcia (guitar), Michael Long (lead guitar), and Benjamin Schwab (backing vocals, guitar, organ, piano, wurlitzer), as well as guest vocalists like country balladeer Dougie Poole (“Wild Motion”), Harley Hill-Richmond (“Lonely”), and frequent collaborator Natalie Mering (Weyes Blood) whose dulcet tones sing low before soaring on “Honey,” a track as silky as the nectar itself.\nThroughout Raw Honey, Collins and crew display their influences as a new tapestry, one woven with the recycled fibers from thousands of tapestries that have colored our collective listening histories. As evidenced throughout Raw Honey, Collins has an ear for penning numbers that would sound as at home on Classic Rock radio as they would at Zebulon in Los Angeles, where any of the contributors to Raw Honey could, perhaps, be found on any night of the week, on stage, or in the audience supporting another Angelino’s modern pop aspirations.\nRather than hiding behind a curtain or casually sidestepping AOR tropes, Raw Honey adheres to a modern kind of creation — one that cultivates influences and espouses reverence. An honest totem, Raw Honey isn’t tangled up in social norms, with Collins prefering to air his self-doubt as a northern star to guide like-minded people wherever they need to go.\nDrugdealer’s Raw Honey will be released on April 19, 2019 via Mexican Summer."},{"date":"2022-07-11T00:00:00.000+00:00","title":"fish narc","url":"https://wl.seetickets.us/event/Fish-Narc/453433?afflky=CornerstoneBerkeley","img":"","details":"Doors 530pm // Show 630pm // All Ages // $16 Advance \u0026 $19 Day of Show\nCornerstone Presents:\nFISH NARC "},{"date":"2022-07-14T00:00:00.000+00:00","title":"Micro Mania Midget Wrestling","url":"https://wl.seetickets.us/event/Micro-Mania-Midget-Wrestling/482154?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/482154/10ded0896a314432b51c16eeb1925db9.image!png.1292526.png.ScreenShot2022-05-03at4.48.55PM.png","details":"Doors 7pm // Show 8pm // All Ages \n $20 Balcony Standing // $35 Floor Seated // $50 Balcony Seated // $99 Ring Side VIP \nCornerstone Presents:\nMICRO MANIA MIDGET WRESTLING"},{"date":"2022-07-15T00:00:00.000+00:00","title":"Iya Terra, Cydeways","url":"https://wl.seetickets.us/event/Iya-Terra/459197?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/459197/55a821268d40473aac46716ef2dde424.image!png.3590302.png.ScreenShot2022-04-11at11.14.00AM.png","details":"Doors 7pm // Show 8pm // All Ages // $22 Advance \u0026 $27 Day of Show / $30 Balcony / $69 VIP Package \nCalifornia Roots Presents:\nIYA TERRA with CYDEWAYS"},{"date":"2022-07-20T00:00:00.000+00:00","title":"Melvins, Helms Alee / Harsh Mellow","url":"https://wl.seetickets.us/event/Melvins/478507?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/478507/bf15704b5b0a4f4aa2565a4b65052377.image!png.4579027.png.ScreenShot2022-04-11at2.04.22PM.png","details":"Doors 7pm // Show 8pm // All Ages // $30 Advance \u0026 $35 Day of Show\nCornerstone Presents:\nMELVINS\nThe Melvins are one of modern music’s most influential bands. Having formed in 1983 Montesano, Washington, the group founded by singer/guitar player Buzz Osborne (with stalwart drummer Dale Crover joining the following year), has been credited with merging the worlds of punk rock and heavy music, forming a new subgenre all its own. Over the band’s nearly 40-year history, they’ve released over 30 original albums, numerous live full-lengths and far too many to count singles and rarities. Most recently they released the 36-track acoustic collection Five Legged Dog, featuring reinterpretations of some of their heaviest songs as well as covers from their favorite artists. In the course of their discography, they've partnered with Jello Biafra, Mudhoney, and Fantômas for individual releases and toured the world many times over. In fact, the band had the misfortune to be in both Christchurch and Tokyo for their 2011 earthquakes. In 2012, the Melvins completed the “51 States in 51 Days” (50 states +DC) tour, which was chronicled in the film “Across The USA in 51 Days.” The current incarnation of the band is Osborne, Crover, and Steven McDonald (Redd Kross/OFF!). Previous line-ups include a pairing of Osborne and Crover with Big Business band members Jared Warren and Coady Willis, a four-piece featuring the current trio plus Butthole Surfers’ Jeff Pinkus, as well as Melvins Lite, which partners Osborne and Crover with Mr. Bungle’s Trevor Dunn. Sometimes, if you’re extra lucky, one version of the Melvins will open for the Melvins.\n#\nwith HELMS ALEE and HARSH MELLOW"},{"date":"2022-07-21T00:00:00.000+00:00","title":"Nattali Rize, Indubious / Minori","url":"https://wl.seetickets.us/event/Nattali-Rize/482968?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/482968/961687f459da42a2948682596e98051d.image!jpeg.1209789.jpg.Rize-Socials-Berk-web.jpg","details":"Doors 7pm // Show 8pm // All Ages // $20 Advance \u0026 $24 Day of Show\nCornerstone Presents:\nNATALI RIZE \nwith INDUBIOUS and MINORI"},{"date":"2022-07-22T00:00:00.000+00:00","title":"Corduroy","url":"https://wl.seetickets.us/event/The-Sounds-of-Grunge/477028?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/477028/fec2b1a762e64c63a6fb4104020818e2.image!jpeg.2642633.jpg.SOGCornerstoneWEB.jpg","details":"Doors 8pm // Show 9pm // All Ages // $20 Advance \u0026 $24 Day of Show\nCornerstone Presents:\n\nTHE SOUNDS OF GRUNGE"},{"date":"2022-07-29T00:00:00.000+00:00","title":"Goof / Surprise Party / Vangozeer / Moms With Bangs","url":"https://wl.seetickets.us/event/Goof-Surprise-Privilege-Vangozeer-Mom-with-bangs/486045?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/486045/28fd58f9abdf43149cbb089532078967.image!jpeg.638387.jpg.AFA28BC9-186F-48E2-B38F-E803A95D42A3.jpg","details":"Doors 7pm // Show 8pm // All Ages // $12 Advance \u0026 $15 Day of Show\nCornerstone Presents:\nGOOF, SURPRISE PRIVILEGE, VANGOZEER. MOMS WITH BANGS"},{"date":"2022-08-03T00:00:00.000+00:00","title":"Skweezy Jibbs, Adam Pasi","url":"https://wl.seetickets.us/event/Skweezy-Jibbs/479365?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/479365/3d9ca34de8604a15a4daed10870a1b34.image!png.1412113.png.ScreenShot2022-04-15at12.28.58PM.png","details":"Doors 7pm // Show 8pm // All Ages // $25 Advance \u0026 $29 Day of Show // $75 VIP\nVip includes:\nOne General Admission ticket\nVIP early entry into the venue\nPre-show VIP program with Skweezy himself!\nVIP signed poster\nExclusive VIP Access laminate\nBy purchasing this ticket, you consent for vip@realgoodtouring.com to email you VIP information regarding your event.\nCornerstone Presents:\nSKWEEZY JIBBS\nSKWEEZY JIBBS PRESENTS CAPS LOCK LIVE ACROSS AMERICA COME SEE THA INSANE INTERACTIVE SHOW THAT SOLD OUT FAST IN PORTLAND AN SEATTLE  STORIES SURPRISES CONTESTS PRIZES CHAOS FUN  TIX ON SALE 4/20 AT 4:20 LOCAL TIME\n  ITS WEIRD\n  ITS WILD\n  ITS INSANE\n  ITS FUNNY\n  ITS CAPS LOCK LIVE WITH UR BOY SKWEEZY JIBBS, ADAM PASI, AND INTRODUCING THE WHEEL OF CHAOS TIX ON SALE 4/20 AT 4:20PM LOCAL TIME"},{"date":"2022-08-04T00:00:00.000+00:00","title":"Laura Marano","url":"https://wl.seetickets.us/event/Laura-Marano-The-Us-Tour/470377?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/470377/de7c78de40fc431a833ed778e725c472.image!png.1465717.png.ScreenShot2022-02-28at11.24.05AM.png","details":"Doors 7pm // Show 8pm // All Ages // $20 Advance \u0026 $25 Day of Show \n$65 VIP: includes \n1 General Admission Ticket\nSoundcheck access, including a song that will not be performed during the show\nMeet \u0026 Greet with Laura, including a photo \nSigned poster \nCornerstone Presents:\nLAURA MARANO\nLaura is a prolific songwriter and classically-trained musician who has written 100+ songs with today’s biggest writers, totaling over 300 million streams across streaming platforms and 20 million fans across socials. She dropped her debut ME EP in 2019, followed by theYOU EP in Oct 2020 and the YOU Deluxe EP in 2021--showing that “there are always two sides to every story.” The project has received praise from the likes of MTV, Billboard, NME,Ones To Watch, Apple Music, Tidal and more.Laura is widely known for starring as singer/songwriter Ally in the Disney Channel hit series “Austin \u0026 Ally,” for which she won Favorite TV Actress at the Kids’ Choice Awards.She also won Choice Comedy Movie Actress at the 2019 Teen Choice Awards for the Netflix record-setting rom-com, The Perfect Date. She can last be seen in the Netflix worldwide #1hit movie The Royal Treatment which Marano produced and starred in, with prominent synchs of her new singles “Dance with You (with Grey)” and “Worst Kind of Hurt (with Wrabel)”. Laura embarks on her first national headlining tour this summer."},{"date":"2022-08-18T00:00:00.000+00:00","title":"Eighteen Visions, END / Wristmeetrazor","url":"https://wl.seetickets.us/event/EIGHTEEN-VISIONS/484606?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/484606/560fb003f3ca4ad09bef9a10cc916d2b.image!png.3828042.png.ScreenShot2022-05-18at9.54.11AM.png","details":"Doors 7pm // Show 7:30pm // All Ages // $20 General Admission // $24 Day of Show\nCornerstone and Hard Times Presents:\nEIGHTEEN VISIONS\nwith END and WRISTMEETRAZOR"},{"date":"2022-09-02T00:00:00.000+00:00","title":"Vein.fm, Candy / Regulate / Living Weapon","url":"https://wl.seetickets.us/event/VEINFM/486648?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/486648/7e5bfc9c58c84921a0a2374ee4074bd1.image!png.2867336.png.ScreenShot2022-05-30at9.17.15AM.png","details":"Doors 7pm // Show 8pm // All Ages // $20 Advance \u0026 $24 Day of Show\nCornerstone \u0026 HARDTIMES Presents:\nVEIN.FM \n\nwith CANDY, REGULATE, \u0026 LIVING WEAPON"},{"date":"2022-09-21T00:00:00.000+00:00","title":"Sun Room","url":"https://wl.seetickets.us/event/SUN-ROOM/484563?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/484563/6e6c1ccbe8ae48cbb57a76d146eb6249.image!png.2021558.png.ScreenShot2022-05-17at4.12.17PM.png","details":"Doors 7pm // Show 8pm // All Ages // $19 General Admission // $24 Day of Show \nCornerstone Presents:\nSUN ROOM\nSun Room is Southern California's newest four piece rock band. Forming in summer of 2020, the four friends draw influence from the beach cities that raised them as they channel a sound that resembles 60's surf rock while creating original tracks that reflect their youth\nwith Special guests"},{"date":"2022-09-26T00:00:00.000+00:00","title":"Too Many Zooz","url":"https://wl.seetickets.us/event/Too-Many-Zooz/484435?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/484435/4ebbb2c526794fbbb3a582d1a31d29ed.image!png.1938600.png.ScreenShot2022-05-16at5.52.28PM.png","details":"Doors 7pm // Show 8pm // All Ages // $25 Advance \u0026 $29 Day of Show // VIP $69\nCornerstone Presents:\n\nTOO MANY ZOOZ"},{"date":"2022-10-05T00:00:00.000+00:00","title":"The Luka State","url":"https://wl.seetickets.us/event/The-Luka-State/485818?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/485818/c8fb70bf737f4057a74a8247a3578822.image!png.647933.png.ScreenShot2022-05-24at3.30.57PM.png","details":"Doors 7pm // Show 8pm // All Ages // $14 Advance \u0026 $17 Day of Show\nCornerstone Presents:\nTHE LUKA STATE"},{"date":"2022-10-11T00:00:00.000+00:00","title":"Red Rum Club","url":"https://wl.seetickets.us/event/Red-Rum-Club/484076?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/484076/2f47c0348f334048a0596f8246845c5e.image!png.2554859.png.ScreenShot2022-05-13at2.54.47PM.png","details":"Doors 7pm // Show 8pm // All Ages // $13 Advance \u0026 $17 Day of Show\nCornerstone Presents:\nRED RUM CLUB"},{"date":"2022-10-24T00:00:00.000+00:00","title":"flor, The Wldlfe / good problem","url":"https://wl.seetickets.us/event/flor-The-Future-Shine-Tour/482444?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/482444/f29e1f1c84124b7d9cf5ca8ea8c2bf00.image!png.3727611.png.ScreenShot2022-05-05at11.15.44AM.png","details":"Doors 7pm // Show 8pm // All Ages // $21 Advance \u0026 $24 Day of Show\nflor Meet \u0026 Greet Experience\n- One GA Ticket\n- Meet \u0026 Greet with flor\n- Individual Photo with flor\n- Access to a Pre-Show Acoustic Performance\n- One Autographed Tour Poster\n- Early Entry\n- First-Access Merchandise Shopping\n\nCornerstone Presents: \nFLOR\nNo matter how far away it may seem, tomorrow glows with possibility and promise. Even the darkest night always breaks at dawn. flor finds light in the promise of a new day. The Hood River, OR quartet—Zach Grace [vocals, guitar], Dylan Bauld [bass], McKinley Kitts [guitar], and Kyle Hill [drums]—excavate unshakable melodies from jubilant synths, buoyant beats, and lush guitars as they relay a coming-of-age story all their own. The group tell this story on their third full-length album, Future Shine [FueledBy Ramen].“I was thinking about people who present solutions for today’s problems to help ensure a brighter future,” observes Zach. “I wanted to emulate that energy, optimism, and desire for a better world. The album is us chasing the goal we’ve been after since high school: to share our art, bring joy, and connect with as many people as possible.”They started chasing that dream back in their hometown of Hood River, OR as high school kids in McKinley’s garage. The band quietly generated hundreds of millions of streams in the wake of their 2016 debut come out. you’re hiding. In 2019, ley linesonly accelerated their momentum buoyed by tracks, including “white noise,” “slow motion,” and “dancing around.” Critical acclaim followed from Nylon, Billboard, Paste, and Ones To Watchwho hailed the album as “an exhilarating balancing act.” They concluded a successful headline tour at the top of 2020 only to face the harsh reality of the Global Pandemic with the rest of us. The boys promised they’d continue writing, but the isolation of quarantine andits ensuing malaisegot in the way.They needed to get back in the same room...”In the past, I would write songs by myself, bring ideas to the guys, and we’d piece them together from there,” Zach reveals. ”Future Shinedidn’t happen that way. When I was back home in quarantine, I wasn’t inspired to write. So, we actually ended up writing all of these songs together during a few separate sessions. We were really more collaborative than ever.”Once it became safe enough to do so, the musicians congregated back in Los Angeles at Dylan’s studio for a series of writing sessions. This time around, they built the bulk of the songs face-to-face together inspired by favorite records from the likes of MGMT, Phoenix, The Killers, and M83.”We’re very lucky to have a producer in the band with his own studio,” smiles Kyle. ”Dylan really stepped up. So many bands couldn’t just go and make a record during the Pandemic. That’s not lost on us, and we’re really grateful.”“I thoughtof it as a great reset,” states McKinely. “There was so much strife in the world politically and socially. So, for the first time, we sat in a room—just the four of us—thought about what we wanted to say, and crafted the songs in a totally new way. There was immediate magic. Imagine if we went back in time to my garage, but we had all of this experience writing songs and touring together? That’s what it was like. All of these years culminated in feeling like kids again.”“We needed to make a new and exciting record,” adds Dylan. “We had a purpose. We tapped into what flor is meant to be.”The joyous synth line of “Play Along” crystallized their excitement for the process. It bounces with a steady beat towards a sweeping and soaring refrain.“I was tryingto be as honest as possible,” says Zach. “I was out of touch with who I want to be. Throughout the Pandemic, I asked myself, ‘Why can’t I get back to living it up like a goofy high schooler?’ I was remembering the happiest times of my life when I was playing games in the yard and running around with my friends in the summer. It captured that young energy, nostalgia, and wild desire. It’s a great reference for the record.”Elsewhere, a warbling vocal melody gives way to a funkified riff and head-nodding bass line on “24.” This upbeat bounce offsets a confession on the handclap-driven bridge, “I hate to be cynical, to break your heart, to steal your soul.”“I was being totally pessimistic,” he sighs. “I was so fed up with people becoming so absorbed in themselves they can’t look at the issues. It touches on the climate crisis we’re having and how it’s not going to get better unless we do something about it. Maybe wealth isn’t the way to take care of humanity and our planet.”On the other end of the spectrum, the tongue-in-cheek “Big Shot” turns an inside joke into an irresistible anthem punctuated by piano, shimmering distortion, and a fittingly bombastic guitar solo.“Anytime someone gets a little cocky, we say, ‘You think you’re a big shot, hot guy’,” Kyle laughs. “We had to sacrifice the joke for a great song, but it was a reasonable trade off!”Then, there’s “Skate.” A glossy melody wraps around the laidback sunny beat before the track catalyzes this momentum into a hypnotic chant. “We envisioned it as a soundtrack to skate and snowboard videos, which we loved to watch as kids,” observes Zach“Gotta Do Something” examines an existential millennial struggle over a backdrop of neon keys and a massive gang vocal.“You’re broke at 30 and wondering what you’re going to do for the rest of your life because you can’t buy a home,” Zach goes on. “Straight up, it’s about me. So, I was like, ‘You can’t just whine about it’.There’s a little bit of my dad’s voice in there,‘Look son, you need to do something.’ It's a kick in the pants to remind me you have to work for what you want.”As a result of that work, Future Shinesees flor at their boldest and brightest.“Personally, we retreated from all of this craziness and took solace in the music,” McKinley leaves off. “If you’re overwhelmed by the world, put this record on, and it can be your safe space to take a breather for thirty minutes. That’s what I hope you get from this record—that light.”“This band has been my family for fourteen years,” Dylan concludes. “During the time off, I realized I can’t live without these guys. I can’t wait to get back on the road and be with them every single day. Let’s keep this going for another 20 or 30 years.”“At least,” agrees Kyle.\nwith THE WLD LIFE and GOOD PROBLEM"},{"date":"2022-11-10T00:00:00.000+00:00","title":"Trevor Hall, Gone Gone Beyond","url":"https://wl.seetickets.us/event/Trevor-Hall-2-Oceans-Tour-Night-1/483121?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/483078/7a2b3bbcc8c94ff992a7ee4cd15dccae.image!png.1309188.png.ScreenShot2022-05-10at7.25.35AM.png","details":"Doors 7pm // Show 8pm // All Ages // $34 Advance \u0026 $39 Day of Show // $68 2 day tickets (limited availability)\nCornerstone Presents: \nTREVOR HALL\nRaised on an island in South Carolina, singer/songwriter Trevor Hall realized at a young age that music was more than just a passion - it was his life’s art. At sixteen, he recorded his first album. Shortly after, Hall left South Carolina for Idyllwild Arts Academy in California where he studied classical guitar and was introduced to the practices of yoga and meditation, which would greatly influence his life and his music.\n\nHall’s music, a blend of roots and folk music with touches of electronic elements, is imbued with a deep love of Eastern Mysticism. This powerful symbiosis fostered a deep connectivity with his growing fan base and Trevor quickly matured into a leader of the burgeoning conscious musical community. Along with numerous pilgrimages to India, he has sold out the historic Red Rocks Amphitheatre in Colorado as a headliner and he also completed a series of sold-out international tours with artists such as Ziggy Marley, Jimmy Cliff, Michael Franti, John Butler Trio, Matisyahu and Brett Dennen.\n\nIN AND THROUGH THE BODY, Hall’s latest record, released September 25th, 2020, presents his most mature sound yet, touching on the timeless human themes of love, struggle, growth and redemption. Hall uses a palette of genres that span from folk, roots-rock, indie, and electronic, all with a consistent wash of authentic far-Eastern influence. \n\nTrevor Hall’s prior release, THE FRUITFUL DARKNESS, was his first independent release and the #1 music campaign of 2017 on Kickstarter. The album was released on June 1st, 2018 and premiered at #4 on the iTunes Alternative Charts. In the lead up to the new album, IN AND THROUGH THE BODY, Hall released a 2020 single featuring Brett Dennen, Put Down What You Are Carrying, which immediately became one of the top streamed songs in his scene.\n\nChapter of the Forest (2014) and KALA (2015), debuted at #3 and #2 on the iTunes singer/songwriter chart respectively.\n\nHall and his wife, Emory, created the Where the Rivers Meet Foundation in 2020 in order to continue their humanitarian efforts in both India and Nepal. “After decades spent traveling across India and Nepal,” they say, “we were inspired to create a foundation that could give back to those lands and people that touched and impacted our lives so immensely.” \n\nIN AND THROUGH THE BODY was produced by Brad Cook (Bon Iver, Hiss Golden Messenger), with additional instrumentation from Phil Cook (Megafaun) and Matthew McCaughan (Bon Iver), as well as vocal accompaniment from Emory Hall. Hall’s mother and sister also have vocal appearances on a song, making the album truly a family affair. The album was recorded in Durham, North Carolina and mixed at Great Stone Studios in Oakland, California (former home of Green Day) by Johnny Cosmic (Stick Figure). \nwith GONE GONE BEYOND"},{"date":"2022-11-11T00:00:00.000+00:00","title":"Trevor Hall, Gone Gone Beyond","url":"https://wl.seetickets.us/event/Trevor-Hall-2-Oceans-Tour-Night-2/483078?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/483078/7a2b3bbcc8c94ff992a7ee4cd15dccae.image!png.1309188.png.ScreenShot2022-05-10at7.25.35AM.png","details":"Doors 7pm // Show 8pm // All Ages // $34 Advance \u0026 $39 Day of Show\nCornerstone Presents: \nTREVOR HALL\nRaised on an island in South Carolina, singer/songwriter Trevor Hall realized at a young age that music was more than just a passion - it was his life’s art. At sixteen, he recorded his first album. Shortly after, Hall left South Carolina for Idyllwild Arts Academy in California where he studied classical guitar and was introduced to the practices of yoga and meditation, which would greatly influence his life and his music.\n\nHall’s music, a blend of roots and folk music with touches of electronic elements, is imbued with a deep love of Eastern Mysticism. This powerful symbiosis fostered a deep connectivity with his growing fan base and Trevor quickly matured into a leader of the burgeoning conscious musical community. Along with numerous pilgrimages to India, he has sold out the historic Red Rocks Amphitheatre in Colorado as a headliner and he also completed a series of sold-out international tours with artists such as Ziggy Marley, Jimmy Cliff, Michael Franti, John Butler Trio, Matisyahu and Brett Dennen.\n\nIN AND THROUGH THE BODY, Hall’s latest record, released September 25th, 2020, presents his most mature sound yet, touching on the timeless human themes of love, struggle, growth and redemption. Hall uses a palette of genres that span from folk, roots-rock, indie, and electronic, all with a consistent wash of authentic far-Eastern influence. \n\nTrevor Hall’s prior release, THE FRUITFUL DARKNESS, was his first independent release and the #1 music campaign of 2017 on Kickstarter. The album was released on June 1st, 2018 and premiered at #4 on the iTunes Alternative Charts. In the lead up to the new album, IN AND THROUGH THE BODY, Hall released a 2020 single featuring Brett Dennen, Put Down What You Are Carrying, which immediately became one of the top streamed songs in his scene.\n\nChapter of the Forest (2014) and KALA (2015), debuted at #3 and #2 on the iTunes singer/songwriter chart respectively.\n\nHall and his wife, Emory, created the Where the Rivers Meet Foundation in 2020 in order to continue their humanitarian efforts in both India and Nepal. “After decades spent traveling across India and Nepal,” they say, “we were inspired to create a foundation that could give back to those lands and people that touched and impacted our lives so immensely.” \n\nIN AND THROUGH THE BODY was produced by Brad Cook (Bon Iver, Hiss Golden Messenger), with additional instrumentation from Phil Cook (Megafaun) and Matthew McCaughan (Bon Iver), as well as vocal accompaniment from Emory Hall. Hall’s mother and sister also have vocal appearances on a song, making the album truly a family affair. The album was recorded in Durham, North Carolina and mixed at Great Stone Studios in Oakland, California (former home of Green Day) by Johnny Cosmic (Stick Figure). \nwith GONE GONE BEYOND"},{"date":"2022-11-12T00:00:00.000+00:00","title":"Melt","url":"https://wl.seetickets.us/event/Melt/484042?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/484042/9055e90b9162469384972417b7e9651f.image!jpeg.844047.jpeg.14649402-C759-4E61-A832-5283CACFC720_1_102_o(1).jpeg","details":"Doors 7:30pm // Show 8:30pm // All Ages // $12 Advance \u0026 $14 Day of Show\nCornerstone Presents:\nMELT\nMelt is a New York City based band who formed in 2017. With a sound that continuously pulls from new realms, at Melt’s core is a shared love of soul and psychedelia, existential pop songs and ethereal jam sections, and a deep love for each other. Melt initially made a name for themselves with their first single “Sour Candy” that reached #5 on Billboard’s US Viral 50 Chart when they were 18 years old. They have since released their first EP “West Side Highway” in 2021: a bold project inspired by an eclectic mix of artists from Diana Ross to Wilco, The Grateful Dead to Maggie Rogers. As Melt continues to grow and reach new heights, they want you to help them create love, build community, and work towards an ever-evolving vision of the future. Join the band on their North America tour this fall and get ready to melt."},{"date":"2022-11-22T00:00:00.000+00:00","title":"Punk Rock Factory","url":"https://wl.seetickets.us/event/Punk-Rock-Factory/485164?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/485164/891b4a77ebf34efba191c48af737f3a0.image!png.1436169.png.ScreenShot2022-05-19at5.15.42PM.png","details":"Doors 7pm // Show 8pm // All Ages // $16 Advance \u0026 $19 Day of Show // VIP $69\nCornerstone Presents:\n\nPUNK ROCK FACTORY"},{"date":"2022-11-30T00:00:00.000+00:00","title":"Avi Kaplan","url":"https://wl.seetickets.us/event/Avi-Kaplan-Floating-on-a-Dream-Tour/484090?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/484090/815d299473a64f2cbcdb48b8d0b5b2f3.image!png.1375614.png.ScreenShot2022-05-13at3.49.01PM.png","details":"Doors 7pm // Show 8pm // All Ages // $20 General Admission // $22 Day of Show // $75 VIP Package\nAvi Kaplan VIP Package includes\nOne general admission ticket or premium reserved seat in the first 12 rows\nEarly entry into the venue\nAccess to an intimate preshow soundcheck\nModerated Q\u0026A with Avi Kaplan\nExclusive 8x10 print; autographed by Avi Kaplan\nSpecially designed Avi Kaplan tote bag\nCommemorative VIP laminate\nLimited availability\nCornerstone Presents:\nAVI KAPLAN\nBy the time Avi Kaplan launched his solo career in 2017, he'd already built an audience that stretched across the globe, racking up three GRAMMY Awards as a member of the platinum-selling vocal group Pentatonix. Avi knew he needed to return to his own artistic foundation -- to the organic acoustic driven rock and roots music that had provided the soundtrack to his upbringing in rural California.\n\nThat musical evolution began with 2020's I'll Get By EP and carried through last year's single, \"Song For the Thankful.\" Now comes Floating on a Dream, (Fantasy Records) Avi's debut full-length solo LP, which further broadens his artistry into enthralling new territory. Produced by Shooter Jennings (Brandi Carlile, The White Buffalo), the album is rendered in long shadows and moody high relief, reflecting Avi's Californian roots and fascination with the American West. Through country, blues, soul, folk, tribal drums, and a touch of gospel, Avi explores matters of the heart, truth, morality, and the search for relevance across the album's 11 original tracks. At the core though, there is that voice. From a haunting falsetto to its deepest bass tones, his instrument is unlike anything else in modern music."}]