[{"date":"2022-05-30T00:00:00.000+00:00","title":"The Strike / Sub Radio","url":"https://wl.seetickets.us/event/The-Strike-and-Sub-Radio/478650?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/478650/1169cd47fe884a3eb9a4bcbc2ec34378.image!png.2642744.png.ScreenShot2022-04-12at10.17.01AM.png","details":"Doors 7pm // Show 8pm // All Ages // $15 Advance \u0026 $19 Day of Show\nCornerstone Presents:\nTHE STRIKE X SUB RADIO\nThe Strike is a 5 member independent band based in Los Angeles, CA.  The band is headed by front man Chris Crabb and supported by Alex Palazzo -guitar, David Maemone - keys, Frank Ojeda-bass, and Jay Tibbitts-drums.\nThe Strike released their debut album \"Faint of Heart\" in June of 2017, which was met with great enthusiasm nationally. The success of the record allowed them to expand their presence into Los Angeles from the greater Mountain West region where the band began.\nThe Strike is known for their captivating live performances. In an age of musical minimalism, The Strike is reminiscent of rock bands from the 70's and 80's. They feature true showmanship in an age where the art of performance has been forgotten. Chris Crabb's vocal style is akin to rock vocalists such as Lou Gramm, or Steve Perry. The band members are all students at their craft. Those who attend Strike shows become instant fans.\n\nSUB-RADIO\nSub-Radio makes indie pop that grooves, stabs, winks, punches, inspires. Founded by six childhood friends, they built a worldwide following on the strength of ecstatic virtual and live shows and a stream of releases. Following the release of their 2020 EP Thoughts Lights Colors Sounds, produced by Andrew Maury (Shawn Mendes, Lizzo, COIN), the band embarked on a pandemic-induced virtual Reddit tour, reaching over 4 million unique viewers in just 5 months. Their latest single “What You Want To Hear”, debuting in February 2021, is a pop blast of love and compassion in the face of adversity."},{"date":"2022-06-04T00:00:00.000+00:00","title":"Atsuko Okatsuka","url":"https://wl.seetickets.us/event/Atsuko-Okatsuka/479164?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/479164/73be1d3490a947e6bcb1010edbf1a7fa.image!png.1326777.png.ScreenShot2022-04-14at11.49.57AM.png","details":"Doors 6pm // Show 7pm // All Ages // $20 Advance \u0026 $24 Day of Show \nCornerstone Presents:\nATSUKO OKATUKA\n\nWhen confronted with a home intruder, Atsuko realises that her unconventional upbringing may have actually prepared her for just this moment. Named “One of the best in the biz” Vulture, and “Refreshing, artistic, and boundlessly confident” Time Out.\n\nAtsuko Okatsuka is a comedian, writer, and actor seen on CBS's The Late Late Show with James Corden. VULTURE stated that her set \"won late-night\" the week that it aired. She is currently a cast member on Stephen Colbert's animated projects Fairview and Washingtonia on Comedy Central and Paramount +.\nShe regularly makes viral videos with her 86-year-old grandmother, such as the Beyonce \"Drop Challenge\" that they accidentally created, which took off and recreated internationally and amassed a viewership of over 7 million.\n\nHer comedy has been written about in Paste Magazine, Variety, and The New York Times to name a few, and her debut comedy album \"But I Control Me\" was featured on NPR's Bullseye with Jesse Thorn as one of the best comedy albums released in 2020."},{"date":"2022-06-09T00:00:00.000+00:00","title":"Lyte Mike Love \u0026 The Full Circle / Dub Inc.","url":"https://wl.seetickets.us/event/Mike-Love-and-The-Full-Circle-with-Dub-Inc/462001?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/462001/ba9dec5824a348b3bbd8ea28eb066603.image!png.344602.png.ScreenShot2022-01-07at11.24.11AM.png","details":"Doors 7pm // Show 8pm // All Ages // $22 Advance \u0026 $25 Day of Show\nCornerstone Presents:\nMIKE LOVE \u0026 THE FULL CIRCLE \n\nwith DUB INC. "},{"date":"2022-06-11T00:00:00.000+00:00","title":"Los Pericos","url":"https://wl.seetickets.us/event/Los-Pericos/444784?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/444784/3c14882d1ad7407cb84c0f301fbedb93.image!jpeg.264667.jpeg.los-pericos-1_orig.jpeg","details":"Doors 8pm // Show 930pm // All Ages // $45 Advance \u0026 $55 VIP Balcony / Meet and Greet $70 \nJaffe Events Presents:\nLOS PERICOS"},{"date":"2022-06-12T00:00:00.000+00:00","title":"Fangirl Fantasy: One Direction vs 5 Seconds of Summer","url":"https://wl.seetickets.us/event/Fangirl-Fantasy-One-Direction-vs-5-Seconds-of-Summer/478978?afflky=CornerstoneBerkeley","img":"","details":"Doors 7pm // Show 8pm // 18+ // $15 Early Bird (limited amount) // $18 Advance // $20 Day of Show\nFangirl Fantasy Presents:\nOne Direction vs 5 Seconds of Summer\nFangirl Fantasy is the ultimate fangirl experience created by a fangirl for a fangirl. A night where all your favorite music is played in one place. It's a night where you can be unapologetically yourself."},{"date":"2022-06-16T00:00:00.000+00:00","title":"The Hip Abduction, Surfer Girl","url":"https://wl.seetickets.us/event/The-Hip-Abduction/477272?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/477272/f5efaba877314548b977b15bff25d082.image!png.2951647.png.ScreenShot2022-04-05at4.44.16PM.png","details":"Doors 7pm // Show 8pm // All Ages // $15 Advance \u0026 $19 Day of Show\nCornerstone Presents:\nTHE HIP ABDUCTION\nEvoking the ocean and guided by the spirit of travel, The Hip Abduction pilot a sonic expedition past genre barriers. The band is the moniker for singer/songwriter David New who writes and produces music in between travel excursions and touring. Live shows morph into a versatile musical ensemble consisting of Matt Poynter (drums), Chris Powers (bass), Justino Walker (guitar, vocals, ngoni), and Cody Moore (keys, sax); each of whom have a mutual appreciation for African (Afrobeat/Soukous/Malian Blues), Reggae, and American (jam/electronic/indie) music. Since 2012, the band has played almost every noteworthy music festival in the country, has landed major TV/Movie syncs and Sirius Xm radio spins, have ~400k mo listeners on Spotify, have provided direct cross country tour support for artists like Dirty Heads, Galactic, Slightly Stoopid, The Revivalists, and who’s highly energized live show have landed the 5-piece a sizable fanbase across the US and Canada.\n with SURFER GIRL"},{"date":"2022-06-17T00:00:00.000+00:00","title":"Through The Roots","url":"https://wl.seetickets.us/event/Through-The-Roots/472592?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/472592/ca587b445c3848e0a12557136b8edcea.image!png.2523156.png.ScreenShot2022-03-11at4.35.16PM.png","details":"Doors 8pm // Show 9pm // All Ages // $14 Advance \u0026 $17 Day of Show\nCornerstone Presents:\nTHROUGH THE ROOTS\n\nFew things ever grow tall without roots. For the five members of Through The Roots, it took a decade of inspired songwriting and heavy touring to develop the band's unique sound: a modern blend of roots reggae, hip-hop, rock, and electronic pop. It's a sound that nods to the band's diverse influences while also reaching far beyond them, and it began humbly enough, with the guys hosting their own backyard shows in college towns across southern California. \n\nWord spread. Crowds grew. Through The Roots bought a renovated school bus and hit the road hard, graduating from college frat parties to larger clubs, building their audience show by energetic show. Proudly based in San Diego, they also found mentors in Cali-based reggae bands like the Grammy-nominated Rebelution, who began inviting Through The Roots on a series of nationwide tours. Again, word spread and crowds grew. Throughout it all, the band kept writing and exploring new sounds, working their way toward a truly unique sound that blended tradition with technology. \n\nTheir identity now fully formed, Through The Roots make their reintroduction with 2019's Arrival, an album that straddles the borders between the band's various influences. This is collective, collaborative music, filled with messages as positive and upbeat as the songs themselves. There are grooves and guitars, melodic hooks and rapped verses, tight bass patterns and gauzy keyboards, digital samples and organic songwriting. From the digital dancehall beats of \"Distant Memory\" to the spacey wash of synthesizers that kickstarts \"Stop the Clock,\" Arrlval's 13 songs serve as a sort of musical mission statement, shining light on a band of brothers who remain dedicated to evolving and expanding their approach. \n\nPart of that evolution includes working with an outside producer for the first time. Looking for a new perspective, Through the Roots recruited Hawaiian producer Lapana Ieriko, who personally sequenced the bulk of the record's drum parts. The result is a big-hearted album with a digital pulse. \"It allowed us to create something we've never made before,\" says frontman Evan Hawkins. \"We're moving away from the grassroots beginnings, diving into samples and utilizing technology, creating a different sound. It's still us, but it's a new, refreshing us.\"\n\nYears before forming the band, Through The Roots' five members all grew up near the ocean. Hawkins spent his childhood in the north county of San Diego. Drummer Taylor Boatwright grew up in Florida, while lead guitarist Corrick Watson was raised in Oahu, Hawaii. Keyboardist Brady O'Rear and bass player Budda Foster both came from Hawaii, too, having spent their earlier years on the Big Island. When they all met in San Diego, they were five musicians with different backgrounds and mixed musical interests. Together, they dedicated themselves to a common goal: creating their own version of reggae music, one that honored their roots but also pushed through them. The band's name was born, and Through The Roots got to work. \n\nBlending roots reggae, Cali reggae/rock, Hawaiian Islands reggae, electronic sounds, and modern pop into the same mix, Arrival is every bit the grand entrance that its name suggests. It's also a reminder of Through The Roots' drive and dedication. Still a proudly independent band, they've weathered lineup changes and other challenges throughout their decade-plus past. The band's tour bus even burnt to the ground in 2015, while Through The Roots drove through North Carolina on their way to a show in Wilmington. The guys still made it to the show that night, refusing to let another obstacle get in their way of their connection with their fans. Arrival takes much of its strength from that intimate link between the band and the audience, delivering a track list that's as exciting as the group's live show. It's been a long trip to get here, but Though The Roots have officially arrived. They're announced their presence. And they're here to stay. "},{"date":"2022-06-18T00:00:00.000+00:00","title":"Prof, Mac Turner / Tae Supreme / Willie Wonka","url":"https://wl.seetickets.us/event/Prof/475759?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/475759/429c77952c7e494ebe32d3fbb286ef6f.image!png.1033775.png.ScreenShot2022-03-30at12.32.40PM.png","details":"Doors 8pm // Show 9pm // All Ages // $22 Advance \u0026 $25 Day of Show\nCornerstone Presents:\nPROF\nwith MAC TURNER, TAE SUPREME, and WILLIE WONKA"},{"date":"2022-06-23T00:00:00.000+00:00","title":"Leotrix","url":"https://wl.seetickets.us/event/EPTIC-Presents-The-End-Of-The-World-Tour/473804?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/473804/7e4ba395c24f4a998578f80c7943e8b6.image!png.896575.png.ScreenShot2022-03-18at4.22.15PM.png","details":"Doors 7pm // Show 8pm // All Ages // $20 Advance \u0026 $24 Day of Show\nCornerstone Presents: \nEPTIC\nwith LEOTRIX"},{"date":"2022-06-24T00:00:00.000+00:00","title":"Mars Junction","url":"https://wl.seetickets.us/event/Mars-Junction/483296?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/483296/946befad83e7499c8fbfe50b6fcb6f95.image!png.1436007.png.ScreenShot2022-05-10at5.37.07PM.png","details":"Doors 8pm // Show 9pm // Ages 21+ // $15 Advance \u0026 $19 Day of Show\n***This is a standing room general admissions show. There will be a limited number of chairs located in the back of the concert hall. Seating will be first come first served. The restaurant will be open for dinner starting at 4pm.\nFelton Music Hall Presents:\nMARS JUNCTION\nMars Junction, featuring Tyler (vocals) and Cameron (guitar) Winklevoss, is a newly formed hard-hitting rock band that will have you singing and dancing all night long to your favorite songs from artists like “The Killers”, “Blink 182”, “Rage Against The Machine”, and many more. Come on out and party with us!"}]