[{"date":"2022-05-03T00:00:00.000+00:00","title":"Prince Daddy \u0026 The Hyena, Macseal / insignificant other / CALIFORNIA COUSINS","url":"https://wl.seetickets.us/event/Prince-Daddy-and-the-Hyena/463504?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/463504/2610d90767ff4090839d4a4ccd4fd3de.image!png.6132317.png.ScreenShot2022-01-17at12.11.12PM.png","details":"Doors 6pm // Show 7pm // All Ages // $18 Advance \u0026 $21 Day of Show\nCornerstone Presents:\nPRINCE DADDY \u0026 THE HYENA\nIt’s a very natural human phenomenon to be scared of death. Whether it’s the idea of your own impending doom that’s rattling around your skull or the mortality of those close to you, such thoughts are part of the curse of human consciousness. Yet for Kory Gregory, that fear was extreme. So extreme, in fact, that when Prince Daddy \u0026 The Hyena were in the middle of making this third full-length, the vocalist/guitarist of the Albany, NY band had to take some time out from, well, everything.\n“I was really scared of dying for some reason,” he remembers. “I know being scared of dying isn’t irrational, but I had an irrational fear of it to a non-functional point. I actually  went to a psychiatric hospital for a month in the middle of writing this record because of it.”\n“You were afraid of it beforehand,” chimes in guitarist Cameron Handford, “and then we actually almost died. We were driving home from a tour and we just wanted to get home really bad. We’d driven through blizzards a million times before being from New York, so we just kept going and that was not the right idea – it was a 12-hour drive and everyone was really tired. One thing led to another and we slid off the road into a snow plough. The van looked like none of us should have survived it. It was pretty intense.”\nThat incident occurred in November 2018, right before the band – now completed by drummer Daniel Gorham and bassist Adam Dasilva – recorded their second album, 2019’s Cosmic Thrill Seekers. They’d already written that record, though, and besides, Gregory’s fixation with death hadn’t quite reached such debilitating proportions by that point. But little by little, it got worse and worse until it was overbearing and all-consuming. Unsurprisingly, then, the 13 songs that make up this self-titled third full-length are riddled with ruminations on life coming to an end.\n“It’s all about my fear of death,” explains Gregory, “but not just for myself. It’s my fear of me dying, my parents dying, my loved ones dying, my fear of aging. My fear of mortality in the most loose, broad sense of the word. It’s the first time that it’s hit me as an adult, the first time that the impermanence of everything struck, and that sent me into a little existential spiral.”\nTo some extent, then, you could call this a kind of concept album, but it’s an accidental one – less intentional than a by-product of the morbid thoughts Gregory was having at the time manifesting themselves into songs by way of catharsis. But that, he clarifies, is just what always happens anyway when he writes.\n“I feel like any record I write is going to be a kind of concept record,” he says, “because I have an obsessive mind and get caught up in something and just write. So everything I wrote in quarantine was about the same thing, about my fear of dying. It’s a snapshot of what I was going through when I wrote these songs.”\nThat said, there are some traditional concept record trademarks present on the album, including a recurring character called The Collector who crops up in different places throughout it. The Collector, says Gregory, is really just “depression or death in corporeal form”, the unimaginable fate that awaits us all personified. Ideally, Gregory wants the listener to imagine The Collector as the photo of his cousin that graces the cover album artwork.\n“To me,” he says, “that photo is the essence of the record. When people hear me singing about the character on this record that isn’t me, I want them to picture that, because it’s a really fucking frightening image!”\nWhether Gregory is relaying his fears more vicariously and allegorically though The Collector or in a more direct fashion, Prince Daddy \u0026 The Hyena delves deep into the heart of darkness at its core. In fact, penultimate song, “Black Mold” is a brooding, near-nine minute long lament in which the frontman revisits one of the bleakest times in his entire life to date. A song that chugs with the anguish of existence, it begins with a voicemail before slowly building into a layered, emotional slow-motion frenzy of redemptive guitars.\n“I had a stint with depression that almost cost me my life,” explains Gregory, “and this song is the first time I ever wrote about it. It’s my favorite song that I’ve ever written, because I haven’t really thought about what happened or ever written about it since, but the end result is something that I’m super proud of.”\n“And as for the voicemail,” adds Dasilva, “it was left by a friend of Kory’s who called Kory one night. Kory missed the phone call and then listened to the voicemail and was very worried because he sounded like he was drunker than ever before, and also borderline suicidal. Kory hadn’t talked to him for over a decade, but the whole night Kory is trying to call him back, freaking out that he missed his call, because he even called Kory’s mom, too. It definitely seemed serious. Eventually, Kory goes to bed and the next morning his friend texted him back and was like ‘Oh man, I’m sorry. I was so drunk last night!’”\n“It was just like a funny blackout drunk thing,” says Gregory, “and I was like ‘Damn, dude. I thought you were fucking dead!’” \nThat blur between and juxtaposition of darkness and levity is something Prince Daddy \u0026 The Hyena have always done well, and the four-piece utilize that technique to maximum effect on this album. Recorded, like Cosmic Thrill Seekers, by Nick “Scoops” Dardaris – this time at the Barber Shop Studios in New Jersey – it constantly grapples lyrically with difficult subject matter, but ebbs and flows musically between those polar opposites. Opener “Adore The Sun” is, for example, a dreamy, almost-Beach Boys-esque blast of summer warmth, but is followed immediately by the ragged, raw breakneck punk of “A Random Exercise In Impermanence (The Collector)”. Other examples include the gorgeous, defiant melancholy of “Curly Q” being sandwiched between the spiky, jittery vibes of “Hollow, As You Figured” and “Keep Up That Talk”, or the glowering raw insistence of “Jesus Fucking Christ” preceding “Something Special”, a reworked song about Freddy Kreuger from Gregory’s Jophus solo project that’s been given a kind of 1950s-esque teen ballad reinvention. And then there’s the epic introspection of the aforementioned “Black Mold”, which gives way to the gentle, almost lullaby-esque closer “Baby Blue.”\n“I kind of wanted this album to feel like a car crash,” admits Gregory. “I wanted it to feel like you’re getting whiplash going from song to song.”\n“I think the record as a whole as a journey feels bittersweet hopeful in a way, ending with the very dark Back Mold and I feel a little bit like Baby Blue is something blooming out of nothing after the lowest point of the record.”\nIn other words: we’re all going to die, so we might as well enjoy the ride before we do.\nThat, perhaps, is also reflective of the band’s attitude. This current line-up – cemented when Dasilva joined last year – is, they say, the band’s “forever line-up”. It’s who they’ve always wanted to be and  they’ve made the record they’ve been striving to make since forming in 2014. You can hear that chemistry, that magic, that synergy, all the way through.\n“I feel like this was exactly what we wanted to do exactly how we wanted to do it for the first time,” beams Gregory. “Our heads are all in the same spots, which is probably the first time since we’ve been a band that that’s happened. Everyone in the band wants to be here and we’re all super stoked to be where we are doing this.”\nplus MACSEAL, INSIGNIFICANT OTHER, and CALIFORNIA COUSINS"},{"date":"2022-05-05T00:00:00.000+00:00","title":"Phony Ppl, MH The Verb","url":"https://wl.seetickets.us/event/Phony-Ppl/472481?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/472481/3e83b13eca3c4c41a54baba26a6264cc.image!png.1519442.png.ScreenShot2022-03-28at10.05.22AM.png","details":"Doors 7pm // Show 8pm // All Ages // $24 Advance \u0026 $29 Day of Show\nCornerstone Presents: \nPHONY PPL\nwith MH THE VERB"},{"date":"2022-05-07T00:00:00.000+00:00","title":"Dance With the Dead / Magic Sword, Droid Bishop","url":"https://wl.seetickets.us/event/Dance-With-The-Dead-and-Magic-Sword/458848?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/458848/a1e308854cb04b55baf1e13ef51161af.image!png.985549.png.ScreenShot2022-04-13at4.23.35PM.png","details":"Doors 6pm // Show 7pm // All Ages // $24 Advance \u0026 $29 Day of Show\nCornerstone Presents:\nDANCE WITH THE DEAD and MAGIC SWORD \n\nplus DROID BISHOP"},{"date":"2022-05-08T00:00:00.000+00:00","title":"Stand Atlantic, With Confidence / Cemetery Sun / 7ru7h!","url":"https://wl.seetickets.us/event/Stand-Atlantic-North-American-FEAR-Tour/470120?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/470120/bd3569b89d514ace9a3728a5487d1a50.image!png.1569087.png.ScreenShot2022-02-28at2.41.37PM.png","details":"Doors 6pm // Show 7pm // All Ages // $18 Advance \u0026 $21 Day of Show\nCornerstone Presents:\n\nSTAND ATLANTIC\n\nPlus WITH CONFIDENCE, CEMETERY SUN, and 7RU7H!"},{"date":"2022-05-11T00:00:00.000+00:00","title":"Dayseeker, Holding Absence / Thornhill / Caskets","url":"https://wl.seetickets.us/event/Dayseeker/456706?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/456706/14ce8c690da841a7925432df917efe19.image!jpeg.1378373.jpg.promo1.jpg","details":"Doors 6pm // Show 630pm // All Ages // $15 Advance \u0026 $18 Day of Show\nCornerstone Presents:\nDAYSEEKER\nDayseeker is a 4-piece Rock/Metal band from Southern California formed in 2012. They are signed with Spinefarm Records, a subsidiary of Universal Music Group. On December 15, 2016, the band announced their departure from InVogue Records and that they had signed with Spinefarm Records. Shortly after, they announced a US tour with headliner Silent Planet, along with Ghost Key and Hail the Sun, which began in February 2017. A year after the release of Origin, Dayseeker announced a new full-length album set to release in 2017. The album, Dreaming Is Sinking / Waking Is Rising, was released by Spinefarm on July 14, 2017. \nSince the release of Dreaming Is Sinking / Waking Is Rising the band has been touring relentlessly countrywide and building a strong profile. The record sold just shy of 2,000 copies in their first week, earning them some impressive debut charting positions amongst hard rock and new artists. In Summer 2017, they embarked on a tour with The Color Morale and The Plot In You. Followed by that tour, they supported a tour with Oceans Ate Alaska and with Ice Nine Kills to close out their year. \nSpinefarm will be releasing a deluxe version of Dreaming Is Sinking / Waking Is Rising in 2018 featuring some stripped down versions of a few tracks and an additional cover track. Catch Dayseeker this summer performing on the Mutant stage on the Vans Warped Tour. \nwith HOLDING ABSENCE, THORNHILL and CASKETS"},{"date":"2022-05-13T00:00:00.000+00:00","title":"HYPOCRISY, Carach Angren / The Agonist / Hideous Divinity","url":"https://wl.seetickets.us/event/HYPOCRISY-Worship-Tour-2022/463158?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/463158/29690bbf17094da2859738e4675d68a6.image!png.2838714.png.ScreenShot2022-01-13at4.54.05PM.png","details":"Doors 6:30pm // Show 7pm // All Ages // $24 Advance \u0026 $28 Day of Show\nCornerstone Presents:\nHYPOCRISY\n\nplusCARACH ANGRENTHE AGONISTHIDEOUS DIVINITY"},{"date":"2022-05-14T00:00:00.000+00:00","title":"Delta Spirit, Palm Palm","url":"https://wl.seetickets.us/event/Delta-Spirit/463327?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/463327/436a0b5d6db14ede9a22add0df764fa7.image!png.924488.png.ScreenShot2022-01-17at11.00.09AM.png","details":"Doors 8pm // Show 9pm // All Ages // $24 Tickets\nCornerstone Presents:\nDELTA SPIRIT with PALM PALM"},{"date":"2022-05-15T00:00:00.000+00:00","title":"D. Savage, ","url":"https://wl.seetickets.us/event/D-Savage-Live/481009?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/481009/e7ba53deca314ccdaa616e044e354e37.image!png.1465472.png.ScreenShot2022-04-27at9.55.58AM.png","details":"Doors 7pm // Show 8pm // All Ages // $30 Advance \u0026 $35 Day of Show // $150 Meet \u0026 Greet + GA\nMeet and greet will be held after the event, ticket includes general admission, private meet and greet, and photo opportunity with D.Savage\nHigh Tolerance Presents:\nD. SAVAGE"},{"date":"2022-05-20T00:00:00.000+00:00","title":"Wifisfuneral, ","url":"https://wl.seetickets.us/event/Wifisfuneral/470168?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/470168/fab29b80488344d3ae9bf30ef50e2dfb.image!jpeg.513544.jpeg.Wifisfuneraladmat.jpeg","details":"Doors 8pm // Show 9pm // All Ages // $19 Advance \u0026 $24 Day of Show // VIP $69\nCornerstone Presents:\n\nWIFISFUNERAL"},{"date":"2022-05-21T00:00:00.000+00:00","title":"","url":"https://wl.seetickets.us/event/22-and-GOOD-4-U/469940?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/469940/a24bc23e93ac4a82acab1b294696ef50.image!png.2407846.png.ScreenShot2022-03-03at1.48.06PM.png","details":"Doors 9:30pm // Show 10pm // All Ages // $15 Early Bird, $18 Advance \u0026 $22 Day of Show\nCornerstone Presents:\n22 \u0026 Good 4 U\n'22 \u0026 Good 4 U' is a dance party for lovers of Taylor Swift and Olivia Rodrigo. We play music all night long from the likes of both artists for you to dance to!"}]