[{"date":"2022-05-30T00:00:00.000+00:00","title":"The Strike / Sub Radio","url":"https://wl.seetickets.us/event/The-Strike-and-Sub-Radio/478650?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/478650/1169cd47fe884a3eb9a4bcbc2ec34378.image!png.2642744.png.ScreenShot2022-04-12at10.17.01AM.png","details":"Doors 7pm // Show 8pm // All Ages // $15 Advance \u0026 $19 Day of Show\nCornerstone Presents:\nTHE STRIKE X SUB RADIO\nThe Strike is a 5 member independent band based in Los Angeles, CA.  The band is headed by front man Chris Crabb and supported by Alex Palazzo -guitar, David Maemone - keys, Frank Ojeda-bass, and Jay Tibbitts-drums.\nThe Strike released their debut album \"Faint of Heart\" in June of 2017, which was met with great enthusiasm nationally. The success of the record allowed them to expand their presence into Los Angeles from the greater Mountain West region where the band began.\nThe Strike is known for their captivating live performances. In an age of musical minimalism, The Strike is reminiscent of rock bands from the 70's and 80's. They feature true showmanship in an age where the art of performance has been forgotten. Chris Crabb's vocal style is akin to rock vocalists such as Lou Gramm, or Steve Perry. The band members are all students at their craft. Those who attend Strike shows become instant fans.\n\nSUB-RADIO\nSub-Radio makes indie pop that grooves, stabs, winks, punches, inspires. Founded by six childhood friends, they built a worldwide following on the strength of ecstatic virtual and live shows and a stream of releases. Following the release of their 2020 EP Thoughts Lights Colors Sounds, produced by Andrew Maury (Shawn Mendes, Lizzo, COIN), the band embarked on a pandemic-induced virtual Reddit tour, reaching over 4 million unique viewers in just 5 months. Their latest single “What You Want To Hear”, debuting in February 2021, is a pop blast of love and compassion in the face of adversity."},{"date":"2022-06-04T00:00:00.000+00:00","title":"Atsuko Okatsuka","url":"https://wl.seetickets.us/event/Atsuko-Okatsuka/479164?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/479164/73be1d3490a947e6bcb1010edbf1a7fa.image!png.1326777.png.ScreenShot2022-04-14at11.49.57AM.png","details":"Doors 6pm // Show 7pm // All Ages // $20 Advance \u0026 $24 Day of Show \nCornerstone Presents:\nATSUKO OKATUKA\n\nWhen confronted with a home intruder, Atsuko realises that her unconventional upbringing may have actually prepared her for just this moment. Named “One of the best in the biz” Vulture, and “Refreshing, artistic, and boundlessly confident” Time Out.\n\nAtsuko Okatsuka is a comedian, writer, and actor seen on CBS's The Late Late Show with James Corden. VULTURE stated that her set \"won late-night\" the week that it aired. She is currently a cast member on Stephen Colbert's animated projects Fairview and Washingtonia on Comedy Central and Paramount +.\nShe regularly makes viral videos with her 86-year-old grandmother, such as the Beyonce \"Drop Challenge\" that they accidentally created, which took off and recreated internationally and amassed a viewership of over 7 million.\n\nHer comedy has been written about in Paste Magazine, Variety, and The New York Times to name a few, and her debut comedy album \"But I Control Me\" was featured on NPR's Bullseye with Jesse Thorn as one of the best comedy albums released in 2020."},{"date":"2022-06-09T00:00:00.000+00:00","title":"Lyte Mike Love \u0026 The Full Circle / Dub Inc.","url":"https://wl.seetickets.us/event/Mike-Love-and-The-Full-Circle-with-Dub-Inc/462001?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/462001/ba9dec5824a348b3bbd8ea28eb066603.image!png.344602.png.ScreenShot2022-01-07at11.24.11AM.png","details":"Doors 7pm // Show 8pm // All Ages // $22 Advance \u0026 $25 Day of Show\nCornerstone Presents:\nMIKE LOVE \u0026 THE FULL CIRCLE \n\nwith DUB INC. "},{"date":"2022-06-11T00:00:00.000+00:00","title":"Los Pericos","url":"https://wl.seetickets.us/event/Los-Pericos/444784?afflky=CornerstoneBerkeley","img":"https://cdn.vor.us/event/444784/3c14882d1ad7407cb84c0f301fbedb93.image!jpeg.264667.jpeg.los-pericos-1_orig.jpeg","details":"Doors 8pm // Show 930pm // All Ages // $45 Advance \u0026 $55 VIP Balcony / Meet and Greet $70 \nJaffe Events Presents:\nLOS PERICOS"},{"date":"2022-06-12T00:00:00.000+00:00","title":"Fangirl Fantasy: One Direction vs 5 Seconds of Summer","url":"https://wl.seetickets.us/event/Fangirl-Fantasy-One-Direction-vs-5-Seconds-of-Summer/478978?afflky=CornerstoneBerkeley","img":"","details":"Doors 7pm // Show 8pm // 18+ // $15 Early Bird (limited amount) // $18 Advance // $20 Day of Show\nFangirl Fantasy Presents:\nOne Direction vs 5 Seconds of Summer\nFangirl Fantasy is the ultimate fangirl experience created by a fangirl for a fangirl. A night where all your favorite music is played in one place. It's a night where you can be unapologetically yourself."}]