[{"url":"https://www.dnalounge.com/calendar/2022/05-02.html","img":"http://www.dnalounge.com/flyers/2021/06/28-1.jpg","date":"2022-05-02T21:30:00.000+00:00","title":"DNA Lounge: Death Guild, 2 May 2022 (Mon)","details":"gothic. industrial. synthpop.\n18+.\n$5 advance;\n$5 \u003c 10:30pm;\n$8 after.\nDeath Guild is the oldest weekly goth/industrial dance night in the world! Every Monday, six DJs in two rooms play a mix of gothic, industrial, synthpop, noise, ambient, and weird stuff for those who love the darker side of things."},{"url":"https://www.dnalounge.com/calendar/2022/05-02d.html","img":"http://www.dnalounge.com/flyers/2022/05/02d-1.jpg","date":"2022-05-02T00:00:00.000+00:00","title":"JUICY MONDAY","details":"burlesque.\n18+.\nGen. Adm.: $10;\nReserved Seating: $15.\nJoin us as Hubba Hubba Revue makes the first Monday of each month extra Juicy!\n\nJuicy D. Light hosts the best in burlesque and variety at \"Juicy Mondays,\" -- and our very first one is also the birthday bash of our beloved DJ Myster C (Ya Mamma's Basement.)\n\nMonday Night Hubba is the perfect way to start your week sexy: with cocktails, tease, comedy and a more intimate experience than Hubba's big monthly extravaganzas! Each Monday night is a fun-filled, shimmering showcase of local, national and international burlesque and variety talent -- and a chance to see the most dazzling debuts before they hit it big!"},{"url":"https://www.dnalounge.com/calendar/2022/05-04.html","img":"http://www.dnalounge.com/flyers/2022/05/04-1.jpg","date":"2022-05-04T20:00:00.000+00:00","title":"MAY THE FOURTH BE WITH YOU:\nA PARTY AT MOS EISLEY","details":"star wars. cosplay.\n21+.\n$15 limited advance;\n$18 after;\n$25 day of show.\nMay the Fourth Be With You! We are taking you to a galaxy far far away on Weds, May 4th! For one night only- the DNA turns into the Mos Eisley Cantina! Cosplay highly encouraged, lightsabers allowed, droids \u0026 Wookies welcome!! Come as your fav character! Forge new alliances!\n\n\n•Star Wars visuals!\n• Get your pic taken with Ahsoka Tano and Boba Fett standees!\n• Star Wars Specialty Cocktails!\n• More Surprises TBA!\n\nIts Not a trap! Its Not a Jedi Mind Trick! Its a Cosplay Party for Rebels and Imperials!! DJ Cip \u0026 friends on the decks -- and unlike the Stormtroopers, their beats never miss ! Let's dance like Ewoks! May the Force be With Us!"},{"url":"https://www.dnalounge.com/calendar/2022/05-05.html","img":"http://www.dnalounge.com/flyers/2022/05/05-1.jpg","date":"2022-05-05T19:00:00.000+00:00","title":"FRONT LINE ASSEMBLY","details":"industrial. gothic. ebm.\nall ages.\n$25 advance;\n$35 day of show.\nFront Line Assembly's lead man Bill Leeb is three decades into the industrial scene, so rest assured he knows what he's doing. FLA's body of work ebbs and flows somewhere between industrial, dark dance music, and the apocalypse- with so much musical history there is something for everyone. In the 80s Leeb collaborated with Skinny Puppy before founding FLA (along with a multitude of projects), releasing a ton of music (including video game soundtracks), and touring the globe.\n\nLongtime songwriting associate Rhys Fulber is back on board for FLA's latest electro-industrial record, Mechanical Soul, and listeners will rejoice at the old school, sparse approach. The record is a dark, pandemic-influenced one (for example: a track in German about dying alone) that documents much of the past year spent in solitary while revisiting an old song and beloved rivet themes.\n\nFLA has seen many iterations, with each band member adding to the sound during their stay - but this iteration of Front Line Assembly as a duo happens to be the original one. The electronic body music vibes are woven throughout - likely from having two original members back together. It is no surprise that this record is being embraced by old school rivetheads and new listeners alike. Live, there's nothing grandfatherly about Front Line Assembly - aggressive rhythms, goth metal undertones, pounding drums, Bill Leeb stalking the stage with his mic, and Rhys Fulber manning the synths. Just close your eyes and let these pioneers take you away.\n\nUpon first glance, Rein cuts a devastatingly industrial picture: a Borg-like, futuristic, mechanical being of unknown origin. When you dig deeper, part of the mystery is a revealed - a Swedish girl with a musical family and a penchant for dark electronics, Rein has been genre bending since her 2016 release \"Freedoom.\" Her latest efforts, dub remixes from her debut Reincarnate, was produced by popular German DJ/producer Boys Noize. Rein's music embraces the best of the electronic subgenres, industrial in appearance but with a hard-edge that recalls the EBM of the 80s and the more recent but still a life time ago sounds of early 2000s electroclash like The Rapture. Rein transformed at some point from a typical blonde human into the interesting machine you now see before you, aggressively yelling her truth while owning the stage. Her voice can switch from a terrifying shout to robotic pop music to a sung melody with ease, all of which are a joy to hear.\n\nSynthetix provides a great soundtrack to a robot invasion. He separates himself from others as primarily a hardware based live-PA, fuseing deep banging beats, pulsating synths, booming bass lines, and futuristic effects, with a full onslaught of the senses that will make you want to battle robots, take over the world, and shake your ass.\nPhoto Gallery:"},{"url":"https://www.dnalounge.com/calendar/2022/05-06.html","img":"http://www.dnalounge.com/flyers/2022/05/06-1.jpg","date":"2022-05-06T21:00:00.000+00:00","title":"HOUSE POP-UP PARTY","details":"house. techno.\n18+.\n$7 advance;\n$10 door.\nPop Up!! 'Cause nothing beats Friday night excitement of a pop-up party! Come POP with expert 4x4 artists throwing down all night - Good vibes, good music, good people!\n\nWe are sorry to report that the Stevie Stone + Twisted Insane show has been cancelled."},{"url":"https://www.dnalounge.com/calendar/2022/05-07a.html","img":"http://www.dnalounge.com/flyers/2022/05/07a-1.jpg","date":"2022-05-07T15:00:00.000+00:00","title":"TEAM 2023 FINALS CONTEST","details":"show.\nall ages.\n$15 advance;\n$20 day of show.\nAfter two years online, the Bare Chest Calendar Finals Contest is back Live at the DNA Lounge! Come and support the Finalists as they compete to be on the 2023 Edition. See them in their fantasy gear, get to know them better during the question and answer, and watch them strip their shirts off and bare their chests!"},{"url":"https://www.dnalounge.com/calendar/2022/05-07.html","img":"http://www.dnalounge.com/flyers/2022/05/07-1.jpg","date":"2022-05-07T21:00:00.000+00:00","title":"WATERMELON SUGAR:\nHARRY STYLES \u0026 1 DIRECTION PARTY","details":"pop.\n18+.\n$15 limited advance;\n$20 after;\n$30 door.\nStep into Harry's House for the Best Night Ever! Sing, dance, and sway-along to the music of Harry Styles \u0026 One Direction screaming your heart out to \"\"As It Was\" Watermelon Sugar\" \"Golden\" \"What Makes You Beautiful\" \"Adore You\" \"Kiss You\" \"Steal My Girl\"\"Story of My Life\" \"Midnight Memories\" \u0026 More! Plus hear more from pop peers Jonas Brothers, Justin Bieber, 5 Seconds of Summer, Zayn, Miley Cyrus, Vamps, Selena Gomez, Olivia Rodrigo \u0026 more!\n\nExperience:\n• Harry Styles \u0026 One Direction music video projections\n• 1D \u0026 HS inspired performances\n• 1D \u0026 HS Photo ups with professional photographers\n• 1D \u0026 HS inspired glittery decorations\n• And more surprises!\n\nAttire: Your Best Harry Styles looks are Highly Encouraged (Get Googling!)"},{"url":"https://www.dnalounge.com/calendar/2022/05-07d.html","img":"http://www.dnalounge.com/flyers/2022/05/07d-1.jpg","date":"2022-05-07T21:00:00.000+00:00","title":"BOOTS \u0026 CATZ","details":"house. techno.\n18+.\n$10 limited advance;\n$15 after;\n$20 door.\nBoots 'N Catz 'N Boots 'N Catz! Come dance with a mix of classic oldskool \u0026 new innovating house and techno artists from across the Bay! Slammin' beats and soaring melodies - get those dancing shoes ready!"},{"url":"https://www.dnalounge.com/calendar/2022/05-09.html","img":"http://www.dnalounge.com/flyers/2021/06/28-1.jpg","date":"2022-05-09T21:30:00.000+00:00","title":"DNA Lounge: Death Guild, 9 May 2022 (Mon)","details":"gothic. industrial. synthpop.\n18+.\n$5 advance;\n$5 \u003c 10:30pm;\n$8 after.\nDeath Guild is the oldest weekly goth/industrial dance night in the world! Every Monday, six DJs in two rooms play a mix of gothic, industrial, synthpop, noise, ambient, and weird stuff for those who love the darker side of things."},{"url":"https://www.dnalounge.com/calendar/2022/05-09d.html","img":"http://www.dnalounge.com/flyers/2022/05/09d-1.jpg","date":"2022-05-09T00:00:00.000+00:00","title":"DNA Lounge: Monday Night Hubba, 9 May 2022 (Mon)","details":"burlesque.\n18+.\nGen. Adm.: $10;\nReserved Seating: $15.\nMonday Night Hubba is the perfect way to start your week sexy: with cocktails, tease, comedy and a more intimate experience than Hubba's big monthly extravaganzas! Each Monday night is a fun-filled, shimmering showcase of local, national and international burlesque and variety talent -- and a chance to see the most dazzling debuts before they hit it big!"}]