[{"url":"https://www.dnalounge.com/calendar/2022/05-02.html","img":"http://www.dnalounge.com/flyers/2021/06/28-1.jpg","date":"2022-05-02T21:30:00.000+00:00","title":"DNA Lounge: Death Guild, 2 May 2022 (Mon)","details":"gothic. industrial. synthpop.\n18+.\n$5 advance;\n$5 \u003c 10:30pm;\n$8 after.\nDeath Guild is the oldest weekly goth/industrial dance night in the world! Every Monday, six DJs in two rooms play a mix of gothic, industrial, synthpop, noise, ambient, and weird stuff for those who love the darker side of things."},{"url":"https://www.dnalounge.com/calendar/2022/05-02d.html","img":"http://www.dnalounge.com/flyers/2022/05/02d-1.jpg","date":"2022-05-02T00:00:00.000+00:00","title":"JUICY MONDAY","details":"burlesque.\n18+.\nGen. Adm.: $10;\nReserved Seating: $15.\nJoin us as Hubba Hubba Revue makes the first Monday of each month extra Juicy!\n\nJuicy D. Light hosts the best in burlesque and variety at \"Juicy Mondays,\" -- and our very first one is also the birthday bash of our beloved DJ Myster C (Ya Mamma's Basement.)\n\nMonday Night Hubba is the perfect way to start your week sexy: with cocktails, tease, comedy and a more intimate experience than Hubba's big monthly extravaganzas! Each Monday night is a fun-filled, shimmering showcase of local, national and international burlesque and variety talent -- and a chance to see the most dazzling debuts before they hit it big!"},{"url":"https://www.dnalounge.com/calendar/2022/05-04.html","img":"http://www.dnalounge.com/flyers/2022/05/04-1.jpg","date":"2022-05-04T20:00:00.000+00:00","title":"MAY THE FOURTH BE WITH YOU:\nA PARTY AT MOS EISLEY","details":"star wars. cosplay.\n21+.\n$15 limited advance;\n$18 after;\n$25 day of show.\nMay the Fourth Be With You! We are taking you to a galaxy far far away on Weds, May 4th! For one night only- the DNA turns into the Mos Eisley Cantina! Cosplay highly encouraged, lightsabers allowed, droids \u0026 Wookies welcome!! Come as your fav character! Forge new alliances!\n\n\n•Star Wars visuals!\n• Get your pic taken with Ahsoka Tano and Boba Fett standees!\n• Star Wars Specialty Cocktails!\n• More Surprises TBA!\n\nIts Not a trap! Its Not a Jedi Mind Trick! Its a Cosplay Party for Rebels and Imperials!! DJ Cip \u0026 friends on the decks -- and unlike the Stormtroopers, their beats never miss ! Let's dance like Ewoks! May the Force be With Us!"},{"url":"https://www.dnalounge.com/calendar/2022/05-05.html","img":"http://www.dnalounge.com/flyers/2022/05/05-1.jpg","date":"2022-05-05T19:00:00.000+00:00","title":"FRONT LINE ASSEMBLY","details":"industrial. gothic. ebm.\nall ages.\n$25 advance;\n$35 day of show.\nFront Line Assembly's lead man Bill Leeb is three decades into the industrial scene, so rest assured he knows what he's doing. FLA's body of work ebbs and flows somewhere between industrial, dark dance music, and the apocalypse- with so much musical history there is something for everyone. In the 80s Leeb collaborated with Skinny Puppy before founding FLA (along with a multitude of projects), releasing a ton of music (including video game soundtracks), and touring the globe.\n\nLongtime songwriting associate Rhys Fulber is back on board for FLA's latest electro-industrial record, Mechanical Soul, and listeners will rejoice at the old school, sparse approach. The record is a dark, pandemic-influenced one (for example: a track in German about dying alone) that documents much of the past year spent in solitary while revisiting an old song and beloved rivet themes.\n\nFLA has seen many iterations, with each band member adding to the sound during their stay - but this iteration of Front Line Assembly as a duo happens to be the original one. The electronic body music vibes are woven throughout - likely from having two original members back together. It is no surprise that this record is being embraced by old school rivetheads and new listeners alike. Live, there's nothing grandfatherly about Front Line Assembly - aggressive rhythms, goth metal undertones, pounding drums, Bill Leeb stalking the stage with his mic, and Rhys Fulber manning the synths. Just close your eyes and let these pioneers take you away.\n\nUpon first glance, Rein cuts a devastatingly industrial picture: a Borg-like, futuristic, mechanical being of unknown origin. When you dig deeper, part of the mystery is a revealed - a Swedish girl with a musical family and a penchant for dark electronics, Rein has been genre bending since her 2016 release \"Freedoom.\" Her latest efforts, dub remixes from her debut Reincarnate, was produced by popular German DJ/producer Boys Noize. Rein's music embraces the best of the electronic subgenres, industrial in appearance but with a hard-edge that recalls the EBM of the 80s and the more recent but still a life time ago sounds of early 2000s electroclash like The Rapture. Rein transformed at some point from a typical blonde human into the interesting machine you now see before you, aggressively yelling her truth while owning the stage. Her voice can switch from a terrifying shout to robotic pop music to a sung melody with ease, all of which are a joy to hear.\n\nSynthetix provides a great soundtrack to a robot invasion. He separates himself from others as primarily a hardware based live-PA, fuseing deep banging beats, pulsating synths, booming bass lines, and futuristic effects, with a full onslaught of the senses that will make you want to battle robots, take over the world, and shake your ass."},{"url":"https://www.dnalounge.com/calendar/2022/05-07a.html","img":"http://www.dnalounge.com/flyers/2022/05/07a-1.jpg","date":"2022-05-07T15:00:00.000+00:00","title":"TEAM 2023 FINALS CONTEST","details":"show.\nall ages.\n$15 advance;\n$20 day of show.\nAfter two years online, the Bare Chest Calendar Finals Contest is back Live at the DNA Lounge! Come and support the Finalists as they compete to be on the 2023 Edition. See them in their fantasy gear, get to know them better during the question and answer, and watch them strip their shirts off and bare their chests!"},{"url":"https://www.dnalounge.com/calendar/2022/05-07.html","img":"http://www.dnalounge.com/flyers/2022/05/07-1.jpg","date":"2022-05-07T21:00:00.000+00:00","title":"WATERMELON SUGAR:\nHARRY STYLES \u0026 1 DIRECTION PARTY","details":"pop.\n18+.\n$15 limited advance;\n$20 after;\n$30 day of show.\nStep into Harry's House for the Best Night Ever! Sing, dance, and sway-along to the music of Harry Styles \u0026 One Direction screaming your heart out to \"\"As It Was\" Watermelon Sugar\" \"Golden\" \"What Makes You Beautiful\" \"Adore You\" \"Kiss You\" \"Steal My Girl\"\"Story of My Life\" \"Midnight Memories\" \u0026 More! Plus hear more from pop peers Jonas Brothers, Justin Bieber, 5 Seconds of Summer, Zayn, Miley Cyrus, Vamps, Selena Gomez, Olivia Rodrigo \u0026 more!\n\nExperience:\n• Harry Styles \u0026 One Direction music video projections\n• 1D \u0026 HS inspired performances\n• 1D \u0026 HS Photo ups with professional photographers\n• 1D \u0026 HS inspired glittery decorations\n• And more surprises!\n\nAttire: Your Best Harry Styles looks are Highly Encouraged (Get Googling!)"},{"url":"https://www.dnalounge.com/calendar/2022/05-07d.html","img":"http://www.dnalounge.com/flyers/2022/05/07d-1.jpg","date":"2022-05-07T21:00:00.000+00:00","title":"BOOTS \u0026 CATZ","details":"house. techno.\n18+.\n$10 limited advance;\n$15 after;\n$20 door.\nBoots 'N Catz 'N Boots 'N Catz! Come dance with a mix of classic oldskool \u0026 new innovating house and techno artists from across the Bay! Slammin' beats and soaring melodies - get those dancing shoes ready!"},{"url":"https://www.dnalounge.com/calendar/2022/05-09.html","img":"http://www.dnalounge.com/flyers/2021/06/28-1.jpg","date":"2022-05-09T21:30:00.000+00:00","title":"DNA Lounge: Death Guild, 9 May 2022 (Mon)","details":"gothic. industrial. synthpop.\n18+.\n$5 advance;\n$5 \u003c 10:30pm;\n$8 after.\nDeath Guild is the oldest weekly goth/industrial dance night in the world! Every Monday, six DJs in two rooms play a mix of gothic, industrial, synthpop, noise, ambient, and weird stuff for those who love the darker side of things."},{"url":"https://www.dnalounge.com/calendar/2022/05-09d.html","img":"http://www.dnalounge.com/flyers/2022/05/09d-1.jpg","date":"2022-05-09T00:00:00.000+00:00","title":"DNA Lounge: Monday Night Hubba, 9 May 2022 (Mon)","details":"burlesque.\n18+.\nGen. Adm.: $10;\nReserved Seating: $15.\nMonday Night Hubba is the perfect way to start your week sexy: with cocktails, tease, comedy and a more intimate experience than Hubba's big monthly extravaganzas! Each Monday night is a fun-filled, shimmering showcase of local, national and international burlesque and variety talent -- and a chance to see the most dazzling debuts before they hit it big!"},{"url":"https://www.dnalounge.com/calendar/2022/05-10.html","img":"http://www.dnalounge.com/flyers/2022/05/10-1.jpg","date":"2022-05-10T19:00:00.000+00:00","title":"BRUJERIA + GOATWHORE","details":"death metal. extreme metal. grindcore. thrash metal.\nall ages.\n$20 advance;\n$30 day of show.\nBrujeria has been bringing their metal en español to the masses since 1989. With a history this long, it's no surprise they're well-connected to huge bands like Fear Factory and the Dead Kennedys. Los Angeles is just the kind of cauldron, err town, you'd expect to brew up this kind of band: theatrical, witchy, meta extreme metal (o deathgrind mexicana si tú prefieres). Everything is bigger in LA: hiatuses between records, sounds, extra strings on guitars, general epicness. Just because they're satanic and evil doesn't mean they can't embrace the times with gusto: their latest track is called Covid-666, and it's perfect as your metal soundtrack guide to the times we live in. In fact, esta banda has never been the type to shy away from any topics. Their music touches on things you'd expect (evilness, satan) as well as a huge dose of politics. True to their hometown, storytelling is key both in songwriting and on stage: each member plays a role of a drug lord in an ongoing war for the heart - or hate- of America. Gory, extra violent, head banging goodness: whether you're a longtime fan or just curious about this band with a crazy cult following, you're in for ringing ears and brain melting good times.\n\nA name like Goatwhore conjures all types of extremely evil shit - animal mutilation, sexy darkness, and graveyard-bound leather loudness. You can almost imagine the sweat dripping off long haired headbangers in both the audience and on stage. And the New Orleans metal band is not here to disappoint. These killers have been in the game for almost 25 years, letting their dirges spew forth into the waiting arms of death metal fans. Fellow New Orleans resident/Hate Eternal frontman Erik Rutan (the RZA of metal) has produced the bulk of the band's studio albums, with the exception the most recent, 2017's Vengeful Ascension - which was produced by their live soundman to bring the rawness of their live show straight into your headphones. A Goatwhore album is the kind of thing your parents discover in your room as a teen, and then immediately throw it in the trash while loudly questioning your life choices. Occult themes/anti-God (to boil it down to the most base level) are woven into songs that eschew the one-genre approach of many metal bands. Over the years Goatwhore has dabbled in it all: black metal, death metal, even thrash. They've outrun hurricanes and had close calls with death - perhaps they really have sold their souls to the devil. Live, the band is brutal, loud, and relentless, the ferocity of the music outmatched only by the fucking evilness of it all. If you haven't dipped your toe in the water of live metal music since 2020, this is the show to cut your teeth on. Expect pounding drums, scorching solos, gritty noise, and the weight of all the voodoo in New Orleans."},{"url":"https://www.dnalounge.com/calendar/2022/05-11d.html","img":"http://www.dnalounge.com/flyers/2022/05/11d-1.jpg","date":"2022-05-11T00:00:00.000+00:00","title":"THE CONVALESCENCE","details":"metal.\nall ages.\n$15 advance;\n$20 day of show.\nThe Convalescence hail from the all American town of Toledo, Ohio, but look like they clawed their way out of an abandoned cemetery. Gore and horror is achieved through their brutal sound, as well as their showmanship and image. Constant touring (they famously say they tour at least 100 days out of the year) over the last decade has honed this six piece into a sharp, always on point death core metal act. Aside from their corpse paint, flying hair, and gloomy wardrobes, this band also has - wait for it - their own barbecue sauce and trading cards. Yes, merch is always an important part of a band's repertoire, but these are proof they are worthy of the highest American metal band honors. Musically, The Convalescence does not give you time to relax (despite the name). Unclean vocals and precision guitars combine with pounding drums and bass and, a unicorn in the metal scene, a keyboard!, to create a symphonic feel - the music is extremely heavy and the show is just, well, extreme. The hardest working metal band in America will not disappoint.\n\nFrom the frosty north of Arctic Canada (ok, Montreal) hails Necronomicon - an occult-fused death metal group led by a frontman named Rob the Witch, who started the band as a 17 year old kid three decades ago. Relentless touring is the backbone upon which their dark and Lovecraftian metal rests. Symphonic elements like strings and a chorus of angels enrich the music. Necronomicon is more than straightforward death metal: brutal yet literary. Live, the band is fast, heavy, with some moments of striking beauty along with the requisite virtuoso guitar solos. Every show is an experience, 100% of the time - Rob and co. give it their all complete with makeup, flowing hair, guitars that look like they can cut you, and the full metal regalia. And what else would you expect from a band who lives and breathes metal?"},{"url":"https://www.dnalounge.com/calendar/2022/05-13a.html","img":"http://www.dnalounge.com/flyers/2012/11/09a-1.jpg","date":"2022-05-13T00:00:00.000+00:00","title":"DNA Lounge: Mortified, 13 May 2022 (Fri)","details":"all ages.\nGen. Adm.: $15 limited advance;\n$20 after;\n$30 door;\nReserved Seating: $43.\nHailed as a \"cultural phenomenon\" by Newsweek and celebrated for years by the likes of This American Life, The Today Show, The Onion AV Club, \u0026 Entertainment Weekly, Mortified is a comic excavation of teen angst artifacts (journals, poems, letters, lyrics, home movies, schoolwork) as shared by their original authors -- in front of total strangers!\n\nWhere else can you hear grown men and women confront their past with firsthand tales of their first kiss, first puff, worst prom, fights with mom, life at bible camp, worst hand job, best mall job, and reasons they deserved to marry Bon Jovi? Submissions come from a wide range of participants, from professional performers to total amateurs . All in the noble pursuit of self-degradation. Share the shame.\n\nTickets and Seating Information:\n\nGeneral Admission tickets do not include guaranteed seating. When the seats are full, there is ample standing room.\n\nPizza Special: A table for five, admission for five, and a large two topping pizza!\n\nReserved Seating is sold by the chair, and is in the first or second row.\n\nFront Row VIP: A table for five right in front of the stage, including admission for five and bottle service.\n\nDownstairs VIP Booths: These are against the wall with a good view of the stage and include admission for six and bottle service.\n\nUpstairs VIP, and Double: These don't have an unimpeded view of the stage, but are close to the balcony rail. They also include admission for six and bottle service."},{"url":"https://www.dnalounge.com/calendar/2022/05-13.html","img":"http://www.dnalounge.com/flyers/2022/05/13-1.jpg","date":"2022-05-13T22:00:00.000+00:00","title":"UZ + DMVU","details":"trap. bass. hiphop. dubstep. glitch.\n18+.\n$20 advance;\n$30 day of show.\nIt's been ten years since the Trap God UZ stepped on the scene with his chest shattering slaps, mysterious mask, and impeccable turntable skills. Until 2017, his true identity was completely unknown. With close to 200 releases under his belt, it was revealed that UZ is also house/garage alias Plezier and World Champion Turntablist DJ Troubl, previously dropping sounds via Moda, Strictly Rhythm and Brownswood Records. As UZ, he has collaborated with the likes of Ice Cube, Boyz Noize, T-Pain, Rome Fortune and DJ Shadow, releasing on Mad Decent, Boys Noize Records and Mau5trap, to name just a few.\n\nDMVU is meticulous in his sound design. His songs don't just evolve along melodic arcs. They drip with evocative and narrative environments that lead the listener along a path that is at once exciting and new, yet familiar and contemplative."},{"url":"https://www.dnalounge.com/calendar/2022/05-13d.html","img":"http://www.dnalounge.com/flyers/2022/05/13d-1.jpg","date":"2022-05-13T21:00:00.000+00:00","title":"MORIS BLAK + STREET CLEANER","details":"synthwave. industrial bass. midtempo. chiptune. darksynth.\n18+.\n$20 advance;\n$26 day of show.\nLeaning on Heavy Metal influences, Moris Blak concocts an aggressive, and very unique industrial bass sound. He is a name that should be in the playlists of anyone who loves hard-hitting music. He is refreshing, and his thumping beats make you feel like you are dancing until sunrise at a Berlin warehouse.\n\nOnly one man strikes fear in the souls of the human garbage that walk the streets at night. Only one man is brave enough to take on the pathetic trash that plague our city and prey on the weak. And that man is the Street Cleaner.\n\nWatch Out For Snakes is Atlanta based, 8-bit chipwave geek, Matt Baum. Layering Nes chip sounds, Wofs creates darkly energetic tracks that pay homage to old school video games and 80s films, without taking things too seriously.\n\nTurbo Drive is the largest, and longest running Synthwave party in the world! Playing music for fans of Stranger Things, Kung Fury, Drive (movie), Turbo Kid, Neon, Lasers, Chrome, Synths, Legwarmers, Fast Cars Sci-Fi, Horror, and Neo-80s nostalgia.\n\nSpinning music by artists like: Kavinsky, Carpenter Brut, Le Matos, Perturbator, The Midnight, FM-84, Dance with the Dead, Com Truise, Vitalic, Waveshaper, Robert Parker, Lazerhawk, Gunship, Starcadian, Electric Youth, Miami Nights 1984, 80's Stallone, Futurecop!, FM Attack, Mitch Murder, Magic Sword, Power Glove and much more!"},{"url":"https://www.dnalounge.com/calendar/2022/05-14d.html","img":"http://www.dnalounge.com/flyers/2022/05/14d-1.jpg","date":"2022-05-14T21:00:00.000+00:00","title":"SECRET PSYCHEDELICA:\nTAURUS 2022","details":"psytrance. breaks. techno. gabber.\n18+.\n$10, $15 limited advance;\n$20 after;\n$25 day of show.\nFor the month of May, we will be running with the bulls while celebrating the 21st anniversary of Secret Psychedelica! That's right, 21 years ago on May 28th, the first and only psytrance night in Silicon Valley was introduced as a monthly and continued on a 6 year run before downsizing to one offs at various venues in San Francisco. With the onset of the pandemic, Secret Psychedelica resumed as a weekly online streaming show featuring not only local psychedelic trance DJs but also highly respected producers from around the world. Then in May of last year, Secret Psychedelica found a new home at the DNA Lounge and has since been showcasing top notch international psytrance producers and DJs every month. In keeping with Secret Psychedelica's zodiac themes and to help celebrate this monumental occasion, we've rounded up a trio of transcendent Taurus to take things to the next level! Please help give a warm welcome to our European guests Foose and MicroTech along with Coral from the Pacific Northwest.\n\nFoose and MicroTech come to us representing GreenTree Records. The Belgium based label has been bringing psychedelic ear candy to the masses since 2005. Founded by Foose, GreenTree Records is home to artists such as Tron, Legion, and District Solaris. In conjunction with his label, Foose works to further the high quality psytrance sounds of GreenTree Records with a busy DJ schedule. His talents have blessed him with bookings for big events and festivals all over Europe, Asia, and South America. MicroTech is the psychedelic trance project of German producer Yannick Schwinhorst. Yannick started his career as a minimal techno producer but was infected by psytrance and now produces psychedelic blasters. MicroTech tunes can be tracked down on labels like Free-Spirit Records, Iono Music, and Yellow Sunshine Explosion as well as GreenTree Records. Between Foose and MicroTech, there's sure to be some dance floor stomping going on!\n\nCoral is a national treasure of the US psytrance scene! Getting hooked by psychedelic trance in the late 90s, Coral could not resist the joy she found in the genre and began DJing. Her infectious energy and enthusiasm behind the decks led to performances around the globe. Yet, this was just the beginning as her insatiable appetite for psytrance turned towards the world of production. She now resides on a beautiful lake in the mountains of Idaho and draws inspiration from nature while working tirelessly in the studio. A newly signed artist to SpaceWarp Records, Coral's high octane psychedelic tracks can also be found on Maharetta Records, Sculpted Sounds, and Reversible Records. Brace yourselves as Coral raises the intensity level right from the first drop.\n\nMike Cascino, Eddy Moran, and Michael Liu will get the stampede going in the psytrance room so be sure to arrive early for the sweet sounds of progressive-psy. The second room of music will be a mix of breaks, techno, and gabber from a herd of talented Taurus DJs. Get your party hats on and your dancing shoes ready, it's time to celebrate the 21st anniversary of Secret Psychedelica!!"},{"url":"https://www.dnalounge.com/calendar/2022/05-16.html","img":"http://www.dnalounge.com/flyers/2021/06/28-1.jpg","date":"2022-05-16T21:30:00.000+00:00","title":"DNA Lounge: Death Guild, 16 May 2022 (Mon)","details":"gothic. industrial. synthpop.\n18+.\n$5 advance;\n$5 \u003c 10:30pm;\n$8 after.\nDeath Guild is the oldest weekly goth/industrial dance night in the world! Every Monday, six DJs in two rooms play a mix of gothic, industrial, synthpop, noise, ambient, and weird stuff for those who love the darker side of things."},{"url":"https://www.dnalounge.com/calendar/2022/05-16d.html","img":"http://www.dnalounge.com/flyers/2022/05/16d-1.jpg","date":"2022-05-16T00:00:00.000+00:00","title":"ROYAL VELVET REVUE","details":"burlesque.\n18+.\nGen. Adm.: $10;\nReserved Seating: $15.\nMonday Night Hubba welcomes the lovely Royal Velvet Revue from capitol city, Sacramento!\n\nMonday Night Hubba is the perfect way to start your week sexy: with cocktails, tease, comedy and a more intimate experience than Hubba's big monthly extravaganzas! Each Monday night is a fun-filled, shimmering showcase of local, national and international burlesque and variety talent -- and a chance to see the most dazzling debuts before they hit it big!"},{"url":"https://www.dnalounge.com/calendar/2022/05-19d.html","img":"http://www.dnalounge.com/flyers/2022/05/19d-1.jpg","date":"2022-05-19T20:00:00.000+00:00","title":"SLATER + MADGE + LEALANI","details":"alt-pop. indie electronic.\nall ages.\n$15 advance;\n$20 day of show.\nFrom seductive club bangers to therapeutic, night-time-cruising tunes, Slater has solidified his role as a tastemaker and star of the new wave of alternative pop. Since 2013, Southern California's rising underground sensation, Slater, has blended the best elements of alternative, pop, and hiphop into a new, unique sound all of his own. Smooth, groovy, and infectious, his niche style is as reminiscent of early 00's pop and radio hits as it is innovative and fresh. As a member of the collective, Vada Vada (consisting of The Garden, Enjoy, Puzzle, Cowgirl Clue, Lumina, and Glitch), Slater is no stranger to experimentation. With over 20 releases under his belt, he continues sonically evolving his signature sound.\n\nMadge is the nonbinary Los Angeles artist breaking hearts and noses in the land of left-of-center. Their world is equally absurd and earnest - cartoonish nihilism born out of Mormonism. Madge's music performance and composition reflects their fluidity and they frequently float between genres. Outside of their own artist project, Madge's writing work ranges from Kaskade to Pussy Riot, dabbling primarily in electronic, pop, and film composition. Debut album in the works, the artist hopes to be part of a bigger wave of change in the music industry with the rise of democratized music creation and easy-access media. Described by Noisey as \"weird\" and by Bbc Radio1 as \"like chewing on toxic waste in the best way\", Madge is looking forward to a big 2022.\n\nLealani is a Los Angeles based artist who is an \"alien from Fantastic Planet\"."},{"url":"https://www.dnalounge.com/calendar/2022/05-20.html","img":"http://www.dnalounge.com/flyers/2022/05/20-1.jpg","date":"2022-05-20T21:00:00.000+00:00","title":"THE EGYPTIAN LOVER","details":"electro. techno. electro funk. breakbeats. detroit techno.\n18+.\n$15 advance;\n$20 day of show.\nThe Egyptian Lover is the definition of living legend. A product of 1980s Los Angeles, The Egyptian Lover (real name Greg Broussard) is funky and still committed to analog authenticity. Alluring vocals and big bass lines atop an electric stew of drum machine and synth make for non-stop dance floor ammunition. Whether you call it old school hiphop or early electronic music, The Egyptian Lover is a strong influence on both. Live, the legendary lothario mans the turntables (with real vinyl!), his trusty 808, and vocals, creating sonic rhythms to seduce the ear drums. Old heads and newer fans alike will appreciate the Egyptian Lover."},{"url":"https://www.dnalounge.com/calendar/2022/05-20d.html","img":"http://www.dnalounge.com/flyers/2022/05/20d-1.jpg","date":"2022-05-20T21:00:00.000+00:00","title":"HELLA JUICY POLE SHOW","details":"hiphop. pole dancing.\n18+.\n$10 limited advance;\n$15 after;\n$20 day of show.\nCome out for a night of super sexy pole dancers at Hella Juicy! This pole dance showcase will feature ONLY larger bodied, BIPOC and queer folks from San Francisco, Los Angeles and Seattle! Please bring cash/singles to make it rain for the performers!"}]