[{"url":"https://www.dnalounge.com/calendar/2022/05-02.html","img":"http://www.dnalounge.com/flyers/2021/06/28-1.jpg","date":"2022-05-02T21:30:00.000+00:00","title":"DNA Lounge: Death Guild, 2 May 2022 (Mon)","details":"gothic. industrial. synthpop.\n18+.\n$5 advance;\n$5 \u003c 10:30pm;\n$8 after.\nDeath Guild is the oldest weekly goth/industrial dance night in the world! Every Monday, six DJs in two rooms play a mix of gothic, industrial, synthpop, noise, ambient, and weird stuff for those who love the darker side of things."},{"url":"https://www.dnalounge.com/calendar/2022/05-02d.html","img":"http://www.dnalounge.com/flyers/2022/05/02d-1.jpg","date":"2022-05-02T00:00:00.000+00:00","title":"JUICY MONDAY","details":"burlesque.\n18+.\nGen. Adm.: $10;\nReserved Seating: $15.\nJoin us as Hubba Hubba Revue makes the first Monday of each month extra Juicy!\n\nJuicy D. Light hosts the best in burlesque and variety at \"Juicy Mondays,\" -- and our very first one is also the birthday bash of our beloved DJ Myster C (Ya Mamma's Basement.)\n\nMonday Night Hubba is the perfect way to start your week sexy: with cocktails, tease, comedy and a more intimate experience than Hubba's big monthly extravaganzas! Each Monday night is a fun-filled, shimmering showcase of local, national and international burlesque and variety talent -- and a chance to see the most dazzling debuts before they hit it big!"},{"url":"https://www.dnalounge.com/calendar/2022/05-04.html","img":"http://www.dnalounge.com/flyers/2022/05/04-1.jpg","date":"2022-05-04T20:00:00.000+00:00","title":"MAY THE FOURTH BE WITH YOU:\nA PARTY AT MOS EISLEY","details":"star wars. cosplay.\n21+.\n$15 limited advance;\n$18 after;\n$25 day of show.\nMay the Fourth Be With You! We are taking you to a galaxy far far away on Weds, May 4th! For one night only- the DNA turns into the Mos Eisley Cantina! Cosplay highly encouraged, lightsabers allowed, droids \u0026 Wookies welcome!! Come as your fav character! Forge new alliances!\n\n\n•Star Wars visuals!\n• Get your pic taken with Ahsoka Tano and Boba Fett standees!\n• Star Wars Specialty Cocktails!\n• More Surprises TBA!\n\nIts Not a trap! Its Not a Jedi Mind Trick! Its a Cosplay Party for Rebels and Imperials!! DJ Cip \u0026 friends on the decks -- and unlike the Stormtroopers, their beats never miss ! Let's dance like Ewoks! May the Force be With Us!"},{"url":"https://www.dnalounge.com/calendar/2022/05-05.html","img":"http://www.dnalounge.com/flyers/2022/05/05-1.jpg","date":"2022-05-05T19:00:00.000+00:00","title":"FRONT LINE ASSEMBLY","details":"industrial. gothic. ebm.\nall ages.\n$25 advance;\n$35 day of show.\nFront Line Assembly's lead man Bill Leeb is three decades into the industrial scene, so rest assured he knows what he's doing. FLA's body of work ebbs and flows somewhere between industrial, dark dance music, and the apocalypse- with so much musical history there is something for everyone. In the 80s Leeb collaborated with Skinny Puppy before founding FLA (along with a multitude of projects), releasing a ton of music (including video game soundtracks), and touring the globe.\n\nLongtime songwriting associate Rhys Fulber is back on board for FLA's latest electro-industrial record, Mechanical Soul, and listeners will rejoice at the old school, sparse approach. The record is a dark, pandemic-influenced one (for example: a track in German about dying alone) that documents much of the past year spent in solitary while revisiting an old song and beloved rivet themes.\n\nFLA has seen many iterations, with each band member adding to the sound during their stay - but this iteration of Front Line Assembly as a duo happens to be the original one. The electronic body music vibes are woven throughout - likely from having two original members back together. It is no surprise that this record is being embraced by old school rivetheads and new listeners alike. Live, there's nothing grandfatherly about Front Line Assembly - aggressive rhythms, goth metal undertones, pounding drums, Bill Leeb stalking the stage with his mic, and Rhys Fulber manning the synths. Just close your eyes and let these pioneers take you away.\n\nUpon first glance, Rein cuts a devastatingly industrial picture: a Borg-like, futuristic, mechanical being of unknown origin. When you dig deeper, part of the mystery is a revealed - a Swedish girl with a musical family and a penchant for dark electronics, Rein has been genre bending since her 2016 release \"Freedoom.\" Her latest efforts, dub remixes from her debut Reincarnate, was produced by popular German DJ/producer Boys Noize. Rein's music embraces the best of the electronic subgenres, industrial in appearance but with a hard-edge that recalls the EBM of the 80s and the more recent but still a life time ago sounds of early 2000s electroclash like The Rapture. Rein transformed at some point from a typical blonde human into the interesting machine you now see before you, aggressively yelling her truth while owning the stage. Her voice can switch from a terrifying shout to robotic pop music to a sung melody with ease, all of which are a joy to hear.\n\nSynthetix provides a great soundtrack to a robot invasion. He separates himself from others as primarily a hardware based live-PA, fuseing deep banging beats, pulsating synths, booming bass lines, and futuristic effects, with a full onslaught of the senses that will make you want to battle robots, take over the world, and shake your ass.\nPhoto Gallery:"},{"url":"https://www.dnalounge.com/calendar/2022/05-06.html","img":"http://www.dnalounge.com/flyers/2022/05/06-1.jpg","date":"2022-05-06T21:00:00.000+00:00","title":"HOUSE POP-UP PARTY","details":"house. techno.\n18+.\n$7 advance;\n$10 door.\nPop Up!! 'Cause nothing beats Friday night excitement of a pop-up party! Come POP with expert 4x4 artists throwing down all night - Good vibes, good music, good people!\n\nWe are sorry to report that the Stevie Stone + Twisted Insane show has been cancelled."},{"url":"https://www.dnalounge.com/calendar/2022/05-07a.html","img":"http://www.dnalounge.com/flyers/2022/05/07a-1.jpg","date":"2022-05-07T15:00:00.000+00:00","title":"TEAM 2023 FINALS CONTEST","details":"show.\nall ages.\n$15 advance;\n$20 day of show.\nAfter two years online, the Bare Chest Calendar Finals Contest is back Live at the DNA Lounge! Come and support the Finalists as they compete to be on the 2023 Edition. See them in their fantasy gear, get to know them better during the question and answer, and watch them strip their shirts off and bare their chests!"},{"url":"https://www.dnalounge.com/calendar/2022/05-07.html","img":"http://www.dnalounge.com/flyers/2022/05/07-1.jpg","date":"2022-05-07T21:00:00.000+00:00","title":"WATERMELON SUGAR:\nHARRY STYLES \u0026 1 DIRECTION PARTY","details":"pop.\n18+.\n$15 limited advance;\n$20 after;\n$30 door.\nStep into Harry's House for the Best Night Ever! Sing, dance, and sway-along to the music of Harry Styles \u0026 One Direction screaming your heart out to \"\"As It Was\" Watermelon Sugar\" \"Golden\" \"What Makes You Beautiful\" \"Adore You\" \"Kiss You\" \"Steal My Girl\"\"Story of My Life\" \"Midnight Memories\" \u0026 More! Plus hear more from pop peers Jonas Brothers, Justin Bieber, 5 Seconds of Summer, Zayn, Miley Cyrus, Vamps, Selena Gomez, Olivia Rodrigo \u0026 more!\n\nExperience:\n• Harry Styles \u0026 One Direction music video projections\n• 1D \u0026 HS inspired performances\n• 1D \u0026 HS Photo ups with professional photographers\n• 1D \u0026 HS inspired glittery decorations\n• And more surprises!\n\nAttire: Your Best Harry Styles looks are Highly Encouraged (Get Googling!)"},{"url":"https://www.dnalounge.com/calendar/2022/05-07d.html","img":"http://www.dnalounge.com/flyers/2022/05/07d-1.jpg","date":"2022-05-07T21:00:00.000+00:00","title":"BOOTS \u0026 CATZ","details":"house. techno.\n18+.\n$10 limited advance;\n$15 after;\n$20 door.\nBoots 'N Catz 'N Boots 'N Catz! Come dance with a mix of classic oldskool \u0026 new innovating house and techno artists from across the Bay! Slammin' beats and soaring melodies - get those dancing shoes ready!"},{"url":"https://www.dnalounge.com/calendar/2022/05-09.html","img":"http://www.dnalounge.com/flyers/2021/06/28-1.jpg","date":"2022-05-09T21:30:00.000+00:00","title":"DNA Lounge: Death Guild, 9 May 2022 (Mon)","details":"gothic. industrial. synthpop.\n18+.\n$5 advance;\n$5 \u003c 10:30pm;\n$8 after.\nDeath Guild is the oldest weekly goth/industrial dance night in the world! Every Monday, six DJs in two rooms play a mix of gothic, industrial, synthpop, noise, ambient, and weird stuff for those who love the darker side of things."},{"url":"https://www.dnalounge.com/calendar/2022/05-09d.html","img":"http://www.dnalounge.com/flyers/2022/05/09d-1.jpg","date":"2022-05-09T00:00:00.000+00:00","title":"DNA Lounge: Monday Night Hubba, 9 May 2022 (Mon)","details":"burlesque.\n18+.\nGen. Adm.: $10;\nReserved Seating: $15.\nMonday Night Hubba is the perfect way to start your week sexy: with cocktails, tease, comedy and a more intimate experience than Hubba's big monthly extravaganzas! Each Monday night is a fun-filled, shimmering showcase of local, national and international burlesque and variety talent -- and a chance to see the most dazzling debuts before they hit it big!"},{"url":"https://www.dnalounge.com/calendar/2022/05-10.html","img":"http://www.dnalounge.com/flyers/2022/05/10-1.jpg","date":"2022-05-10T19:00:00.000+00:00","title":"BRUJERIA + GOATWHORE","details":"death metal. extreme metal. grindcore. thrash metal.\nall ages.\n$20 advance;\n$30 day of show.\nBrujeria has been bringing their metal en español to the masses since 1989. With a history this long, it's no surprise they're well-connected to huge bands like Fear Factory and the Dead Kennedys. Los Angeles is just the kind of cauldron, err town, you'd expect to brew up this kind of band: theatrical, witchy, meta extreme metal (o deathgrind mexicana si tú prefieres). Everything is bigger in LA: hiatuses between records, sounds, extra strings on guitars, general epicness. Just because they're satanic and evil doesn't mean they can't embrace the times with gusto: their latest track is called Covid-666, and it's perfect as your metal soundtrack guide to the times we live in. In fact, esta banda has never been the type to shy away from any topics. Their music touches on things you'd expect (evilness, satan) as well as a huge dose of politics. True to their hometown, storytelling is key both in songwriting and on stage: each member plays a role of a drug lord in an ongoing war for the heart - or hate- of America. Gory, extra violent, head banging goodness: whether you're a longtime fan or just curious about this band with a crazy cult following, you're in for ringing ears and brain melting good times.\n\nA name like Goatwhore conjures all types of extremely evil shit - animal mutilation, sexy darkness, and graveyard-bound leather loudness. You can almost imagine the sweat dripping off long haired headbangers in both the audience and on stage. And the New Orleans metal band is not here to disappoint. These killers have been in the game for almost 25 years, letting their dirges spew forth into the waiting arms of death metal fans. Fellow New Orleans resident/Hate Eternal frontman Erik Rutan (the RZA of metal) has produced the bulk of the band's studio albums, with the exception the most recent, 2017's Vengeful Ascension - which was produced by their live soundman to bring the rawness of their live show straight into your headphones. A Goatwhore album is the kind of thing your parents discover in your room as a teen, and then immediately throw it in the trash while loudly questioning your life choices. Occult themes/anti-God (to boil it down to the most base level) are woven into songs that eschew the one-genre approach of many metal bands. Over the years Goatwhore has dabbled in it all: black metal, death metal, even thrash. They've outrun hurricanes and had close calls with death - perhaps they really have sold their souls to the devil. Live, the band is brutal, loud, and relentless, the ferocity of the music outmatched only by the fucking evilness of it all. If you haven't dipped your toe in the water of live metal music since 2020, this is the show to cut your teeth on. Expect pounding drums, scorching solos, gritty noise, and the weight of all the voodoo in New Orleans.\nPhoto Gallery:"},{"url":"https://www.dnalounge.com/calendar/2022/05-13a.html","img":"http://www.dnalounge.com/flyers/2012/11/09a-1.jpg","date":"2022-05-13T00:00:00.000+00:00","title":"DNA Lounge: Mortified, 13 May 2022 (Fri)","details":"all ages.\nGen. Adm.: $15 limited advance;\n$20 after;\n$30 door;\n\nReserved Seating: $35.\nHailed as a \"cultural phenomenon\" by Newsweek and celebrated for years by the likes of This American Life, The Today Show, The Onion AV Club, \u0026 Entertainment Weekly, Mortified is a comic excavation of teen angst artifacts (journals, poems, letters, lyrics, home movies, schoolwork) as shared by their original authors -- in front of total strangers!\n\nWhere else can you hear grown men and women confront their past with firsthand tales of their first kiss, first puff, worst prom, fights with mom, life at bible camp, worst hand job, best mall job, and reasons they deserved to marry Bon Jovi? Submissions come from a wide range of participants, from professional performers to total amateurs . All in the noble pursuit of self-degradation. Share the shame.\n\nTickets and Seating Information:\n\nGeneral Admission tickets do not include guaranteed seating. When the seats are full, there is ample standing room.\n\nPizza Special: A table for five, admission for five, and a large two topping pizza!\n\nReserved Seating is sold by the chair, and is in the first or second row.\n\nFront Row VIP: A table for five right in front of the stage, including admission for five and bottle service.\n\nDownstairs VIP Booths: These are against the wall with a good view of the stage and include admission for six and bottle service.\n\nUpstairs VIP, and Double: These don't have an unimpeded view of the stage, but are close to the balcony rail. They also include admission for six and bottle service."},{"url":"https://www.dnalounge.com/calendar/2022/05-13.html","img":"http://www.dnalounge.com/flyers/2022/05/13-1.jpg","date":"2022-05-13T22:00:00.000+00:00","title":"UZ + DMVU","details":"trap. bass. hiphop. dubstep. glitch.\n18+.\n$20 advance;\n$30 day of show.\nIt's been ten years since the Trap God UZ stepped on the scene with his chest shattering slaps, mysterious mask, and impeccable turntable skills. Until 2017, his true identity was completely unknown. With close to 200 releases under his belt, it was revealed that UZ is also house/garage alias Plezier and World Champion Turntablist DJ Troubl, previously dropping sounds via Moda, Strictly Rhythm and Brownswood Records. As UZ, he has collaborated with the likes of Ice Cube, Boyz Noize, T-Pain, Rome Fortune and DJ Shadow, releasing on Mad Decent, Boys Noize Records and Mau5trap, to name just a few.\n\nDMVU is meticulous in his sound design. His songs don't just evolve along melodic arcs. They drip with evocative and narrative environments that lead the listener along a path that is at once exciting and new, yet familiar and contemplative.\nPhoto Gallery:"},{"url":"https://www.dnalounge.com/calendar/2022/05-13d.html","img":"http://www.dnalounge.com/flyers/2022/05/13d-1.jpg","date":"2022-05-13T21:00:00.000+00:00","title":"MORIS BLAK + STREET CLEANER","details":"synthwave. industrial bass. midtempo. chiptune. darksynth.\n18+.\n$20 advance;\n$26 day of show.\nLeaning on Heavy Metal influences, Moris Blak concocts an aggressive, and very unique industrial bass sound. He is a name that should be in the playlists of anyone who loves hard-hitting music. He is refreshing, and his thumping beats make you feel like you are dancing until sunrise at a Berlin warehouse.\n\nOnly one man strikes fear in the souls of the human garbage that walk the streets at night. Only one man is brave enough to take on the pathetic trash that plague our city and prey on the weak. And that man is the Street Cleaner.\n\nWatch Out For Snakes is Atlanta based, 8-bit chipwave geek, Matt Baum. Layering Nes chip sounds, Wofs creates darkly energetic tracks that pay homage to old school video games and 80s films, without taking things too seriously.\n\nTurbo Drive is the largest, and longest running Synthwave party in the world! Playing music for fans of Stranger Things, Kung Fury, Drive (movie), Turbo Kid, Neon, Lasers, Chrome, Synths, Legwarmers, Fast Cars Sci-Fi, Horror, and Neo-80s nostalgia.\n\nSpinning music by artists like: Kavinsky, Carpenter Brut, Le Matos, Perturbator, The Midnight, FM-84, Dance with the Dead, Com Truise, Vitalic, Waveshaper, Robert Parker, Lazerhawk, Gunship, Starcadian, Electric Youth, Miami Nights 1984, 80's Stallone, Futurecop!, FM Attack, Mitch Murder, Magic Sword, Power Glove and much more!\nPhoto Gallery:"},{"url":"https://www.dnalounge.com/calendar/2022/05-14.html","img":"http://www.dnalounge.com/flyers/2022/05/14-1.jpg","date":"2022-05-14T21:00:00.000+00:00","title":"HIP POP HOORAY","details":"top40 pop hiphop.\n18+.\n$20 advance;\n$25 day of show.\nJoin us for a night of all your favorite pop and hiphop hits. From the hottest chart toppers to classic favorites, you'll be dancing and singing along all night."},{"url":"https://www.dnalounge.com/calendar/2022/05-14d.html","img":"http://www.dnalounge.com/flyers/2022/05/14d-1.jpg","date":"2022-05-14T21:00:00.000+00:00","title":"SECRET PSYCHEDELICA:\nTAURUS 2022","details":"psytrance. breaks. techno. gabber.\n18+.\n$10, $15 limited advance;\n$20 after;\n$25 day of show.\nFor the month of May, we will be running with the bulls while celebrating the 21st anniversary of Secret Psychedelica! That's right, 21 years ago on May 28th, the first and only psytrance night in Silicon Valley was introduced as a monthly and continued on a 6 year run before downsizing to one offs at various venues in San Francisco. With the onset of the pandemic, Secret Psychedelica resumed as a weekly online streaming show featuring not only local psychedelic trance DJs but also highly respected producers from around the world. Then in May of last year, Secret Psychedelica found a new home at the DNA Lounge and has since been showcasing top notch international psytrance producers and DJs every month. In keeping with Secret Psychedelica's zodiac themes and to help celebrate this monumental occasion, we've rounded up a trio of transcendent Taurus to take things to the next level! Please help give a warm welcome to our European guests Foose and MicroTech along with Coral from the Pacific Northwest.\n\nFoose and MicroTech come to us representing GreenTree Records. The Belgium based label has been bringing psychedelic ear candy to the masses since 2005. Founded by Foose, GreenTree Records is home to artists such as Tron, Legion, and District Solaris. In conjunction with his label, Foose works to further the high quality psytrance sounds of GreenTree Records with a busy DJ schedule. His talents have blessed him with bookings for big events and festivals all over Europe, Asia, and South America. MicroTech is the psychedelic trance project of German producer Yannick Schwinhorst. Yannick started his career as a minimal techno producer but was infected by psytrance and now produces psychedelic blasters. MicroTech tunes can be tracked down on labels like Free-Spirit Records, Iono Music, and Yellow Sunshine Explosion as well as GreenTree Records. Between Foose and MicroTech, there's sure to be some dance floor stomping going on!\n\nCoral is a national treasure of the US psytrance scene! Getting hooked by psychedelic trance in the late 90s, Coral could not resist the joy she found in the genre and began DJing. Her infectious energy and enthusiasm behind the decks led to performances around the globe. Yet, this was just the beginning as her insatiable appetite for psytrance turned towards the world of production. She now resides on a beautiful lake in the mountains of Idaho and draws inspiration from nature while working tirelessly in the studio. A newly signed artist to SpaceWarp Records, Coral's high octane psychedelic tracks can also be found on Maharetta Records, Sculpted Sounds, and Reversible Records. Brace yourselves as Coral raises the intensity level right from the first drop.\n\nMike Cascino, Eddy Moran, and Michael Liu will get the stampede going in the psytrance room so be sure to arrive early for the sweet sounds of progressive-psy. The second room of music will be a mix of breaks, techno, and gabber from a herd of talented Taurus DJs. Get your party hats on and your dancing shoes ready, it's time to celebrate the 21st anniversary of Secret Psychedelica!!"},{"url":"https://www.dnalounge.com/calendar/2022/05-16.html","img":"http://www.dnalounge.com/flyers/2021/06/28-1.jpg","date":"2022-05-16T21:30:00.000+00:00","title":"DNA Lounge: Death Guild, 16 May 2022 (Mon)","details":"gothic. industrial. synthpop.\n18+.\n$5 advance;\n$5 \u003c 10:30pm;\n$8 after.\nDeath Guild is the oldest weekly goth/industrial dance night in the world! Every Monday, six DJs in two rooms play a mix of gothic, industrial, synthpop, noise, ambient, and weird stuff for those who love the darker side of things."},{"url":"https://www.dnalounge.com/calendar/2022/05-16d.html","img":"http://www.dnalounge.com/flyers/2022/05/16d-1.jpg","date":"2022-05-16T00:00:00.000+00:00","title":"ROYAL VELVET REVUE","details":"burlesque.\n18+.\nGen. Adm.: $10;\nReserved Seating: $15.\nMonday Night Hubba welcomes the lovely Royal Velvet Revue from capitol city, Sacramento!\n\nMonday Night Hubba is the perfect way to start your week sexy: with cocktails, tease, comedy and a more intimate experience than Hubba's big monthly extravaganzas! Each Monday night is a fun-filled, shimmering showcase of local, national and international burlesque and variety talent -- and a chance to see the most dazzling debuts before they hit it big!\nPhoto Gallery:"},{"url":"https://www.dnalounge.com/calendar/2022/05-19d.html","img":"http://www.dnalounge.com/flyers/2022/05/19d-1.jpg","date":"2022-05-19T20:00:00.000+00:00","title":"SLATER + MADGE + LEALANI","details":"alt-pop. indie electronic.\nall ages.\n$15 advance;\n$20 day of show.\nFrom seductive club bangers to therapeutic, night-time-cruising tunes, Slater has solidified his role as a tastemaker and star of the new wave of alternative pop. Since 2013, Southern California's rising underground sensation, Slater, has blended the best elements of alternative, pop, and hiphop into a new, unique sound all of his own. Smooth, groovy, and infectious, his niche style is as reminiscent of early 00's pop and radio hits as it is innovative and fresh. As a member of the collective, Vada Vada (consisting of The Garden, Enjoy, Puzzle, Cowgirl Clue, Lumina, and Glitch), Slater is no stranger to experimentation. With over 20 releases under his belt, he continues sonically evolving his signature sound.\n\nMadge is the nonbinary Los Angeles artist breaking hearts and noses in the land of left-of-center. Their world is equally absurd and earnest - cartoonish nihilism born out of Mormonism. Madge's music performance and composition reflects their fluidity and they frequently float between genres. Outside of their own artist project, Madge's writing work ranges from Kaskade to Pussy Riot, dabbling primarily in electronic, pop, and film composition. Debut album in the works, the artist hopes to be part of a bigger wave of change in the music industry with the rise of democratized music creation and easy-access media. Described by Noisey as \"weird\" and by Bbc Radio1 as \"like chewing on toxic waste in the best way\", Madge is looking forward to a big 2022.\n\nLealani is a Los Angeles based artist who is an \"alien from Fantastic Planet\".\nPhoto Gallery:"},{"url":"https://www.dnalounge.com/calendar/2022/05-20.html","img":"http://www.dnalounge.com/flyers/2022/05/20-1.jpg","date":"2022-05-20T21:00:00.000+00:00","title":"THE EGYPTIAN LOVER","details":"electro. techno. electro funk. breakbeats. detroit techno.\n18+.\n$15 advance;\n$20 day of show.\nThe Egyptian Lover is the definition of living legend. A product of 1980s Los Angeles, The Egyptian Lover (real name Greg Broussard) is funky and still committed to analog authenticity. Alluring vocals and big bass lines atop an electric stew of drum machine and synth make for non-stop dance floor ammunition. Whether you call it old school hiphop or early electronic music, The Egyptian Lover is a strong influence on both. Live, the legendary lothario mans the turntables (with real vinyl!), his trusty 808, and vocals, creating sonic rhythms to seduce the ear drums. Old heads and newer fans alike will appreciate the Egyptian Lover.\nPhoto Gallery:"},{"url":"https://www.dnalounge.com/calendar/2022/05-20d.html","img":"http://www.dnalounge.com/flyers/2022/05/20d-1.jpg","date":"2022-05-20T21:00:00.000+00:00","title":"HELLA JUICY POLE SHOW","details":"hiphop. pole dancing.\n18+.\n$10 limited advance;\n$15 after;\n$20 day of show.\nCome out for a night of super sexy pole dancers at Hella Juicy! This pole dance showcase will feature ONLY larger bodied, BIPOC and queer folks from San Francisco, Los Angeles and Seattle! Please bring cash/singles to make it rain for the performers!"},{"url":"https://www.dnalounge.com/calendar/2022/05-21a.html","img":"http://www.dnalounge.com/flyers/2022/05/21a-1.jpg","date":"2022-05-21T00:00:00.000+00:00","title":"TIME MACHINE","details":"burlesque.\n18+.\nGen. Adm.: $15 limited advance;\n$20 after;\n$30 day of show;\n\nBalcony Seating: $30 limited advance;\n$35 after;\nMain Floor Seating: $30 limited advance;\n$35 after.\nSet the controls on the Wayback Machine, because San Francisco's world-famous Hubba Hubba Revue is taking you on an action-packed, burlesque adventure through time itself!\n\nTickets and Seating Information:\n\nGeneral Admission tickets do not include guaranteed seating.\n\nReserved Seating: Preferred seating is sold by the chair. Seating is at cocktail tables on the main floor, and against the railing on the balcony. Reserved seating ticket-holders will be given wristbands and seated at the event by the Hubba Hubba Revue staff. Individuals and groups with odd numbers may be seated together and share tables. Large parties are encouraged to buy tickets as a single purchase.\n\nPizza Special: A table for five, admission for five, and a large two topping pizza!\n\nFront Row VIP: A table for five right in front of the stage, including admission for five and bottle service!\n\nVIP Booths: These are against the wall, downstairs, with a good view of the stage and include admission for six and bottle service.\nPhoto Gallery:"},{"url":"https://www.dnalounge.com/calendar/2022/05-21.html","img":"http://www.dnalounge.com/flyers/2022/05/21-1.jpg","date":"2022-05-21T22:00:00.000+00:00","title":"THE DOJA CAT DISCO","details":"pop. hiphop.\n18+.\n$15 limited advance;\n$20 after;\n$30 day of show.\nGet into it yuh! Introducing the Doja Cat Disco, a tribute dance party to the woman herself. While she may, or may not be \"dipping\", we will be coming together to celebrate her music from her full discography, as well as those of her best friends like Saweetie, SZA, Ariana Grande, Megan Thee Stallion, The Weeknd, Young Thug, BIA, Gucci Mane, Tove Lo, Latto, City Girls, Cardi B, Anne-Marie \u0026 more!\n\nExperience:\n• A Doja-Inspired twerking contest with $$$ prizes.\n• Doja Cat music video projections.\n• Make-it-rain cash guns.\n• Take a photo with Doja Cat standee.\n• Glittery Balloon Decorations.\n• And more surprises!\n\nAttire: fur coats, gucci, dior, matching activewear sets, cropped tank tops, colorful sneakers, rib-knit tank dressers, square-toe kitten heels, icy wear, or whatever you feel like!\nPhoto Gallery:"},{"url":"https://www.dnalounge.com/calendar/2022/05-21d.html","img":"http://www.dnalounge.com/flyers/2022/05/21d-1.jpg","date":"2022-05-21T00:00:00.000+00:00","title":"HARDLY STRICTLY FOLK PUNK","details":"folk punk. bluegrass. blues. rock n roll.\nall ages.\n$10 advance;\n$15 door.\nComing from the booker of Death to False Folk Punk, this lineup (in true spirit of the parodied name) features a variety of acts from swamp rocking The Dik Diks, to the traditional folky banjo tunes of Dirty Laundry. Is it a Folk Punk show? No! Is it not a folk punk show? Also no! Come out, square dance and get down with the hardly stricklyness."},{"url":"https://www.dnalounge.com/calendar/2022/05-23.html","img":"http://www.dnalounge.com/flyers/2021/06/28-1.jpg","date":"2022-05-23T21:30:00.000+00:00","title":"DNA Lounge: Death Guild, 23 May 2022 (Mon)","details":"gothic. industrial. synthpop.\n18+.\n$5 advance;\n$5 \u003c 10:30pm;\n$8 after.\nDeath Guild is the oldest weekly goth/industrial dance night in the world! Every Monday, six DJs in two rooms play a mix of gothic, industrial, synthpop, noise, ambient, and weird stuff for those who love the darker side of things."},{"url":"https://www.dnalounge.com/calendar/2022/05-23d.html","img":"http://www.dnalounge.com/flyers/2022/05/23d-1.jpg","date":"2022-05-23T00:00:00.000+00:00","title":"DNA Lounge: Monday Night Hubba, 23 May 2022 (Mon)","details":"burlesque.\n18+.\nGen. Adm.: $10;\nReserved Seating: $15.\nMonday Night Hubba is the perfect way to start your week sexy: with cocktails, tease, comedy and a more intimate experience than Hubba's big monthly extravaganzas! Each Monday night is a fun-filled, shimmering showcase of local, national and international burlesque and variety talent -- and a chance to see the most dazzling debuts before they hit it big!"},{"url":"https://www.dnalounge.com/calendar/2022/05-24d.html","img":"http://www.dnalounge.com/flyers/2022/05/24d-1.jpg","date":"2022-05-24T00:00:00.000+00:00","title":"BLAZE YA DEAD HOMIE + KING KLICK","details":"hiphop. horrorcore. stoner rap.\nall ages.\n$15 advance;\n$20 day of show.\nFor over 25 years, Blaze Ya Dead Homie has remained one of the freshest, most innovative voices in underground hiphop. A towering figure in the horrorcore sub-genre, he's mastered not just the craft of rapping but the art of reinvention, developing new characters and introducing them across his discography. It's a skill that puts him in league not just with rappers like Twiztid and N.W.A. but filmmakers like Quentin Tarantino and John Singleton.\n\n\"It has a lot do with comic books and movies in general,\" Blaze says. \"As an artist, if you're making movies, you don't want to make the same movie over and over again, and it's fun to create new characters to do new things that ultimately your main character wouldn't do.\" \"A lot of them are dead,\" he says upon reflection of his various characters, but the Blaze Ya Dead Homie persona embodies a reincarnated gang member originally killed in 1980s. His albums resurrect not just a character but an entire era that, through Blaze's work, still has much to say. \"It was just fun,\" he says of that era. \"Your heads were nodding all the time. The music had a lot of bump. There were house parties and block parties. It was gangster! That's what it was.'\"\n\nSince debuting on Twiztid's \"Hound Dogs\" in 1997, Blaze has released numerous albums and a slew of cult-classic collaborations as a member of groups like Dark Lotus, Drive-By and Zodiac MPrint. Almost all of his records have charted in Billboard. Inspired by the likes of Eazy-E, Dr. Dre, the Notorious B.I.G. and Detroit underground star the D.O.C., now the other half of Blaze's Zodiac MPrint. Today, the rapper remains as creative as ever, and as the Billboard charts show, his fans are responding with as much excitement as ever.\n\nKing Klick is a Suburban Noise Records supergroup consisting of Chucky Chuck, Johnny Richter \u0026 Obnoxious. 2 of which have already made themselves household names as founding members of Kottonmouth Kings, and DG@F. The trio have recorded tracks with Madchild (of Swollen Members), Whitney Peyton, (Hed) P.E, Lil Saint, and other members of the extended Suburban Noize family, which has solidified itself as one of the most notorious independent rap labels on the planet."},{"url":"https://www.dnalounge.com/calendar/2022/05-25d.html","img":"http://www.dnalounge.com/flyers/2022/05/25d-1.jpg","date":"2022-05-25T00:00:00.000+00:00","title":"FLUX VERTICAL THEATRE","details":"pole dancing.\n18+.\nGen. Adm.: $10;\nReserved Seating: $15.\nJoin us for a special, midweek showcase by the Bay Area's premier pole-dance company, Flux Vertical Theatre! Thrill to the skills of these stunning performers, as they bring dance, gymnastics, theater and circus arts to the pole, upstairs in our swanky, second-story clubhouse!"},{"url":"https://www.dnalounge.com/calendar/2022/05-26d.html","img":"http://www.dnalounge.com/flyers/2022/05/26d-1.jpg","date":"2022-05-26T21:00:00.000+00:00","title":"MOBBED UP:\nAN ALL CREWS DRUM \u0026 BASS EVENT","details":"d+b. jungle. halftime. breaks. footwerk. trap.\n21+.\n$8 limited advance;\n$10 after;\n$15 day of show.\nCalling all Bay Area DnB, Jungle and bass heads of all sorts! Thursday, May 26th, Stamina, Dystopia, Shelter, Wormhole, Fraktured and Soundpieces join forces in SF to celebrate Jungle, Drum \u0026 Bass, and broken beats of all flavors! With this massive lineup these local crews look to blend, grow and broaden the Bay Area community through a shared love of bass. Don't sleep on this one!"},{"url":"https://www.dnalounge.com/calendar/2022/05-27.html","img":"http://www.dnalounge.com/flyers/2022/05/27-1.jpg","date":"2022-05-27T21:00:00.000+00:00","title":"BOMMER + POINT.BLANK","details":"bass music. dubstep. d+b. riddim.\n18+.\n$10 limited advance;\n$15 after;\n$20 day of show.\nZack Bommer is a dubstep guru. As he stands behind a turntable in his oversize crewneck sweater, this St. Louis artist may look like your average skinny skater bro who haunts the internet, but his tracks hold real sway over bass music lovers. Especially those who want to smoke a blunt, drink a beer, and enjoy themselves to the tune of hard and heavy EDM with a pinch of riddim and a shitload of fun. Bommer not only djs and makes excellent dubstep, he also dabbles in hiphop production. His tracks may be short, but they have a nefarious side that make dubstep lovers go crazy - so much so that it's not a surprise when a new Bommer tracks get 3000 listens in 24 hours. The Let's Bounce tour is bringing Bommer and his (highly talented) homies to the bay: ready yourself for the hype.\n\nFrom across the globe comes Belgian EDM star Point.Blank (aka Matar Desmet). The DJ/producer has been in the game for more than a decade, and specializes in aggressive, heavy riddim expertly woven with drops that will almost stop your heart. High energy, in your face tracks are Point.Blank's calling card - there's something distinctly European about his dub tracks but exactly what is hard to pinpoint. All we know is that for hard dance grooves, Point.Blank is your man. After a few years of the pandemic making DJs stay local, it'll be amazing to see some far from home artists testing new music on the road."},{"url":"https://www.dnalounge.com/calendar/2022/05-27d.html","img":"http://www.dnalounge.com/flyers/2022/05/27d-1.jpg","date":"2022-05-27T21:00:00.000+00:00","title":"KHARKIV KULTURE","details":"hiphop. techno.\n18+.\n$15 advance;\n$20 day of show.\n\"Kharkiv Kulture\" is a project to bring the vibe and essence of Ukrainian urban culture to San Francisco through music. This event is also a fundraiser for a Lviv, Ukraine-based volunteer group known as \"Street Culture\". Slava Ukraini!"},{"url":"https://www.dnalounge.com/calendar/2022/05-28.html","img":"http://www.dnalounge.com/flyers/2022/05/28-1.jpg","date":"2022-05-28T21:00:00.000+00:00","title":"GRAVEDGR + LIT LORDS","details":"hard trap. hardstyle. hard dance. d+b. dubstep.\n18+.\n$10 advance;\n$15 day of show;\n$20 door.\nFrom the dark dank of the cemetery comes Gravedgr, a DJ/producer who claims to have actually worked digging graves. Bucket hat pulled down and mask pulled all the way up makes Gravedgr an anonymous, elusive type - he cuts quite a figure as he mans the stage (the shovel he brings out for press photos adds to the ominous vibes). Hard yet sometimes trappy, Gravedgr doesn't ignore his darker undertones, instead embracing them and weaving them into a heady hardstyle set that is sure to keep you moving. Tracks range from moody and melodic to absolutely bonkers aggression, sometimes all in one song. Collabs and friendships with high profile artists (DJ Carnage, Junkie Kid, Lil Texas) seem to point to the fact that this anonymous kid from seemingly nowhere has a past in the EDM scene. We really can't say for sure who Gravedgr is - but we can guarantee a good time and perhaps a little mosh pit if you're lucky.\n\nWorlds collide when Lit Lords (Isaiah and Wade) take the stage. Kings of EDM but with musical roots that run the gamut from heavy metal to R\u0026B, it's not surprising that Lit Lords can make heavy trap with little tastes of everything: future house, drum and bass, club music. Known for their breathtaking drops, the duo has been steadily building their fan base over the last few years, bringing an old style twist to their hard trap sounds. Even though Wade is taking a break from the shows, Lit Lords as a project is still very much ready to rock you. Live, Isaiah is manning the rig so expect wild lights, relentless beats, and all the heavy trap you can handle."},{"url":"https://www.dnalounge.com/calendar/2022/05-28d.html","img":"http://www.dnalounge.com/flyers/2022/05/28d-1.jpg","date":"2022-05-28T21:00:00.000+00:00","title":"JUNGLE CRUISE","details":"d+b. jungle. dubstep. hard dance.\nall ages.\n$10 limited advance;\n$15 after;\n$20 door.\nAll Aboard the Jungle Cruise! Drum And Bass / Jungle, You Can't Lose!\n\nIt's always paradise here. From the imaginations of the Stream Queen, Dream Team, Corrine \u0026 Duchess, (Bay Area DnB \u0026 Rave Favorites) in collaboration with PLUR Alliance, comes an event like no other! A vacation from the mundane, Jungle Cruise promises to put a refreshing new spin on the genre and scene, all the while celebrating Drum and Bass, From Liquid to Neuro, Jungle to Jump up and Bass Music alike. Whether you are an OG Junglist, or new to the crew, we've got a spot on the boat just for you. If you like sick beats \u0026 pounding baselines coupled with hilarious antics and ridiculous fun, look no further. Where the waves meet the rave. Jungle Cruise. Its the one you choose!\n\nNautical, Tropical and Animal themed dress is strongly encouraged. (We love a theme)\n\nThis world is full of perfect pairings: Wine \u0026 Cheese, Carrots \u0026 Peas, Monkeys \u0026 Trees, and BITCH PLZ is one of these. You may remember them making waves in the Bay Area Drum and Bass scene, almost 10 years ago. Opening for such acts as Dj Craze, Pendulum and Andy C, BITCH PLZ is the duo and collaboration of Bay Area Rave DJ/MC, CORRINE (PLUR Alliance, Shelter SF, Fraktured SF) and former SF resident, DJ/Producer/Vocalist, MISS HAZE (Bass Cellar, Ritual Dubstep). Formed in 2013, they quickly gained notoriety and became one of the bay area's top DNB acts. Bitch Plz is also a part of \"The DnB Girls\" collective, A hand picked crew of some of the most talented and successful woman in DNB in North America. These 2 bad bitches throw down ball busting basslines and as many peaktime bangers as they can stuff into their set, making for a captivating performance.\n\nHip hop inspired, sexy swag, cascading chord progressions and enough ragga jungle to make you pass the dutchie pon the left handside, BITCH PLZ puts on a show like no other. They have a 'no messing around' sassy style, booty poppin' sensibility and tend to liven up the dancefloor wherever they go. Although life has sent their careers in two different directions (geographically), You can never take the BITCH out of BITCH PLZ and the two of them have maintained some sort of hive mind about music all these years. So, they come together to give you all the throwback anthems, rhymes and routines that you've come to love, including some new tricks up their sleeves, for this ONE NIGHT ONLY performance. Whether you are new to the scene or still have a BITCH PLZ mix CD stuck in your car's CD player, you don't want to miss this very special performance, with B2B DJing, Singing and MCing and all the Festival Drum and Bass you plz."},{"url":"https://www.dnalounge.com/calendar/2022/05-29d.html","img":"http://www.dnalounge.com/flyers/2022/05/29d-1.jpg","date":"2022-05-29T17:00:00.000+00:00","title":"MEMORIAL WEEKEND MUSIC FESTIVAL","details":"rock. acoustic. indie.\nall ages.\n$12 advance;\n$15 day of show.\nFeaturing the best new rock talent from around the Bay Area. This show will be your chance to say you saw them before they made it big!"},{"url":"https://www.dnalounge.com/calendar/2022/05-30.html","img":"http://www.dnalounge.com/flyers/2021/06/28-1.jpg","date":"2022-05-30T21:30:00.000+00:00","title":"DNA Lounge: Death Guild, 30 May 2022 (Mon)","details":"gothic. industrial. synthpop.\n18+.\n$5 advance;\n$5 \u003c 10:30pm;\n$8 after.\nDeath Guild is the oldest weekly goth/industrial dance night in the world! Every Monday, six DJs in two rooms play a mix of gothic, industrial, synthpop, noise, ambient, and weird stuff for those who love the darker side of things."},{"url":"https://www.dnalounge.com/calendar/2022/05-30d.html","img":"http://www.dnalounge.com/flyers/2022/05/30d-1.jpg","date":"2022-05-30T00:00:00.000+00:00","title":"DNA Lounge: Monday Night Hubba, 30 May 2022 (Mon)","details":"burlesque.\n18+.\nGen. Adm.: $10;\nReserved Seating: $15.\nMonday Night Hubba is the perfect way to start your week sexy: with cocktails, tease, comedy and a more intimate experience than Hubba's big monthly extravaganzas! Each Monday night is a fun-filled, shimmering showcase of local, national and international burlesque and variety talent -- and a chance to see the most dazzling debuts before they hit it big!"},{"url":"https://www.dnalounge.com/calendar/2022/06-01d.html","img":"http://www.dnalounge.com/flyers/2022/06/01d-1.jpg","date":"2022-06-01T00:00:00.000+00:00","title":"BETAMAXX \u0026 PARALLELS","details":"synthpop. synthwave.\nall ages.\n$15 advance;\n$20 day of show.\nBetamaxx is an 80's synth revival project by Nick Morey, hailing from Pittsburgh, Pennsylvania. The project was formed in mid-2012 with the release of the \"Lost Formats\" LP in late September. The name \"Betamaxx\" was contrived from Sony \"Betamax\" movie player which rivaled VHS in the early-mid 80's. Betamaxx's sound is inspired and created with a use of a wide variety of analog and digital hardware synths from the 80's and today including the Roland Juno-60, Sequential Circuits Prophet-6 and Ensoniq ESQ-1. Betamaxx focuses on a multi-genre approach to writing, with influences such as The Cure, Tangerine Dream, Boards of Canada, and John Carpenter. He has been featured on such words as the \"Kung Fury\" original movie soundtrack, and on the Amazon Prime series \"Red Oaks\".\n\nSupersymmetry is Parallels' 5th studio album, written and produced by front-woman Holly Dodson. It's a 10-song synth-pop daydream, pulsing with classic synthesiser sounds, sonic spells and lyrical transmissions. A Toronto expat, Dodson recorded most of the album in her studio in LA throughout lockdown. In 2020, Parallels celebrated the 10-year Anniversary of their debut album \"Visionaries\" with a limited edition vinyl repress through NewRetroWave Records. The album sold out and charted on iTunes Electronic Chart. In collaboration with electro-rock artist Radio Wolf, Parallels co-wrote and co-produced a 7-song soundtrack for Sci-Fi feature film \"Proximity\" directed by Emmy-Award winning VFX artist Eric Demeusy (Stranger Things, Tron: Legacy, Game Of Thrones). The album was released on LA-based imprint, Lakeshore Records and their song \"Journey's End\" won Best Song In A Film at the Los Angeles Film Awards. Parallels has toured extensively from Stockholm to New York City, and has shared billing with artists including Florence + The Machine, Miami Horror, Glass Candy, TR/ST and YELLE. They can also be heard on the soundtrack of 2013 Oscar-winning short film \"Curfew\". In Dodson's unparalleled style, Supersymmetry is a deep dive into the heart of Parallels' Universe.\n\nMissing Words is James Meays, Colin Wood, and Jameson Meays. Known for their eclectic brand of synth-pop and energetic live shows, the three-piece band is venturing into uncharted territories. With their forthcoming EP and new live shows planned, they will take an expansive sound and turn it inwards. The new songs deal with trauma, heartache, and growth in a way that only James (Lead Vocals) can summarize. The synth-scape and lead guitars, and rhythmic drums create the atmosphere for which the band can truly create a memorable sound. The future is bright for this young band.\n\nInspired by 80 movies, new wave and vintage synthesizers, Teeel creates a range of music from hypnotic vocal dance pop to dark electronic synth rock.\n\nSlackmachine: Dystopian dancefloor rhythms for a post-computer universe."},{"url":"https://www.dnalounge.com/calendar/2022/06-02.html","img":"http://www.dnalounge.com/flyers/2022/06/02-1.jpg","date":"2022-06-02T21:00:00.000+00:00","title":"FUNTCASE","details":"dubstep.\n18+.\n$10, $15 limited advance;\n$20 after;\n$25 day of show.\nProducer and DJ from Bournemouth, UK, FuntCase aka James Hazell is known for his raw and dirty sound, forging the way with his controversial 'filthy' style. \"FuntCase produces sensory overload bass music that wobbles, womps and machine guns through your body, making you dance whether you want to or not.\" FuntCase has become a legend of the DJ world. With an incredibly loyal fan base Funty is known worldwide for working hard, playing hard, travelling hard - and DJing hard on stages globally."},{"url":"https://www.dnalounge.com/calendar/2022/06-03.html","img":"http://www.dnalounge.com/flyers/2022/06/03-1.jpg","date":"2022-06-03T00:00:00.000+00:00","title":"SUFFOCATION + ATHEIST","details":"death metal. tech death metal. thrash metal. prog metal.\nall ages.\n$20 advance;\n$27 day of show.\nSuffocation are a bunch of nice New York guys playing technical death metal for a living- and doing it well. The band began as high schoolers on Long Island, and throughout lineup changes and eight albums and several record labels have morphed into elder statesmen of American death metal. For decades Suffocation has been touring globally, bringing their brutal, aggressive sound to fans of all stripes. Growling, or guttural yowling, is a hallmark of the band - Suffocation was one of the first to harness this vocal sound and still one of the best. Live, Suffocation makes metal look easy (perhaps due to years of touring). Be prepared for blast beats, heated guitar solos, and the most precise metal instrumentation you could hope for - don't be surprised if your neck hurts the next day from all the head banging."},{"url":"https://www.dnalounge.com/calendar/2022/06-04.html","img":"http://www.dnalounge.com/flyers/2022/06/04-1.jpg","date":"2022-06-04T21:00:00.000+00:00","title":"RED:\nTHE TAYLOR SWIFT DANCE PARTY","details":"pop. country.\n18+.\n$15 limited advance;\n$20 after;\n$30 door.\nFrom West Reading, Pennsylvania to Nashville, Tennessee comes the ultimate night for Taylor Swift lovers and ex-lovers. Swifties of the world, we unite under one roof to sing the songs together of our fearless leader, everything from \"Picture to Burn\" to \"22\" to \"Empty Space\" to \"Lover\" to \"Shake It Off\" (And yes, all the Taylor's Versions). If you don't cry tears of joy at least once this night, then you're not doing it right.\n\nExperience\n• Taylor Swift music video projections\n• Take a photo with Taylor Swift standee\n• Taylor inspired performances\n• Professional photographers\n• Glittery Balloon Decorations\n• And more surprises!"},{"url":"https://www.dnalounge.com/calendar/2022/06-04d.html","img":"http://www.dnalounge.com/flyers/2022/06/04d-1.jpg","date":"2022-06-04T21:00:00.000+00:00","title":"CATACOMBS OF RIDDIM","details":"dubstep. riddim. house. trap.\n18+.\n$10 limited advance;\n$15 after;\n$20 door.\nBass music producer and DJ from New York, Emorfik, aka Damiano Cortini, is known for his energy, stage presence, and extremely heavy sound design. This energetic producer on the rise plays quad drops and triple drops with ease. His newest single \"Try Me\" really shows how unique his sound design really is. Emorfik has quickly become a fan favorite and posts content for his supporters on social media daily! His video series \"doubles on the roof\" and \"doubles in the hammoc\" have reached over 150,000 people on Instagram alone! Don't miss out on the only tour stop he has in the Bay Area this year!"},{"url":"https://www.dnalounge.com/calendar/2022/06-01d.html","img":"http://www.dnalounge.com/flyers/2022/06/01d-1.jpg","date":"2022-06-01T00:00:00.000+00:00","title":"BETAMAXX \u0026 PARALLELS","details":"synthpop. synthwave.\nall ages.\n$15 advance;\n$20 day of show.\nBetamaxx is an 80's synth revival project by Nick Morey, hailing from Pittsburgh, Pennsylvania. The project was formed in mid-2012 with the release of the \"Lost Formats\" LP in late September. The name \"Betamaxx\" was contrived from Sony \"Betamax\" movie player which rivaled VHS in the early-mid 80's. Betamaxx's sound is inspired and created with a use of a wide variety of analog and digital hardware synths from the 80's and today including the Roland Juno-60, Sequential Circuits Prophet-6 and Ensoniq ESQ-1. Betamaxx focuses on a multi-genre approach to writing, with influences such as The Cure, Tangerine Dream, Boards of Canada, and John Carpenter. He has been featured on such words as the \"Kung Fury\" original movie soundtrack, and on the Amazon Prime series \"Red Oaks\".\n\nSupersymmetry is Parallels' 5th studio album, written and produced by front-woman Holly Dodson. It's a 10-song synth-pop daydream, pulsing with classic synthesiser sounds, sonic spells and lyrical transmissions. A Toronto expat, Dodson recorded most of the album in her studio in LA throughout lockdown. In 2020, Parallels celebrated the 10-year Anniversary of their debut album \"Visionaries\" with a limited edition vinyl repress through NewRetroWave Records. The album sold out and charted on iTunes Electronic Chart. In collaboration with electro-rock artist Radio Wolf, Parallels co-wrote and co-produced a 7-song soundtrack for Sci-Fi feature film \"Proximity\" directed by Emmy-Award winning VFX artist Eric Demeusy (Stranger Things, Tron: Legacy, Game Of Thrones). The album was released on LA-based imprint, Lakeshore Records and their song \"Journey's End\" won Best Song In A Film at the Los Angeles Film Awards. Parallels has toured extensively from Stockholm to New York City, and has shared billing with artists including Florence + The Machine, Miami Horror, Glass Candy, TR/ST and YELLE. They can also be heard on the soundtrack of 2013 Oscar-winning short film \"Curfew\". In Dodson's unparalleled style, Supersymmetry is a deep dive into the heart of Parallels' Universe.\n\nMissing Words is James Meays, Colin Wood, and Jameson Meays. Known for their eclectic brand of synth-pop and energetic live shows, the three-piece band is venturing into uncharted territories. With their forthcoming EP and new live shows planned, they will take an expansive sound and turn it inwards. The new songs deal with trauma, heartache, and growth in a way that only James (Lead Vocals) can summarize. The synth-scape and lead guitars, and rhythmic drums create the atmosphere for which the band can truly create a memorable sound. The future is bright for this young band.\n\nInspired by 80 movies, new wave and vintage synthesizers, Teeel creates a range of music from hypnotic vocal dance pop to dark electronic synth rock.\n\nSlackmachine: Dystopian dancefloor rhythms for a post-computer universe."},{"url":"https://www.dnalounge.com/calendar/2022/06-02.html","img":"http://www.dnalounge.com/flyers/2022/06/02-1.jpg","date":"2022-06-02T21:00:00.000+00:00","title":"FUNTCASE","details":"dubstep.\n18+.\n$10, $15 limited advance;\n$20 after;\n$25 day of show.\nProducer and DJ from Bournemouth, UK, FuntCase aka James Hazell is known for his raw and dirty sound, forging the way with his controversial 'filthy' style. \"FuntCase produces sensory overload bass music that wobbles, womps and machine guns through your body, making you dance whether you want to or not.\" FuntCase has become a legend of the DJ world. With an incredibly loyal fan base Funty is known worldwide for working hard, playing hard, travelling hard - and DJing hard on stages globally."},{"url":"https://www.dnalounge.com/calendar/2022/06-03.html","img":"http://www.dnalounge.com/flyers/2022/06/03-1.jpg","date":"2022-06-03T00:00:00.000+00:00","title":"SUFFOCATION + ATHEIST","details":"death metal. tech death metal. thrash metal. prog metal.\nall ages.\n$20 advance;\n$27 day of show.\nSuffocation are a bunch of nice New York guys playing technical death metal for a living- and doing it well. The band began as high schoolers on Long Island, and throughout lineup changes and eight albums and several record labels have morphed into elder statesmen of American death metal. For decades Suffocation has been touring globally, bringing their brutal, aggressive sound to fans of all stripes. Growling, or guttural yowling, is a hallmark of the band - Suffocation was one of the first to harness this vocal sound and still one of the best. Live, Suffocation makes metal look easy (perhaps due to years of touring). Be prepared for blast beats, heated guitar solos, and the most precise metal instrumentation you could hope for - don't be surprised if your neck hurts the next day from all the head banging."},{"url":"https://www.dnalounge.com/calendar/2022/06-04.html","img":"http://www.dnalounge.com/flyers/2022/06/04-1.jpg","date":"2022-06-04T21:00:00.000+00:00","title":"RED:\nTHE TAYLOR SWIFT DANCE PARTY","details":"pop. country.\n18+.\n$15 limited advance;\n$20 after;\n$30 door.\nFrom West Reading, Pennsylvania to Nashville, Tennessee comes the ultimate night for Taylor Swift lovers and ex-lovers. Swifties of the world, we unite under one roof to sing the songs together of our fearless leader, everything from \"Picture to Burn\" to \"22\" to \"Empty Space\" to \"Lover\" to \"Shake It Off\" (And yes, all the Taylor's Versions). If you don't cry tears of joy at least once this night, then you're not doing it right.\n\nExperience\n• Taylor Swift music video projections\n• Take a photo with Taylor Swift standee\n• Taylor inspired performances\n• Professional photographers\n• Glittery Balloon Decorations\n• And more surprises!"},{"url":"https://www.dnalounge.com/calendar/2022/06-04d.html","img":"http://www.dnalounge.com/flyers/2022/06/04d-1.jpg","date":"2022-06-04T21:00:00.000+00:00","title":"CATACOMBS OF RIDDIM","details":"dubstep. riddim. house. trap.\n18+.\n$10 limited advance;\n$15 after;\n$20 door.\nBass music producer and DJ from New York, Emorfik, aka Damiano Cortini, is known for his energy, stage presence, and extremely heavy sound design. This energetic producer on the rise plays quad drops and triple drops with ease. His newest single \"Try Me\" really shows how unique his sound design really is. Emorfik has quickly become a fan favorite and posts content for his supporters on social media daily! His video series \"doubles on the roof\" and \"doubles in the hammoc\" have reached over 150,000 people on Instagram alone! Don't miss out on the only tour stop he has in the Bay Area this year!"},{"url":"https://www.dnalounge.com/calendar/2022/06-06.html","img":"http://www.dnalounge.com/flyers/2021/06/28-1.jpg","date":"2022-06-06T21:30:00.000+00:00","title":"DNA Lounge: Death Guild, 6 Jun 2022 (Mon)","details":"gothic. industrial. synthpop.\n18+.\n$5 advance;\n$5 \u003c 10:30pm;\n$8 after.\nDeath Guild is the oldest weekly goth/industrial dance night in the world! Every Monday, six DJs in two rooms play a mix of gothic, industrial, synthpop, noise, ambient, and weird stuff for those who love the darker side of things."},{"url":"https://www.dnalounge.com/calendar/2022/06-06d.html","img":"http://www.dnalounge.com/flyers/2022/06/06d-1.jpg","date":"2022-06-06T00:00:00.000+00:00","title":"DNA Lounge: Monday Night Hubba, 6 Jun 2022 (Mon)","details":"burlesque.\n18+.\nGen. Adm.: $10;\nReserved Seating: $15.\nThe first Monday of every month is extra juicy, as Hubba Hubba Revue's Juicy D. Light hosts the best in burlesque, drag \u0026 variety, upstairs in our swanky, second-story clubhouse!\n\nMonday Night Hubba is the perfect way to start your week sexy: with cocktails, tease, comedy and a more intimate experience than Hubba's big monthly extravaganzas! Each Monday night is a fun-filled, shimmering showcase of local, national and international burlesque and variety talent -- and a chance to see the most dazzling debuts before they hit it big!"},{"url":"https://www.dnalounge.com/calendar/2022/06-09.html","img":"http://www.dnalounge.com/flyers/2022/06/09-1.jpg","date":"2022-06-09T19:30:00.000+00:00","title":"JUNGLE ROT + INTERNAL BLEEDING","details":"death metal. slam metal. death-core.\nall ages.\n$19 advance;\n$25 day of show.\nLong before the city of Kenosha, Wisconsin was a household name, the city gave birth to a thrash-tinged death metal band whose only mission is to bring metal to the masses: Jungle Rot. Long hair, fun, power-filled riffs, dark grooves, and a name that you don't wanna Google image search. Let's just say that lyrically they touch on all aspects of gore (death, war, bodily injury). In that wonderful time called the 90s, the band recorded, toured, and sharpened their death metal chops non-stop. And the band hasn't slowed down since. They've released almost a dozen albums, opened for huge names in metal, and conquered festivals beneath their feet. For decades they've been grinding away for the American (and global) public, crystallizing into the metal beast you see before you. Live, the foursome is an imposing force: aggressive vocals backed by evocative and brutal instrumentation. It's a formula that has worked for ages for headbangers worldwide.\n\nAnother metal band with a name you don't want to Google is the preeminent fathers of slam metal Internal Bleeding. For decades, these Long Islanders have been playing slam (some say they even invented the slower death metal riffs that slam is known for). Self dubbed as death metal's most dangerous band, Internal Bleeding has been bringing their danger on tour for thirty years! Many lineup changes have occurred, including current vocalist and new blood Steve Worley taking over the mic, but the ethos of the band has never wavered. Smoking bud(and/or cigars), drinking beers (and/or whiskey), and delivering the best slam metal that Long Island has to offer."},{"url":"https://www.dnalounge.com/calendar/2022/06-10a.html","img":"http://www.dnalounge.com/flyers/2012/11/09a-1.jpg","date":"2022-06-10T00:00:00.000+00:00","title":"DNA Lounge: Mortified, 10 Jun 2022 (Fri)","details":"all ages.\nGen. Adm.: $15 limited advance;\n$20 after;\n$30 door;\nReserved Seating: $35.\nHailed as a \"cultural phenomenon\" by Newsweek and celebrated for years by the likes of This American Life, The Today Show, The Onion AV Club, \u0026 Entertainment Weekly, Mortified is a comic excavation of teen angst artifacts (journals, poems, letters, lyrics, home movies, schoolwork) as shared by their original authors -- in front of total strangers!\n\nWhere else can you hear grown men and women confront their past with firsthand tales of their first kiss, first puff, worst prom, fights with mom, life at bible camp, worst hand job, best mall job, and reasons they deserved to marry Bon Jovi? Submissions come from a wide range of participants, from professional performers to total amateurs . All in the noble pursuit of self-degradation. Share the shame.\n\nTickets and Seating Information:\n\nGeneral Admission tickets do not include guaranteed seating. When the seats are full, there is ample standing room.\n\nReserved Seating is sold by the chair, and is in the first or second row.\n\nPizza Special: A table for five, admission for five, and a large two topping pizza!\n\nFront Row VIP: A table for five right in front of the stage, including admission for five and bottle service.\n\nDownstairs VIP Booths: These are against the wall with a good view of the stage and include admission for six and bottle service.\n\nUpstairs VIP, and Double: These don't have an unimpeded view of the stage, but are close to the balcony rail. They also include admission for six and bottle service."}]