[{"date":"2022-05-04T19:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2021/08/31061918/TheMoth.jpg","title":"The Moth StorySLAM - CRAVINGS","url":"https://secure.thefreight.org/835/the-moth-may","details":"CRAVINGS: Prepare a five-minute story about intense desires fueled by your favorite foods, people, or anything that has hit the \"I need it now!\" button on more than one occasion. Indulging with conviction or abstaining with difficulty!  Sugar tooth, primal desire...your hierarchy of needs. Pickles and ice cream, anyone?\n\nSince its launch in 1997, The Moth has presented thousands of stories told live and without notes.\nMoth shows are renowned for the great range of human experience they showcase. Each show starts with a theme, and the storytellers explore it, often in unexpected ways. Since each story is true and every voice authentic, the shows dance between documentary and theater, creating a unique, intimate, and often enlightening experience for the audience.\nThe Moth was founded by the novelist George Dawes Green, who wanted to recreate in New York the feeling of sultry summer evenings in his native Georgia, when moths were attracted to the light on the porch where he and his friends would gather to spin spellbinding tales. The first New York Moth event was held in George’s living room and the story events quickly spread to larger venues throughout the city.\nThrough ongoing programs in more than 29 cities, The Moth has presented over 30,000 stories to standing-room-only crowds worldwide and it currently produces more than 500 live shows each year. Additionally, The Moth runs storytelling workshops for high school students and adults in underserved communities through their Education and Community Programs.\nThe Moth has an enthusiastic following for all of its content. The Moth podcast is downloaded more than 50 million times a year, and each week, the Peabody Award-winning Moth Radio Hour is heard on over 480 radio stations worldwide. The Moth’s first book, The Moth: 50 True Stories was a NYT Bestseller and its newest book, All These Wonders: True Stories About Facing the Unknown was released March, 2017."},{"date":"2022-05-05T20:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2021/09/28111710/Andy-Yasmin.jpg","title":"Andy McKee \u0026 Yasmin Williams","url":"https://secure.thefreight.org/907/mckee-and-williams","details":"Guitar Player presents\nAndy McKee is among the world’s finest acoustic guitarists. His youthful energy and attention to song structure and melodic content elevates him above the rest. He entertains both the eye and the ear as he magically transforms the steel string guitar into a full orchestra via his use of altered tunings, tapping, partial capos, percussive hits and a signature two-handed technique.\n\nMcKee’s crossover success has helped him to achieve millions upon millions of YouTube viewers, underscoring his emergence as one of today’s most unique and influential artists. His song, “Drifiting” became one of the first YouTube viral videos with almost 60 million views. He has been featured as a cover story in both Acoustic Guitar Magazine in the US and the UK, and is also the figurehead of the unique Guitar Masters tours. He also curates his own annual guitar camp called Musicarium. McKee’s tour dates have taken him through Europe, Asia, Australia and North America, including tours with legendary acts including Prince, Dream Theater, and Tommy Emmanuel.\n\nWebsite | Facebook | Instagram | YouTube | Twitter\n  Yasmin Williams is an acoustic fingerstyle guitarist with an unorthodox, modern style of playing. Her music has been called some of the most imaginative guitar music out today. She utilizes various techniques including alternate tunings, percussive hits, and lap tapping in her music to great effect. She has won various local talent shows, was a finalist in the Rolling Stones Young Gun guitar competition, was the Grand prize winner of New York University's Ultra Violet Live talent show, and won the Gold Prize in the Instrumental category of the Mid-Atlantic Song Contest. She has been featured on several radio and television programs including New Sounds Soundcheck Podcast, NPR's Weekend Edition Saturday show, NPR Night Owl, NPR All Songs Considered, Woodsongs Old Time Radio Hour, and WUSA9, along with magazine features such as Acoustic Guitar Magazine and Vintage Guitar Magazine.\n\nShe graduated from New York University with a BM in Music Theory and Composition in December 2017. Her first album, Unwind, was released on May 4, 2018 and is available on all major streaming services and Bandcamp. The album has charted highly on several Amazon and iTunes charts including top paid albums, including charting at #7 on Amazon’s top paid albums and #1 on iTunes‘s Folk chart, and charted at #15 on Billboard's Heatseekers chart. Her recent album, Urban Driftwood, was released on January 29, 2021 and has received high praise from numerous major publications including The New York Times, Pitchfork, Rolling Stone, The Washington Post, NPR Music, No Depression, Bandcamp, Paste Magazine, and many other media outlets. \n\nWebsite | Facebook | Instagram | YouTube | Twitter\n\n "}]