[{"date":"2022-05-04T19:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2021/08/31061918/TheMoth.jpg","title":"The Moth StorySLAM - CRAVINGS","url":"https://secure.thefreight.org/835/the-moth-may","details":"CRAVINGS: Prepare a five-minute story about intense desires fueled by your favorite foods, people, or anything that has hit the \"I need it now!\" button on more than one occasion. Indulging with conviction or abstaining with difficulty!  Sugar tooth, primal desire...your hierarchy of needs. Pickles and ice cream, anyone?\n\nSince its launch in 1997, The Moth has presented thousands of stories told live and without notes.\nMoth shows are renowned for the great range of human experience they showcase. Each show starts with a theme, and the storytellers explore it, often in unexpected ways. Since each story is true and every voice authentic, the shows dance between documentary and theater, creating a unique, intimate, and often enlightening experience for the audience.\nThe Moth was founded by the novelist George Dawes Green, who wanted to recreate in New York the feeling of sultry summer evenings in his native Georgia, when moths were attracted to the light on the porch where he and his friends would gather to spin spellbinding tales. The first New York Moth event was held in George’s living room and the story events quickly spread to larger venues throughout the city.\nThrough ongoing programs in more than 29 cities, The Moth has presented over 30,000 stories to standing-room-only crowds worldwide and it currently produces more than 500 live shows each year. Additionally, The Moth runs storytelling workshops for high school students and adults in underserved communities through their Education and Community Programs.\nThe Moth has an enthusiastic following for all of its content. The Moth podcast is downloaded more than 50 million times a year, and each week, the Peabody Award-winning Moth Radio Hour is heard on over 480 radio stations worldwide. The Moth’s first book, The Moth: 50 True Stories was a NYT Bestseller and its newest book, All These Wonders: True Stories About Facing the Unknown was released March, 2017."},{"date":"2022-05-05T20:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2021/09/28111710/Andy-Yasmin.jpg","title":"Andy McKee \u0026 Yasmin Williams","url":"https://secure.thefreight.org/907/mckee-and-williams","details":"Guitar Player presents\nAndy McKee is among the world’s finest acoustic guitarists. His youthful energy and attention to song structure and melodic content elevates him above the rest. He entertains both the eye and the ear as he magically transforms the steel string guitar into a full orchestra via his use of altered tunings, tapping, partial capos, percussive hits and a signature two-handed technique.\n\nMcKee’s crossover success has helped him to achieve millions upon millions of YouTube viewers, underscoring his emergence as one of today’s most unique and influential artists. His song, “Drifiting” became one of the first YouTube viral videos with almost 60 million views. He has been featured as a cover story in both Acoustic Guitar Magazine in the US and the UK, and is also the figurehead of the unique Guitar Masters tours. He also curates his own annual guitar camp called Musicarium. McKee’s tour dates have taken him through Europe, Asia, Australia and North America, including tours with legendary acts including Prince, Dream Theater, and Tommy Emmanuel.\n\nWebsite | Facebook | Instagram | YouTube | Twitter\n  Yasmin Williams is an acoustic fingerstyle guitarist with an unorthodox, modern style of playing. Her music has been called some of the most imaginative guitar music out today. She utilizes various techniques including alternate tunings, percussive hits, and lap tapping in her music to great effect. She has won various local talent shows, was a finalist in the Rolling Stones Young Gun guitar competition, was the Grand prize winner of New York University's Ultra Violet Live talent show, and won the Gold Prize in the Instrumental category of the Mid-Atlantic Song Contest. She has been featured on several radio and television programs including New Sounds Soundcheck Podcast, NPR's Weekend Edition Saturday show, NPR Night Owl, NPR All Songs Considered, Woodsongs Old Time Radio Hour, and WUSA9, along with magazine features such as Acoustic Guitar Magazine and Vintage Guitar Magazine.\n\nShe graduated from New York University with a BM in Music Theory and Composition in December 2017. Her first album, Unwind, was released on May 4, 2018 and is available on all major streaming services and Bandcamp. The album has charted highly on several Amazon and iTunes charts including top paid albums, including charting at #7 on Amazon’s top paid albums and #1 on iTunes‘s Folk chart, and charted at #15 on Billboard's Heatseekers chart. Her recent album, Urban Driftwood, was released on January 29, 2021 and has received high praise from numerous major publications including The New York Times, Pitchfork, Rolling Stone, The Washington Post, NPR Music, No Depression, Bandcamp, Paste Magazine, and many other media outlets. \n\nWebsite | Facebook | Instagram | YouTube | Twitter\n\n "},{"date":"2022-05-06T20:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2022/02/12093234/Makana.jpg","title":"Makana\nThe Gift of Slack Key Guitar","url":"https://secure.thefreight.org/11209/makana","details":"With his intricate guitar playing featured on three Grammy-nominated albums, including the soundtrack of the Academy-Award winning film “The Descendants”, internationally renowned guitarist and vocalist Makana has earned recognition as a master of Hawaiian slack key guitar. Hailed for his electrifying performance style, the New York Times calls him “dazzling”, Makana has shared the stage with top music stars such as Jason Mraz and Jack Johnson, and opened for legends including Sting, Carlos Santana and Elvis Costello. He performs at leading venues worldwide, including the White House.\n\nBack by popular demand, Makana invites audiences on an uplifting tribute to slack key stylings, in which guitar strings are strategically loosened to produce a wholly unique sound. His anticipated show will dive into the rich history, amusing stories and breathtaking melodies of Hawaii’s distinct slack key guitar traditions. Celebrating the famous masters who shaped this style, including his legendary mentor Sonny Chillingworth, Makana will share songs, stories and insights spanning ancient to contemporary that illuminate these groundbreaking artists’ musicality and humor.\nWebsite | Facebook"},{"date":"2022-05-09T12:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2021/06/24082841/Bobby-McFerrin.jpg","title":"Bobby McFerrin\nCirclesongs\nHost: David Worm \u0026 Motion","url":"https://secure.thefreight.org/10848/11377","details":"“You get people together and get them singing, and you instantly knock down all the  walls – the creeds, the gender, age and race differences, everything. You’re all one at  that point, lifting your voices.” – Bobby McFerrin\nIf you love to sing, you are welcome to join Circlesongs with Bobby McFerrin, hosted by David Worm \u0026 Motion, for a singing session full of joy-filled improvised music-making for  singers of all levels of experience. Every Monday at noon for ninety minute at the wonderful Freight  \u0026 Salvage in Berkeley.\nBobby first developed Circlesongs in his now legendary solo a cappella performances, when he needed  other voices to help manifest his musical ideas. He gave the audience parts to sing, layering harmonies  and rhythms, using call and response, conducting and composing his spontaneous inventions. During  his years of worldwide touring, he evolved a variety of vocal groups beginning in the ‘80’s with his Bay  Area based group Voicestra. \nBobby’s Circlesongs concerts celebrated all the kinds of music that would spontaneously emerge from  anywhere in his stream-of-consciousness, like maybe from Americana or classical, R\u0026B, gospel, folk,  pop, rock, beatboxing—combined with any sound he could imagine. For Bobby, Circlesongs is not a concert or a performance… it is a service to create a singing space that is without words, genres or pre existing knowledge. There is a place in the circle for everyone. \nThese sessions will be hosted by David Worm, an original member of both Bobby’s Voicestra and  Gimme5, and a diversely gifted team of celebrated Bay Area singers. Including Bryan Dyer, Destani  Wolf, Tammi Brown and others. Bobby has recently moved back to San Francisco from Philadelphia  and is really excited to begin to create with these wonderful singers. \n“Bobby McFerrin’s greatest gift to his audience may be changing them from spectators  into celebrants and transforming a concert hall into a playground, a village center, a  joyous space.” – Los Angeles Times \nBobby McFerrin is an inspiration to singers around the world who celebrate his innovative technique  and spirit. His solo performances and collaborations with great artists—including Yo-Yo Ma, Chick  Corea, and the Vienna Philharmonic—are the stuff of legend. Along the way, there were 10 Grammy  Awards and a #1 global hit “Don’t Worry, Be Happy.” bobbymcferrin.com \n“Bobby McFerrin is an artist whose blinding originality has set him on a course that has  no maps but is awash with possibilities lurking in every curve of the road… sheer joy in  the elemental beauty of the voice… celebrates music as a primal essence, as crucial to  our sense of ourselves as breathing” – The Irish Times"},{"date":"2022-05-09T19:30:00.000+00:00","img":"https://cdn.thefreight.org/assets/2021/07/16090225/MNCMS.jpeg","title":"Classical at the Freight: Monday Night Chamber Music Society","url":"https://secure.thefreight.org/606/mncms","details":"Classical at the Freight\nGreat chamber music, up close and personal.  Join San Francisco Chamber Orchestra Music Director and violist Ben Simon for your monthly fix of classical masterpieces.  These friendly and accessible 75-minute programs feature SFCO All-Stars and special guests in the intimate “chamber” of Berkeley’s iconic Freight and Salvage.  \nMonday Night Chamber Music Society\nHrabba Atladottir \u0026 Liana Bérubé, violins\nStephanie Ng \u0026 Ben Simon, violas\nMichael Graham, cello\nFive San Francisco Chamber Orchestra All-Stars team up for their annual program of viola quintets; no, that’s not five violas but rather a string quartet enhanced by a second violist.  Masterpieces by Mozart and Brahms. \nWebsite | Facebook"}]