[{"date":"2022-05-20T00:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2022/02/12110904/foto-Niki-Jacobs-Band-Photo-credits-by-Milo-Dinkelaar-1038x576-1.jpg","title":"Niki Jacobs - The Ballad of Mauthausen","url":"https://secure.thefreight.org/11222/niki-jacobs","details":"\"The finest musical work about the Holocaust ever written.\" - Αντωνης Μποσκοιτης \nThe Ballad of Mauthausen features a Yiddish translation of the famous Mauthausen song cycle by composer Mikis Theodorakis.\nTheodorakis’ original composition was a cycle of four arias with lyrics based on poems written by Greek poet Iakovos Kambanellis, a survivor of the Nazi slave labor camp in Mauthausen, Upper Austria. Mauthausen was one of the most brutal Nazi concentration camps, where over half the inmates died simply as a result of the severe conditions, before 1940, when the Germans began systematically killing prisoners in gas chambers.\nSeveral years ago, Niki Jacobs, a world-renowned Yiddish singer, had the “Mauthausen” libretto translated into Yiddish – the language that most Jewish inmates of Mauthausen would have spoken – and the music was transcribed for her small but mighty ensemble. Theodorakis himself approved the project, which he both praised and supported. Jacobs has assembled an outstanding group of musicians, with roots in jazz, Balkan, klezmer, classical and improvised music, for the project. The musicians include Ro Krauss, viola/vocals; Peter van Os, accordion; Ruud Breuls, trumpet; and Emile Visser, cello.\nWebsite | Facebook"},{"date":"2022-05-21T00:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2022/02/18115625/YaelNaim.jpg","title":"Yael Naim","url":"https://secure.thefreight.org/11130/yael-naim","details":"The journey of self-discovery consumes every artist. That is certainly the case with Yael Naim, the Parisian-born, Franco-Israeli singer-songwriter.\nIn a career that has developed over the course of the last 20 years, the multi-instrumentalist and producer has been on a restless quest to create a sound world of her own across a string of increasingly absorbing albums – none more so than her latest offering, NightSongs.\nAs its title suggests, this is a hugely intimate album that sees her breaking away from the established way in which she makes music.\n \nHer last album, Older (released in 2015 and certified gold in France the following year) was co-produced with her husband David Donatien who also co-wrote four songs. Donatien was also co-produced and collaborated with her on her two previous offerings, She Was A Boy (2010) and her self-titled 2007 effort, both of which were credited to the pair. This time around, the songs are purely hers, arranged and produced solely by Yael.\n“I had this sense that I had different kinds of songs in me and I really wanted to see if they would work,” she says. “Everything started when I turned 39. I realized that I was probably half way through my life I wondered what I should be doing so I didn’t have any regrets. I realized I’d never dared create a musical project on my own - completely alone, with my moods, feelings and failings. I wanted to see what would come out of me and to work out who am I without the wonderful man, David, who has completed me so perfectly until now. A few months later, starting to record and conceive all these songs at night, I was surprised to actually find myself alone. Completely alone, indeed.\"\n“I also had a period of turbulence where everything seemed to shake around me, and I wanted to capture that in the music that I was making,” continues Yael. “The songs were darker and probably a bit deeper too.”\nWebsite | Facebook"},{"date":"2022-05-22T00:00:00.000+00:00","img":"","title":"Fundraiser by Genie Foon : 5th ANNUAL FOONTASTIC FUNDRAISER","url":"https://www.gofundme.com/f/5thannualfoontasticfundraiser","details":""},{"date":"2022-05-23T00:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2021/06/24082841/Bobby-McFerrin.jpg","title":"Bobby McFerrin\nCirclesongs\nHost: David Worm \u0026 Motion","url":"https://secure.thefreight.org/10848/11379","details":"“You get people together and get them singing, and you instantly knock down all the  walls – the creeds, the gender, age and race differences, everything. You’re all one at  that point, lifting your voices.” – Bobby McFerrin\nIf you love to sing, you are welcome to join Circlesongs with Bobby McFerrin, hosted by David Worm \u0026 Motion, for a singing session full of joy-filled improvised music-making for  singers of all levels of experience. Every Monday at noon for ninety minute at the wonderful Freight  \u0026 Salvage in Berkeley.\nBobby first developed Circlesongs in his now legendary solo a cappella performances, when he needed  other voices to help manifest his musical ideas. He gave the audience parts to sing, layering harmonies  and rhythms, using call and response, conducting and composing his spontaneous inventions. During  his years of worldwide touring, he evolved a variety of vocal groups beginning in the ‘80’s with his Bay  Area based group Voicestra. \nBobby’s Circlesongs concerts celebrated all the kinds of music that would spontaneously emerge from  anywhere in his stream-of-consciousness, like maybe from Americana or classical, R\u0026B, gospel, folk,  pop, rock, beatboxing—combined with any sound he could imagine. For Bobby, Circlesongs is not a concert or a performance… it is a service to create a singing space that is without words, genres or pre existing knowledge. There is a place in the circle for everyone. \nThese sessions will be hosted by David Worm, an original member of both Bobby’s Voicestra and  Gimme5, and a diversely gifted team of celebrated Bay Area singers. Including Bryan Dyer, Destani  Wolf, Tammi Brown and others. Bobby has recently moved back to San Francisco from Philadelphia  and is really excited to begin to create with these wonderful singers. \n“Bobby McFerrin’s greatest gift to his audience may be changing them from spectators  into celebrants and transforming a concert hall into a playground, a village center, a  joyous space.” – Los Angeles Times \nBobby McFerrin is an inspiration to singers around the world who celebrate his innovative technique  and spirit. His solo performances and collaborations with great artists—including Yo-Yo Ma, Chick  Corea, and the Vienna Philharmonic—are the stuff of legend. Along the way, there were 10 Grammy  Awards and a #1 global hit “Don’t Worry, Be Happy.” bobbymcferrin.com \n“Bobby McFerrin is an artist whose blinding originality has set him on a course that has  no maps but is awash with possibilities lurking in every curve of the road… sheer joy in  the elemental beauty of the voice… celebrates music as a primal essence, as crucial to  our sense of ourselves as breathing” – The Irish Times"},{"date":"2022-05-24T00:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2022/02/19115155/RayEdlund.jpg","title":"Ray Fest:\nhonoring Ray Edlund hanging up the microphone\nafter hosting Pig in a Pen on KPFA for 48 years","url":"https://secure.thefreight.org/11252/ray-fest","details":"Featuring:\n\nLaurie Lewis and Kathy Kallick\nThompsonia\nHigh Country\nThe Road Oilers\nHigh Water Line\nNorth Country Blue"},{"date":"2022-05-25T00:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2021/11/07101614/Barbaro-1.jpg","title":"Barbaro","url":"https://secure.thefreight.org/10876/barbaro","details":"Barbaro's musical vision explores their collective life experiences through intricate instrumentation, creatively bending traditional music into a style that is all their own.  The Minneapolis-Winona based rising stars have created their eclectic sound through original songwriting craft, with inspiration derived from bluegrass, jazz, and chamber music.  Their new album, Dressed in Roses, released January 2020, \"Stands as a true testament to their musical identity and the sound that has launched one of the Midwest's most in-demand acoustic acts.\"\nWebsite | Facebook"},{"date":"2022-05-26T00:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2022/02/12095133/DAVID-BROMBERG.jpg","title":"David Bromberg Quintet +1","url":"https://secure.thefreight.org/11211/david-bromberg-quintet-26","details":"With his 1971 self-titled Columbia Records release, David Bromberg emerged as the wunderkind of American roots music. The disc’s compelling blend of traditional and original material, virtuosic musicianship and iconic cover art trumpeted the arrival of a new artist possessed of audacious and uncompromising vision. Over the course of four albums for Columbia and five for Fantasy Records, and through associations with artists like Bob Dylan, Jerry Jeff Walker, John Hartford, George Harrison, the Grateful Dead, Emmylou Harris and Bonnie Raitt, Bromberg’s reputation, repertoire and following grew exponentially. However, the incessant demands of touring finally brought the band’s recordings and shows to an end in the early 1980’s.\n\nThe twenty-two year drought ended in 2006 with the release of the Grammy-nominated solo effort Try Me One More Time. Gradually tour dates were added and bandmembers assembled as David, in 2011, followed up Try Me with Use Me, a typically unorthodox Brombergian effort, partnering him with some of the most celebrated names in music – Linda Ronstadt, Vince Gill, Los Lobos, Dr John, Keb’ Mo, John Hiatt, Levon Helm and others – whom David asked to either write or choose songs and then produce him doing them.\n\nTwo more albums emerged from 2013 to 2017, Only Slightly Mad and The Blues the Whole Blues and Nothing But the Blues, both produced by three-time Grammy winner Larry Campbell. Recorded at Levon Helm’s Barn, Only Slightly Mad brought the band back to David’s eclectic ‘kitchen sink’ musical philosophy, while with The Whole Blues, David upheld Texas fiddler Johnny Gimbel’s claim that: “There are only two songs – the Star-Spangled Banner and the Blues.” The band skipped over the ‘Banner’ and headed straight for the blues, winning the 2017 Downbeat Critic’s Poll for Best Blues Album.\n\nEventually David’s band settled into its current lineup of Mark Cosgrove (guitar, mandolin, vocals), Nate Grower (fiddle, mandolin, guitar, vocals), Josh Kanusky (drums, vocals) and newest member, Suavek Zaniesienko (bass, vocals). This nucleus has performed hundreds of shows together, traversing thousands of miles, across the US \u0026 Canada to Europe, Japan and Australia. With the group having attained a high level of musical telepathy, they entered the studio in mid 2019 for a slightly different approach to record making...\nDavid Bromberg will be adding a sixth member to his ‘quintet' for the upcoming shows at the Freight, keyboardist Dan Walker.\n\nThe new album, Big Road, will give Bromberg fans the most intimate portrait to date of David and the band, musically and visually. Featuring twelve new tracks, five hi def performance videos and a mini documentary detailing the album’s creation, it will be released in three formats: traditional CD, a gatefold vinyl album and a CD/DVD combo pack. In an age where recorded music has been devalued and relegated to a digital stream for smart phones, Big Road returns the listener to the golden age of record making, when enjoying an album was a tactile, visual and auditory experience. Joining David’s core band are keyboardist extraordinaire Dan Walker on piano, organ and accordion, a stellar horn section of Bromberg regulars like Birch Johnson (trombone), Jon-Erik Kellso (trumpet), Matt Koza (tenor sax) and Bob Stewart (tuba) with Larry Campbell on mandolin and pedal steel.\n\nWe think you’ll agree that traveling the David Bromberg Band’s Big Road is a trip work taking.\nWebsite | Facebook"},{"date":"2022-05-27T00:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2022/02/12095133/DAVID-BROMBERG.jpg","title":"David Bromberg Quintet +1","url":"https://secure.thefreight.org/11211/david-bromberg-quintet-27","details":"With his 1971 self-titled Columbia Records release, David Bromberg emerged as the wunderkind of American roots music. The disc’s compelling blend of traditional and original material, virtuosic musicianship and iconic cover art trumpeted the arrival of a new artist possessed of audacious and uncompromising vision. Over the course of four albums for Columbia and five for Fantasy Records, and through associations with artists like Bob Dylan, Jerry Jeff Walker, John Hartford, George Harrison, the Grateful Dead, Emmylou Harris and Bonnie Raitt, Bromberg’s reputation, repertoire and following grew exponentially. However, the incessant demands of touring finally brought the band’s recordings and shows to an end in the early 1980’s.\n\nThe twenty-two year drought ended in 2006 with the release of the Grammy-nominated solo effort Try Me One More Time. Gradually tour dates were added and bandmembers assembled as David, in 2011, followed up Try Me with Use Me, a typically unorthodox Brombergian effort, partnering him with some of the most celebrated names in music – Linda Ronstadt, Vince Gill, Los Lobos, Dr John, Keb’ Mo, John Hiatt, Levon Helm and others – whom David asked to either write or choose songs and then produce him doing them.\n\nTwo more albums emerged from 2013 to 2017, Only Slightly Mad and The Blues the Whole Blues and Nothing But the Blues, both produced by three-time Grammy winner Larry Campbell. Recorded at Levon Helm’s Barn, Only Slightly Mad brought the band back to David’s eclectic ‘kitchen sink’ musical philosophy, while with The Whole Blues, David upheld Texas fiddler Johnny Gimbel’s claim that: “There are only two songs – the Star-Spangled Banner and the Blues.” The band skipped over the ‘Banner’ and headed straight for the blues, winning the 2017 Downbeat Critic’s Poll for Best Blues Album.\n\nEventually David’s band settled into its current lineup of Mark Cosgrove (guitar, mandolin, vocals), Nate Grower (fiddle, mandolin, guitar, vocals), Josh Kanusky (drums, vocals) and newest member, Suavek Zaniesienko (bass, vocals). This nucleus has performed hundreds of shows together, traversing thousands of miles, across the US \u0026 Canada to Europe, Japan and Australia. With the group having attained a high level of musical telepathy, they entered the studio in mid 2019 for a slightly different approach to record making...\nDavid Bromberg will be adding a sixth member to his ‘quintet' for the upcoming shows at the Freight, keyboardist Dan Walker.\n\nThe new album, Big Road, will give Bromberg fans the most intimate portrait to date of David and the band, musically and visually. Featuring twelve new tracks, five hi def performance videos and a mini documentary detailing the album’s creation, it will be released in three formats: traditional CD, a gatefold vinyl album and a CD/DVD combo pack. In an age where recorded music has been devalued and relegated to a digital stream for smart phones, Big Road returns the listener to the golden age of record making, when enjoying an album was a tactile, visual and auditory experience. Joining David’s core band are keyboardist extraordinaire Dan Walker on piano, organ and accordion, a stellar horn section of Bromberg regulars like Birch Johnson (trombone), Jon-Erik Kellso (trumpet), Matt Koza (tenor sax) and Bob Stewart (tuba) with Larry Campbell on mandolin and pedal steel.\n\nWe think you’ll agree that traveling the David Bromberg Band’s Big Road is a trip work taking.\nWebsite | Facebook"},{"date":"2022-05-28T00:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2021/11/07095855/Suzy-Bogguss.jpg","title":"Suzy Bogguss","url":"https://secure.thefreight.org/10871/suzy-bogguss","details":"Grammy award-winning and Platinum selling artist Suzy Bogguss is one to chase the muse wherever it may lead. She has covered Country, Swing, Jazz, Folk, Americana and Roots music with style and grace. \nDuring the creative explosion that was country music in the 1990s Suzy Bogguss sold 4 millions records with sparkling radio hits like “Outbound Plane”, “Someday Soon”, “Letting Go” and “Drive South”. \n \nSuzy’s 2015 album Lucky was a heartfelt homage to the songwriting of Merle Haggard. Some may recall she kicked off her career with 1989's \"Somewhere Between,\" her debut album named after one of Haggard's early songs. With Lucky, Bogguss dove deeper into Haggard's catalog, taking care to hold on to that original vision of finding songs that resonated with her not just pulling out and recycling the hits. The result is a modern record with a classic vibe. Merle happily gave her the big thumbs and Suzy embarked on two years of non-stop touring in support of the album.\n \nRolling Stone magazine included her in The Top 48 Things We Saw at SXSW two consecutive years in a row. In Fall 2016 she released Aces: Redux, to commemorate the 25th Anniversary of the original release. The “redux” is a complete re-recording of her Platinum-selling album with fresh instrumentation and vocals to not only highlight the timelessness of the songs in this collection but also to highlight who she is as an artist today. \nThe live performance - which includes her hits and choice material from her critically acclaimed albums - has been lauded by fans, critics and buyers as \"a show not to miss!” Suzy's appeal has never wavered and her fan base continues to grow with constant touring around the globe.\nSince 2017, Suzy has also been touring as one of three “Chicks With Hits”, a show that also features Pam Tillis and Terri Clark. She also performs yearly holiday shows in select markets with her band or trio. \nSuzy Bogguss truly is an artist that knows no boundaries and one who always leaves everyone wondering what she’ll do next!\n\nWebsite | Facebook"},{"date":"2022-05-29T00:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2022/02/30095323/JimKweskinSuzyThompsonMeredithAxelrod.jpg","title":"Jim Kweskin \u0026 Friends\nwith Meredith Axelrod \u0026 Suzy Thompson","url":"https://secure.thefreight.org/11132/jim-kweskin","details":"with Meredith Axelrod \u0026 Suzy Thompson\nJim Kweskin is the founder of the legendary 1960s Jim Kweskin Jug Band with Fritz Richmond, Geoff Muldaur, Maria Muldaur, Mel Lyman and Bruno Wolfe. During the five years they were together, they successfully transformed the sounds of pre-World War II rural music into a springboard for their good-humored performances. Their imitators were legion, including a San Francisco jug band that became the Grateful Dead, a Los Angeles jug band that became the Nitty Gritty Dirt Band, and a New York jug band that became the Lovin' Spoonful. No other group attained their unique blend of youthful energy and antiquarian expertise, tight musicianship, loose camaraderie, and infectious swing.\n\nThese days Jim is best known as a singer and bandleader, but he also created one of the bedrock guitar styles of the folk revival, adapting the ragtime-blues fingerpicking of artists like Mississippi John Hurt and Pink Anderson to the more complex chords of pop and jazz. He has maintained a remarkably consistent musical vision since his jug band days, continuing to explore traditional folk and blues with the sophisticated sensibility of a jazz musician, and jazz with the communal simplicity of a folk artist. He has recorded many solo ventures, as a member of the U and I band, with band-mate Geoff Muldaur, with Samoa Wilson, with The Texas Sheiks as well as performing and recording with a wide variety of well-known musicians such as Maria Muldaur, John Sebastian, David Grisman, Cindy Cashdollar, Happy Traum, Meredith Axelrod, Juli Crockett and Samoa Wilson, to name a few.\n\nJim Kweskin's shows radiate charm, humor, sophistication and talent. Jim sings a collection of familiar songs by Benny Goodman, Johnny Mercer, the Sons of the Pioneers, Fats Waller, and Somethin' Smith \u0026 the Redheads. There's an endearing sense of good humor to Kweskin's interpretations that makes his performances a delight. Because of his vast repertoire and love of the music, Kweskin is recognized as one of the best interpreters of the great American songbook.\nWebsite | Facebook"},{"date":"2022-05-31T00:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2021/08/27125408/KakiKing.jpg","title":"Kaki King","url":"https://secure.thefreight.org/871/modern-yesterdays","details":"Known as one of the greatest guitar innovators of our time, Kaki King presents MODERN YESTERDAYS, a refinement of her now signature guitar-projection mapping performance. With technicolor imagination, technical wizardry, and carefully choreographed guitar and drum playing, “she’ll do the unexpected, every time” (Digital Trends). Bridging future-forward modernity with contemplative longing, MODERN YESTERDAYS sends us on an audiovisual journey reset by our recent past, arriving at the emotional place we yearn to visit.\n\nThe album Modern Yesterdays (released in late 2020 on Cantaloupe Music) derives broadly from the music composed for Data Not Found (DNF), Kaki King’s largest-scale and most theatrical performance piece yet. With the post-pandemic performance world ever-evolving, Kaki King set out to create an analog to Data Not Found, which can now be found in MODERN YESTERDAYS: an interlocking puzzle piece nimble enough to tour the world in 2021, and beyond.\n\n**In Data Not Found, numerous projection sources, an enormous tent, and 1000 pounds of sand were set to tell a story about the traces of things we leave behind in this world.** Unfortunately, the show’s production came to a halt in March 2020 due to the COVID-19 lockdown.\nWebsite | Facebook"},{"date":"2022-06-01T00:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2021/08/31061918/TheMoth.jpg","title":"The Moth StorySLAM - BIRTHDAYS","url":"https://secure.thefreight.org/837/the-moth-jun","details":"The Moth StorySLAM - BIRTHDAYS\nPrepare a five-minute story about a celebration. Once a year, for better or worse. Party hats, blowing out the candle, opening the gifts, or weeping in solitude, wondering where all the years have gone.\nSince its launch in 1997, The Moth has presented thousands of stories told live and without notes.\nMoth shows are renowned for the great range of human experience they showcase. Each show starts with a theme, and the storytellers explore it, often in unexpected ways. Since each story is true and every voice authentic, the shows dance between documentary and theater, creating a unique, intimate, and often enlightening experience for the audience.\nThe Moth was founded by the novelist George Dawes Green, who wanted to recreate in New York the feeling of sultry summer evenings in his native Georgia, when moths were attracted to the light on the porch where he and his friends would gather to spin spellbinding tales. The first New York Moth event was held in George’s living room and the story events quickly spread to larger venues throughout the city.\nThrough ongoing programs in more than 29 cities, The Moth has presented over 30,000 stories to standing-room-only crowds worldwide and it currently produces more than 500 live shows each year. Additionally, The Moth runs storytelling workshops for high school students and adults in underserved communities through their Education and Community Programs.\nThe Moth has an enthusiastic following for all of its content. The Moth podcast is downloaded more than 50 million times a year, and each week, the Peabody Award-winning Moth Radio Hour is heard on over 480 radio stations worldwide. The Moth’s first book, The Moth: 50 True Stories was a NYT Bestseller and its newest book, All These Wonders: True Stories About Facing the Unknown was released March, 2017."},{"date":"2022-06-02T00:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2022/01/22081336/LittleVillageFoundation.jpg","title":"Little Village Presents 5 World Premieres","url":"https://secure.thefreight.org/11254/little-village-presents","details":"Deshawn Hickman/Charlie Hunter *\nSacred Steel from Greensboro NC produced and performed along with Charlie Hunter\nDiunna Greenleaf  * \nAward winning Houston Blues chanteuse\nMarina Crouse  *   \nSung in Spanish w/ songs originally performed by Eydie Gormé \nMaurice Tani \nHe will host and also share some of his new songs       \nRome Yamilov/Henry Kaiser  *   \n2 generations of avant garde guitar in a musical exploration of blues legend JB Lenoir.\nMike Schermer   *\nMarcia Ball to Bruce Springsteen (Big Sister's Radio) have noted his songwriting prowess\n*= record release and maiden performance or premiere live performance\nAlthough Maurice has a new cd it won't be released until July/August hence the 6 acts - 5 \"world premieres\"\nAll new recordings will be available for purchase that evening.\n  Little Village is a 501c3 nonprofit record company that seeks to shine the light of awareness on musicians who might not otherwise be heard and in doing so further the belief that a life filled with diverse music builds empathy making for stronger communities and a better world."},{"date":"2022-06-03T00:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2022/02/04160050/eilenjewell.jpg","title":"Eilen Jewell","url":"https://secure.thefreight.org/11189/eilen-jewell","details":"American Songwriter describes Eilen Jewell as one of America's most intriguing, creative and idiosyncratic voices. The Boise, Idaho songwriter leads a tight quartet that blends influences of surf-noir, early blues, classic country, folk, and 1960s era rock ’n’ roll. For well over a decade, they’ve toured relentlessly for legions of fans from Boston to Boise and Madrid to Melbourne, playing large festivals, theaters, rock clubs, and coffeehouses. The group has shared stages with the likes of Lucinda Williams, Loretta Lynn, Mavis Staples, Wanda Jackson, George Jones, Emmylou Harris, and Blind Boys of Alabama. Eilen’s fans have marveled at her warmth and onstage humor alongside her beautiful songs and fiery performances. In addition to six of her own full-length albums, Jewell has released two albums with her country-gospel side-project, the Sacred Shakers; a tribute album to Loretta Lynn titled Butcher Holler; and a recent album of rare blues covers, Down Hearted Blues.\nThe Los Angeles Daily News said, “Sometimes as darkly damaged as Lucinda Williams, at others as defiant and teasing as prime Peggy Lee and always authentically Americana in the Gillian Welch tradition … She’s mighty good.”  \nWebsite | Facebook"},{"date":"2022-06-04T00:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2022/03/16110605/Y-La-Bamba.jpg","title":"Y La Bamba","url":"https://secure.thefreight.org/11356/y-la-bamba","details":"DANCE FLOOR OPEN\n\nY La Bamba has been many things, but at the heart of it is singer-songwriter Luz Elena Mendoza’s inquisitive sense of self. Their fifth record, Mujeres, carries on the Portland-based band’s affinity for spiritual contemplation, but goes a step further in telling a story with a full emotional spectrum. Coming off Ojos Del Sol, one of NPR’s Top 50 Albums of 2016, Mujeres exhibits the scope of Mendoza’s artistic voice like never before. “Soy como soy,” Mendoza says, and that declaration is the bold— even political— statement that positions Mujeres to be Y La Bamba’s most unbridled offering yet.\n\nThe record exists in the post-2016 landscape of a national identity crisis, and Mendoza explores what it means to be a Mexican American woman by leading us through places we are afraid to go. Mujeres ventures in to the discomfort of the stories we tell ourselves. Those of our past, our futures. We all have these stories somewhere inside of us, but with Y La Bamba, Mendoza forges new narratives from old stories of heritage and family, tracing history while forging modern chicana feminism.\n\n“Music is an extension of everything I have inside. It’s how I emote,” Mendoza says. The raw honesty of Mujeres is in fact the raw honesty of Mendoza. Armed with the emotionality of traditional música mexicana and the storytelling of American folk, Y La Bamba’s artistry is not just their musical ability but Mendoza’s search for unadulterated truth. It is in an ancestral, spiritual journey in which Mendoza comes to terms with the influence and limitations of her upbringing. Mendoza’s experience of childhood summers in the San Joaquin Valley listening to mariachi, of being raised strict Catholic by immigrant parents, of being a woman having to prove herself to the boys, paints strokes of both melancholy and healing on the tracks. “From the way that my family struggles, to the way they shoot the shit… it’s so different from whiteness,” Mendoza says. “It’s a different dimension.”\n\nY La Bamba exists in the dimension of the Mexican American imagination: somewhere cynical and optimistic at the same time. While there is a celebration of the Mexican creativity that has informed Mendoza’s life, there is a darker side to reconcile with. Where do mujeres fit in to the American story? What are the sins for which we are all guilty? How do different generations interact with the world? How can a culture become visible without tokenization? It is no surprise that in Mujeres, Y La Bamba’s first record with Mendoza at the helm of production, Mendoza contemplates these questions to tell her story. But it is not just Mendoza’s story. Challenging a narrative and dealing with the emotionality of that effort— that is everyone’s story.\n\nMujeres was recorded by Luz Elena Mendoza and Ryan Oxford at Color Therapy Studios and Besitos Fritos Studios in Portland, Oregon. Mixed by Jeff Bond, with Grace Bugbee on bass, John Niekrasz on drums, Margaret Wher Gibson on keys, and Ed Rodriguez and Ryan Oxford on electric guitar. \nWebsite | Facebook"}]