[{"date":"2022-05-06T20:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2022/02/12093234/Makana.jpg","title":"Makana\nThe Gift of Slack Key Guitar","url":"https://secure.thefreight.org/11209/makana","details":"With his intricate guitar playing featured on three Grammy-nominated albums, including the soundtrack of the Academy-Award winning film “The Descendants”, internationally renowned guitarist and vocalist Makana has earned recognition as a master of Hawaiian slack key guitar. Hailed for his electrifying performance style, the New York Times calls him “dazzling”, Makana has shared the stage with top music stars such as Jason Mraz and Jack Johnson, and opened for legends including Sting, Carlos Santana and Elvis Costello. He performs at leading venues worldwide, including the White House.\n\nBack by popular demand, Makana invites audiences on an uplifting tribute to slack key stylings, in which guitar strings are strategically loosened to produce a wholly unique sound. His anticipated show will dive into the rich history, amusing stories and breathtaking melodies of Hawaii’s distinct slack key guitar traditions. Celebrating the famous masters who shaped this style, including his legendary mentor Sonny Chillingworth, Makana will share songs, stories and insights spanning ancient to contemporary that illuminate these groundbreaking artists’ musicality and humor.\nWebsite | Facebook"},{"date":"2022-05-09T12:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2021/06/24082841/Bobby-McFerrin.jpg","title":"Bobby McFerrin\nCirclesongs\nHost: David Worm \u0026 Motion","url":"https://secure.thefreight.org/10848/11377","details":"“You get people together and get them singing, and you instantly knock down all the  walls – the creeds, the gender, age and race differences, everything. You’re all one at  that point, lifting your voices.” – Bobby McFerrin\nIf you love to sing, you are welcome to join Circlesongs with Bobby McFerrin, hosted by David Worm \u0026 Motion, for a singing session full of joy-filled improvised music-making for  singers of all levels of experience. Every Monday at noon for ninety minute at the wonderful Freight  \u0026 Salvage in Berkeley.\nBobby first developed Circlesongs in his now legendary solo a cappella performances, when he needed  other voices to help manifest his musical ideas. He gave the audience parts to sing, layering harmonies  and rhythms, using call and response, conducting and composing his spontaneous inventions. During  his years of worldwide touring, he evolved a variety of vocal groups beginning in the ‘80’s with his Bay  Area based group Voicestra. \nBobby’s Circlesongs concerts celebrated all the kinds of music that would spontaneously emerge from  anywhere in his stream-of-consciousness, like maybe from Americana or classical, R\u0026B, gospel, folk,  pop, rock, beatboxing—combined with any sound he could imagine. For Bobby, Circlesongs is not a concert or a performance… it is a service to create a singing space that is without words, genres or pre existing knowledge. There is a place in the circle for everyone. \nThese sessions will be hosted by David Worm, an original member of both Bobby’s Voicestra and  Gimme5, and a diversely gifted team of celebrated Bay Area singers. Including Bryan Dyer, Destani  Wolf, Tammi Brown and others. Bobby has recently moved back to San Francisco from Philadelphia  and is really excited to begin to create with these wonderful singers. \n“Bobby McFerrin’s greatest gift to his audience may be changing them from spectators  into celebrants and transforming a concert hall into a playground, a village center, a  joyous space.” – Los Angeles Times \nBobby McFerrin is an inspiration to singers around the world who celebrate his innovative technique  and spirit. His solo performances and collaborations with great artists—including Yo-Yo Ma, Chick  Corea, and the Vienna Philharmonic—are the stuff of legend. Along the way, there were 10 Grammy  Awards and a #1 global hit “Don’t Worry, Be Happy.” bobbymcferrin.com \n“Bobby McFerrin is an artist whose blinding originality has set him on a course that has  no maps but is awash with possibilities lurking in every curve of the road… sheer joy in  the elemental beauty of the voice… celebrates music as a primal essence, as crucial to  our sense of ourselves as breathing” – The Irish Times"},{"date":"2022-05-09T19:30:00.000+00:00","img":"https://cdn.thefreight.org/assets/2021/07/16090225/MNCMS.jpeg","title":"Classical at the Freight: Monday Night Chamber Music Society","url":"https://secure.thefreight.org/606/mncms","details":"Classical at the Freight\nGreat chamber music, up close and personal.  Join San Francisco Chamber Orchestra Music Director and violist Ben Simon for your monthly fix of classical masterpieces.  These friendly and accessible 75-minute programs feature SFCO All-Stars and special guests in the intimate “chamber” of Berkeley’s iconic Freight and Salvage.  \nMonday Night Chamber Music Society\nHrabba Atladottir \u0026 Liana Bérubé, violins\nStephanie Ng \u0026 Ben Simon, violas\nMichael Graham, cello\nFive San Francisco Chamber Orchestra All-Stars team up for their annual program of viola quintets; no, that’s not five violas but rather a string quartet enhanced by a second violist.  Masterpieces by Mozart and Brahms. \nWebsite | Facebook"},{"date":"2022-05-10T20:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2021/12/13130623/AARON-LEE-TASJAN-CURTIS-WAYNE-MILLARD-JET-CRAFT-FOLD-OUT-191A0070.jpg","title":"Aaron Lee Tasjan","url":"https://secure.thefreight.org/11023/aaron-lee-tasjan","details":"Jesse Daniel Edwards opens\nTasjan! Tasjan! Tasjan!, the new album from Aaron Lee Tasjan, a genre-bending rising star who’s bold reimagination of classic sounds and songwriting has established him as one of the most idiosyncratic artists of his generation.\nHis self-titled fourth album is a masterclass in interstellar pop, vintage glam, 90s Anglophilia and experimental and psychedelic rock \u0026 roll. Irreverent lyrics may show Tasjan with his tongue in his cheek, but Tasjan! Tasjan! Tasjan! is an album with something to say. His autobiographical lyrics reflect on self-acceptance, expose his own contradictions and offer a unique self-deprecating critique on the millennial generation’s simultaneous capacity for great empathy and narcissism. The album also explores notions of mental health, identity and sexuality and is dedicated to the alternative kids who also felt “other” growing up.\nTasjan has been on a shapeshifting musical journey his whole life. From his glam rock roots, when Jimmy Iovine told him “guys in make-up don’t sell records” and Lady Gaga would open for his band in NYC, to his legend-hopping guitar sideman days, where he played with everyone from The New York Dolls to Sean Lennon and traveled the globe, collecting road war tales from doing mushrooms with Bono to twitter spats with Peter Frampton.\nWebsite | Facebook\n\n\nJesse Daniel Edwards is an acclaimed songwriter hailing from the small mountain town of Cuyamaca, CA (pop. 60). As a child, Jesse and his 6 siblings grew up without television, internet, or significant exposure to the outside world. He spent his time learning to sing harmony to gospel tracks and tinkering on hand-me-down instruments with his grandpa. Leaving home at 16, he spent his late teen years busking on street corners around the US and abroad. He eventually grew to perform upon the festival and university circuits full-time after a chance encounter with Al Bunetta (Oh Boy Records), sharing the stage with Morrissey, Lucinda Williams, and John Prine. His songs have been featured in radio, TV, streaming movies, video games, and film. Website | Soundcloud"},{"date":"2022-05-11T20:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2022/03/04101316/RushadEggleston-2.jpg","title":"Rushadicus","url":"https://secure.thefreight.org/10886/rushadicus","details":"Rushad Eggleston, a.k.a. Rushadicus, is a mystical realm-hopping jester of infinite glee, whose unprecedented extremely fast bouncy cello style blows minds of all kinds.  A charming entertainer with unbridled passion, his joy is so contagious that many showgoers complain of sore facial muscles afterwards (the name Rushad means “joyful soul”).\nA whimsically adventurous sense of melody shines through in all shades \u0026 styles on any of the many instruments Rushad bejicks “to keep it fresh”.  Sometimes he reads mystical poetry in his own language, speaks in tongues, channels aliens, throat-sings, beat-boxes, or does skits as different characters such as Negative Ralph, Country Bob, The Goblin, or Guru Fafa which he has a right to embody because of his half-indian heritage.\nSomewhat of an acrobat, Rushad can spin on one leg, hang upside down, do splits, play in plough pose, and catch flying fruits in his mouth while playing fast intricate cello rhythms.  A distinguished flatpicker, his innovation and skill are admired by many guitar luminaries. Although some of his music is avant garde and experimental (he has an amazing deathmetal cat-voice), he is an expert at making personal anthems to those for which he is playing.\nWebsite | Facebook"},{"date":"2022-05-12T19:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2022/03/08092640/VieuxDeNiafunke%CC%81.jpg","title":"Vieux de Niafunké: Sharing Culture Through Music","url":"https://secure.thefreight.org/11333/vieux-de-niafunke","details":"Media1044 and Ian Campbell are proud to announce the release of Vieux de Niafunké, a full length documentary featuring the life and music of Vieux Farka Touré, arguably the greatest African guitarist of his generation.\n\nThe film follows Vieux from his home in Mali on a tour du monde that is a visual and sonic feast. Exploring the influence of Vieux’slegendary father, Ali Farka Touré, the documentary examines Vieux’s evolution as a musician and cultural ambassador in his own right. Vieux continues to break boundaries, moving seamlessly between blues, funk, reggae and rock music. His passion for music is clear, “You can’t choose music to be a job. Music has to choose you. To make people happy is why I’m here – it’s what I have to do,” says Vieux.\n\nVieux is an anti-celebrity who, despite worldwide fame, stays true to his roots and close to his family in Niafunke, the wind-swept, sun-baked, mud-toned village he grew up in on the Niger River. With interviews with super-producer Nick Gold and Matthew McConaughey (he’s a fan), it's a story of community, family, love, peace, resilience, and the transcendent power of music. The film features many amazing live performances by Vieux and features interviews with musicians such as; Toumani Diabaté, Sidiki Diabaté, Idrissa Soumaoro, Will Calhoun, Habib Koité, Idan Raichel, and many more.\n\nFor the film’s producer and director of photography, Ian Campbell, shooting a project like this is a  once-in-a-lifetime opportunity. “The cultural history in Vieux's music and the skill with which he plays, captures your attention and your heart,” says Campbell. “I'd like this documentary to communicate the feeling you get when you hear his music live.”\nWebsite | Facebook"},{"date":"2022-05-13T20:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2021/06/18080755/VieuxFarkaToure.jpg","title":"Vieux Farka Touré","url":"https://secure.thefreight.org/893/vieux-farka-toure","details":"Often referred to as “The Hendrix of the Sahara”, Vieux Farka Touré was born in Niafunké, Mali in 1981. He is the son of legendary Malian guitar player Ali Farka Touré, who died in 2006. Ali Farka Touré came from a historical tribe of soldiers, and defied his parents in becoming a musician. When Vieux was in his teens, he declared that he also wanted to be a musician. His father disapproved due to the pressures he had experienced being a musician. Rather, he wanted Vieux to become a soldier. But with help from family friend the kora maestro Toumani Diabaté, Vieux eventually convinced his father to give him his blessing to become a musician shortly before Ali passed.\nVieux was initially a drummer / calabash player at Mali’s Institut National des Arts, but secretly began playing guitar in 2001. Ali Farka Touré was weakened with cancer when Vieux announced that he was going to record an album. Ali recorded a couple of tracks with him, and these recordings, which can be heard on Vieux’s debut CD, were amongst his final ones. It has been said that the senior Touré played rough mixes of these songs when people visited him in his final days, at peace with, and proud of, his son’s talent as a musician.\nWebsite | Facebook | Twitter | Instagram | YouTube"},{"date":"2022-05-14T19:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2022/02/12094429/CrisWilliamson2022.jpg","title":"Cris Williamson Album Release Celebration of Harbor Street","url":"https://secure.thefreight.org/10828/cris-williamson-514","details":"Celebrating the release of her new album, Harbor Street, Cris and friends will bring us this new music, twelve originals, mostly composed during the pandemic and recorded right here in Berkeley at Opus Studios. Featuring the fiddle playing and vocals of Laurie Lewis, the fiddle and keyboards and vocals of Barbara Higbie, the bass playing of Dewayne Pate, the electric guitar of James Deprato, accordion and keys and vocals of Julie Wolf, and the rich cello sounds of Mia Pixley, this family ensemble will astound and surround the sound of this new music.\n\n\"One big bright spot, for me these days - is that I will be able to play these new songs for you - live and in person - for a celebration of the release of my new cd, Harbor Street. I’m so excited for you to hear them. May it be so.\" - Cris\nWebsite | Facebook\nphoto credit: Steve Keyser"},{"date":"2022-05-16T12:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2021/06/24082841/Bobby-McFerrin.jpg","title":"Bobby McFerrin\nCirclesongs\nHost: David Worm \u0026 Motion","url":"https://secure.thefreight.org/10848/11378","details":"“You get people together and get them singing, and you instantly knock down all the  walls – the creeds, the gender, age and race differences, everything. You’re all one at  that point, lifting your voices.” – Bobby McFerrin\nIf you love to sing, you are welcome to join Circlesongs with Bobby McFerrin, hosted by David Worm \u0026 Motion, for a singing session full of joy-filled improvised music-making for  singers of all levels of experience. Every Monday at noon for ninety minute at the wonderful Freight  \u0026 Salvage in Berkeley.\nBobby first developed Circlesongs in his now legendary solo a cappella performances, when he needed  other voices to help manifest his musical ideas. He gave the audience parts to sing, layering harmonies  and rhythms, using call and response, conducting and composing his spontaneous inventions. During  his years of worldwide touring, he evolved a variety of vocal groups beginning in the ‘80’s with his Bay  Area based group Voicestra. \nBobby’s Circlesongs concerts celebrated all the kinds of music that would spontaneously emerge from  anywhere in his stream-of-consciousness, like maybe from Americana or classical, R\u0026B, gospel, folk,  pop, rock, beatboxing—combined with any sound he could imagine. For Bobby, Circlesongs is not a concert or a performance… it is a service to create a singing space that is without words, genres or pre existing knowledge. There is a place in the circle for everyone. \nThese sessions will be hosted by David Worm, an original member of both Bobby’s Voicestra and  Gimme5, and a diversely gifted team of celebrated Bay Area singers. Including Bryan Dyer, Destani  Wolf, Tammi Brown and others. Bobby has recently moved back to San Francisco from Philadelphia  and is really excited to begin to create with these wonderful singers. \n“Bobby McFerrin’s greatest gift to his audience may be changing them from spectators  into celebrants and transforming a concert hall into a playground, a village center, a  joyous space.” – Los Angeles Times \nBobby McFerrin is an inspiration to singers around the world who celebrate his innovative technique  and spirit. His solo performances and collaborations with great artists—including Yo-Yo Ma, Chick  Corea, and the Vienna Philharmonic—are the stuff of legend. Along the way, there were 10 Grammy  Awards and a #1 global hit “Don’t Worry, Be Happy.” bobbymcferrin.com \n“Bobby McFerrin is an artist whose blinding originality has set him on a course that has  no maps but is awash with possibilities lurking in every curve of the road… sheer joy in  the elemental beauty of the voice… celebrates music as a primal essence, as crucial to  our sense of ourselves as breathing” – The Irish Times"},{"date":"2022-05-16T20:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2022/04/04094522/FreightCommunitySingersTiffanyAustin-1-2.jpg","title":"Freight Singers Community Chorus with Special Guest Tiffany Austin","url":"https://secure.thefreight.org/11478/the-freight-community-chorus","details":"Freight Singers Community Chorus is a community chorus based at the Freight and Salvage, founded by Zoe Ellis and Bryan Dyer and currently led by Bryan Dyer and Tammi Brown. The chorus introduces singers to music from a variety of cultures inside the U.S. and around the world with an emphasis on traditional/roots music. \nThe Freight Singers Community Chorus will be joined by Special Guest Tiffany Austin."},{"date":"2022-05-17T20:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2021/12/06162052/RaulMalo.jpg","title":"Raul Malo of the Mavericks","url":"https://secure.thefreight.org/11036/raul-malo-17","details":"Annie Bosko opens\n\nRaul Malo is the incomparable frontman of genre-defying, GRAMMY Award-winning band The Mavericks, and the sole writer of many of their songs. His free-wheeling, swaggering style seamlessly blends neotraditional country, rock ’n roll, and Latin rhythmic fervor, and prominently features his lush, soaring baritone. His compositional craftsmanship includes penning progressive and timeless hits like “Here Comes the Rain,” “What A Crying Shame”, “Dance The Night Away”, “Back In Your Arms Again”, and “All You Ever Do Is Bring Me Down.” From his earliest days, when his raucous sound broke ground at the punk clubs on Miami Beach nearly three decades ago, to now fronting The Mavericks on their 30th Anniversary World Tour, Malo has demonstrated an unfailing skill for getting people to groove.\nWebsite | Instagram | Facebook | Twitter | Spotify\n  Annie Bosko has earned well-deserved recognition in the music industry as a gifted singer, songwriter and performer.  Born and raised a farmer's daughter, and the middle of 5 children, Annie is no stranger to hard work and fighting for her voice to be heard.  At age 19, she left her home state of California and drove herself cross-country to Nashville to follow her calling. \nPassionate about using her voice and music to uplift those who need it most, Annie has woven universal themes of vulnerability and empowerment throughout her songs.  Annie’s natural talent and fearless stage presence enable her to authentically connect with audiences in diverse arenas.  Even though Annie’s music is country at heart, she seamlessly mixes in elements of pop and rock to create a unique sound that lends itself to a powerful live musical experience.\nWebsite | Facebook"},{"date":"2022-05-18T20:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2021/12/06162052/RaulMalo.jpg","title":"Raul Malo of the Mavericks","url":"https://secure.thefreight.org/11036/raul-malo-18","details":"Annie Bosko opens\n\nRaul Malo is the incomparable frontman of genre-defying, GRAMMY Award-winning band The Mavericks, and the sole writer of many of their songs. His free-wheeling, swaggering style seamlessly blends neotraditional country, rock ’n roll, and Latin rhythmic fervor, and prominently features his lush, soaring baritone. His compositional craftsmanship includes penning progressive and timeless hits like “Here Comes the Rain,” “What A Crying Shame”, “Dance The Night Away”, “Back In Your Arms Again”, and “All You Ever Do Is Bring Me Down.” From his earliest days, when his raucous sound broke ground at the punk clubs on Miami Beach nearly three decades ago, to now fronting The Mavericks on their 30th Anniversary World Tour, Malo has demonstrated an unfailing skill for getting people to groove.\nWebsite | Instagram | Facebook | Twitter | Spotify\n  Annie Bosko has earned well-deserved recognition in the music industry as a gifted singer, songwriter and performer.  Born and raised a farmer's daughter, and the middle of 5 children, Annie is no stranger to hard work and fighting for her voice to be heard.  At age 19, she left her home state of California and drove herself cross-country to Nashville to follow her calling. \nPassionate about using her voice and music to uplift those who need it most, Annie has woven universal themes of vulnerability and empowerment throughout her songs.  Annie’s natural talent and fearless stage presence enable her to authentically connect with audiences in diverse arenas.  Even though Annie’s music is country at heart, she seamlessly mixes in elements of pop and rock to create a unique sound that lends itself to a powerful live musical experience.\nWebsite | Facebook"},{"date":"2022-05-19T19:30:00.000+00:00","img":"https://cdn.thefreight.org/assets/2022/02/22092747/SFGMCHomoPhonicsLollipopGuild.jpg","title":"San Francisco Gay Men's Chorus\nFabulous \u0026 Forbidden Broadway","url":"https://secure.thefreight.org/11249/san-francisco-gay-mens-chorus","details":"This May, the San Francisco Gay Men's Chorus presents its two ensembles in Fabulous \u0026 Forbidden Broadway.  This hilarious and heart-stopping Broadway-themed concert is performed by the Chorus' beloved HomoPhonics and The Lollipop Guild. You will delight in lush vocal arrangements of Broadway classics and contemporary favorites, including Les Misérables, The Lion King, Wicked, Avenue Q, Dear Even Hansen, and many more.  This performance will be the first time ever that the Tony Award-winning musical review will be performed by a gay men's chorus!\nThe San Francisco Gay Men's Chorus was one of the first of its kind, and was the first to include \"gay\" unapologetically in their name. Fighting against discrimination and bigotry while losing countless loved ones to the AIDS epidemic, the San Francisco Gay Men's Chorus not only persevered themselves, but they inspired an LGBTQ+ choral movement worldwide.\nWebsite | Facebook"},{"date":"2022-05-20T20:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2022/02/12110904/foto-Niki-Jacobs-Band-Photo-credits-by-Milo-Dinkelaar-1038x576-1.jpg","title":"Niki Jacobs - The Ballad of Mauthausen","url":"https://secure.thefreight.org/11222/niki-jacobs","details":"\"The finest musical work about the Holocaust ever written.\" - Αντωνης Μποσκοιτης \nThe Ballad of Mauthausen features a Yiddish translation of the famous Mauthausen song cycle by composer Mikis Theodorakis.\nTheodorakis’ original composition was a cycle of four arias with lyrics based on poems written by Greek poet Iakovos Kambanellis, a survivor of the Nazi slave labor camp in Mauthausen, Upper Austria. Mauthausen was one of the most brutal Nazi concentration camps, where over half the inmates died simply as a result of the severe conditions, before 1940, when the Germans began systematically killing prisoners in gas chambers.\nSeveral years ago, Niki Jacobs, a world-renowned Yiddish singer, had the “Mauthausen” libretto translated into Yiddish – the language that most Jewish inmates of Mauthausen would have spoken – and the music was transcribed for her small but mighty ensemble. Theodorakis himself approved the project, which he both praised and supported. Jacobs has assembled an outstanding group of musicians, with roots in jazz, Balkan, klezmer, classical and improvised music, for the project. The musicians include Ro Krauss, viola/vocals; Peter van Os, accordion; Ruud Breuls, trumpet; and Emile Visser, cello.\nWebsite | Facebook"},{"date":"2022-05-21T20:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2022/02/18115625/YaelNaim.jpg","title":"Yael Naim","url":"https://secure.thefreight.org/11130/yael-naim","details":"The journey of self-discovery consumes every artist. That is certainly the case with Yael Naim, the Parisian-born, Franco-Israeli singer-songwriter.\nIn a career that has developed over the course of the last 20 years, the multi-instrumentalist and producer has been on a restless quest to create a sound world of her own across a string of increasingly absorbing albums – none more so than her latest offering, NightSongs.\nAs its title suggests, this is a hugely intimate album that sees her breaking away from the established way in which she makes music.\n \nHer last album, Older (released in 2015 and certified gold in France the following year) was co-produced with her husband David Donatien who also co-wrote four songs. Donatien was also co-produced and collaborated with her on her two previous offerings, She Was A Boy (2010) and her self-titled 2007 effort, both of which were credited to the pair. This time around, the songs are purely hers, arranged and produced solely by Yael.\n“I had this sense that I had different kinds of songs in me and I really wanted to see if they would work,” she says. “Everything started when I turned 39. I realized that I was probably half way through my life I wondered what I should be doing so I didn’t have any regrets. I realized I’d never dared create a musical project on my own - completely alone, with my moods, feelings and failings. I wanted to see what would come out of me and to work out who am I without the wonderful man, David, who has completed me so perfectly until now. A few months later, starting to record and conceive all these songs at night, I was surprised to actually find myself alone. Completely alone, indeed.\"\n“I also had a period of turbulence where everything seemed to shake around me, and I wanted to capture that in the music that I was making,” continues Yael. “The songs were darker and probably a bit deeper too.”\nWebsite | Facebook"},{"date":"2022-05-23T12:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2021/06/24082841/Bobby-McFerrin.jpg","title":"Bobby McFerrin\nCirclesongs\nHost: David Worm \u0026 Motion","url":"https://secure.thefreight.org/10848/11379","details":"“You get people together and get them singing, and you instantly knock down all the  walls – the creeds, the gender, age and race differences, everything. You’re all one at  that point, lifting your voices.” – Bobby McFerrin\nIf you love to sing, you are welcome to join Circlesongs with Bobby McFerrin, hosted by David Worm \u0026 Motion, for a singing session full of joy-filled improvised music-making for  singers of all levels of experience. Every Monday at noon for ninety minute at the wonderful Freight  \u0026 Salvage in Berkeley.\nBobby first developed Circlesongs in his now legendary solo a cappella performances, when he needed  other voices to help manifest his musical ideas. He gave the audience parts to sing, layering harmonies  and rhythms, using call and response, conducting and composing his spontaneous inventions. During  his years of worldwide touring, he evolved a variety of vocal groups beginning in the ‘80’s with his Bay  Area based group Voicestra. \nBobby’s Circlesongs concerts celebrated all the kinds of music that would spontaneously emerge from  anywhere in his stream-of-consciousness, like maybe from Americana or classical, R\u0026B, gospel, folk,  pop, rock, beatboxing—combined with any sound he could imagine. For Bobby, Circlesongs is not a concert or a performance… it is a service to create a singing space that is without words, genres or pre existing knowledge. There is a place in the circle for everyone. \nThese sessions will be hosted by David Worm, an original member of both Bobby’s Voicestra and  Gimme5, and a diversely gifted team of celebrated Bay Area singers. Including Bryan Dyer, Destani  Wolf, Tammi Brown and others. Bobby has recently moved back to San Francisco from Philadelphia  and is really excited to begin to create with these wonderful singers. \n“Bobby McFerrin’s greatest gift to his audience may be changing them from spectators  into celebrants and transforming a concert hall into a playground, a village center, a  joyous space.” – Los Angeles Times \nBobby McFerrin is an inspiration to singers around the world who celebrate his innovative technique  and spirit. His solo performances and collaborations with great artists—including Yo-Yo Ma, Chick  Corea, and the Vienna Philharmonic—are the stuff of legend. Along the way, there were 10 Grammy  Awards and a #1 global hit “Don’t Worry, Be Happy.” bobbymcferrin.com \n“Bobby McFerrin is an artist whose blinding originality has set him on a course that has  no maps but is awash with possibilities lurking in every curve of the road… sheer joy in  the elemental beauty of the voice… celebrates music as a primal essence, as crucial to  our sense of ourselves as breathing” – The Irish Times"},{"date":"2022-05-24T20:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2022/02/19115155/RayEdlund.jpg","title":"Ray Fest:\nhonoring Ray Edlund hanging up the microphone\nafter hosting Pig in a Pen on KPFA for 48 years","url":"https://secure.thefreight.org/11252/ray-fest","details":"Featuring:\n\nLaurie Lewis and Kathy Kallick\nThompsonia\nHigh Country\nThe Road Oilers\nHigh Water Line\nNorth Country Blue"},{"date":"2022-05-25T20:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2021/11/07101614/Barbaro-1.jpg","title":"Barbaro","url":"https://secure.thefreight.org/10876/barbaro","details":"Barbaro's musical vision explores their collective life experiences through intricate instrumentation, creatively bending traditional music into a style that is all their own.  The Minneapolis-Winona based rising stars have created their eclectic sound through original songwriting craft, with inspiration derived from bluegrass, jazz, and chamber music.  Their new album, Dressed in Roses, released January 2020, \"Stands as a true testament to their musical identity and the sound that has launched one of the Midwest's most in-demand acoustic acts.\"\nWebsite | Facebook"},{"date":"2022-05-26T20:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2022/02/12095133/DAVID-BROMBERG.jpg","title":"David Bromberg Quintet","url":"https://secure.thefreight.org/11211/david-bromberg-quintet-26","details":"With his 1971 self-titled Columbia Records release, David Bromberg emerged as the wunderkind of American roots music. The disc’s compelling blend of traditional and original material, virtuosic musicianship and iconic cover art trumpeted the arrival of a new artist possessed of audacious and uncompromising vision. Over the course of four albums for Columbia and five for Fantasy Records, and through associations with artists like Bob Dylan, Jerry Jeff Walker, John Hartford, George Harrison, the Grateful Dead, Emmylou Harris and Bonnie Raitt, Bromberg’s reputation, repertoire and following grew exponentially. However, the incessant demands of touring finally brought the band’s recordings and shows to an end in the early 1980’s.\n\nThe twenty-two year drought ended in 2006 with the release of the Grammy-nominated solo effort Try Me One More Time. Gradually tour dates were added and bandmembers assembled as David, in 2011, followed up Try Me with Use Me, a typically unorthodox Brombergian effort, partnering him with some of the most celebrated names in music – Linda Ronstadt, Vince Gill, Los Lobos, Dr John, Keb’ Mo, John Hiatt, Levon Helm and others – whom David asked to either write or choose songs and then produce him doing them.\n\nTwo more albums emerged from 2013 to 2017, Only Slightly Mad and The Blues the Whole Blues and Nothing But the Blues, both produced by three-time Grammy winner Larry Campbell. Recorded at Levon Helm’s Barn, Only Slightly Mad brought the band back to David’s eclectic ‘kitchen sink’ musical philosophy, while with The Whole Blues, David upheld Texas fiddler Johnny Gimbel’s claim that: “There are only two songs – the Star-Spangled Banner and the Blues.” The band skipped over the ‘Banner’ and headed straight for the blues, winning the 2017 Downbeat Critic’s Poll for Best Blues Album.\n\nEventually David’s band settled into its current lineup of Mark Cosgrove (guitar, mandolin, vocals), Nate Grower (fiddle, mandolin, guitar, vocals), Josh Kanusky (drums, vocals) and newest member, Suavek Zaniesienko (bass, vocals). This nucleus has performed hundreds of shows together, traversing thousands of miles, across the US \u0026 Canada to Europe, Japan and Australia. With the group having attained a high level of musical telepathy, they entered the studio in mid 2019 for a slightly different approach to record making….\n\nThe new album, Big Road, will give Bromberg fans the most intimate portrait to date of David and the band, musically and visually. Featuring twelve new tracks, five hi def performance videos and a mini documentary detailing the album’s creation, it will be released in three formats: traditional CD, a gatefold vinyl album and a CD/DVD combo pack. In an age where recorded music has been devalued and relegated to a digital stream for smart phones, Big Road returns the listener to the golden age of record making, when enjoying an album was a tactile, visual and auditory experience. Joining David’s core band are keyboardist extraordinaire Dan Walker on piano, organ and accordion, a stellar horn section of Bromberg regulars like Birch Johnson (trombone), Jon-Erik Kellso (trumpet), Matt Koza (tenor sax) and Bob Stewart (tuba) with Larry Campbell on mandolin and pedal steel.\n\nWe think you’ll agree that traveling the David Bromberg Band’s Big Road is a trip work taking.\nWebsite | Facebook"},{"date":"2022-05-27T20:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2022/02/12095133/DAVID-BROMBERG.jpg","title":"David Bromberg Quintet","url":"https://secure.thefreight.org/11211/david-bromberg-quintet-27","details":"With his 1971 self-titled Columbia Records release, David Bromberg emerged as the wunderkind of American roots music. The disc’s compelling blend of traditional and original material, virtuosic musicianship and iconic cover art trumpeted the arrival of a new artist possessed of audacious and uncompromising vision. Over the course of four albums for Columbia and five for Fantasy Records, and through associations with artists like Bob Dylan, Jerry Jeff Walker, John Hartford, George Harrison, the Grateful Dead, Emmylou Harris and Bonnie Raitt, Bromberg’s reputation, repertoire and following grew exponentially. However, the incessant demands of touring finally brought the band’s recordings and shows to an end in the early 1980’s.\n\nThe twenty-two year drought ended in 2006 with the release of the Grammy-nominated solo effort Try Me One More Time. Gradually tour dates were added and bandmembers assembled as David, in 2011, followed up Try Me with Use Me, a typically unorthodox Brombergian effort, partnering him with some of the most celebrated names in music – Linda Ronstadt, Vince Gill, Los Lobos, Dr John, Keb’ Mo, John Hiatt, Levon Helm and others – whom David asked to either write or choose songs and then produce him doing them.\n\nTwo more albums emerged from 2013 to 2017, Only Slightly Mad and The Blues the Whole Blues and Nothing But the Blues, both produced by three-time Grammy winner Larry Campbell. Recorded at Levon Helm’s Barn, Only Slightly Mad brought the band back to David’s eclectic ‘kitchen sink’ musical philosophy, while with The Whole Blues, David upheld Texas fiddler Johnny Gimbel’s claim that: “There are only two songs – the Star-Spangled Banner and the Blues.” The band skipped over the ‘Banner’ and headed straight for the blues, winning the 2017 Downbeat Critic’s Poll for Best Blues Album.\n\nEventually David’s band settled into its current lineup of Mark Cosgrove (guitar, mandolin, vocals), Nate Grower (fiddle, mandolin, guitar, vocals), Josh Kanusky (drums, vocals) and newest member, Suavek Zaniesienko (bass, vocals). This nucleus has performed hundreds of shows together, traversing thousands of miles, across the US \u0026 Canada to Europe, Japan and Australia. With the group having attained a high level of musical telepathy, they entered the studio in mid 2019 for a slightly different approach to record making….\n\nThe new album, Big Road, will give Bromberg fans the most intimate portrait to date of David and the band, musically and visually. Featuring twelve new tracks, five hi def performance videos and a mini documentary detailing the album’s creation, it will be released in three formats: traditional CD, a gatefold vinyl album and a CD/DVD combo pack. In an age where recorded music has been devalued and relegated to a digital stream for smart phones, Big Road returns the listener to the golden age of record making, when enjoying an album was a tactile, visual and auditory experience. Joining David’s core band are keyboardist extraordinaire Dan Walker on piano, organ and accordion, a stellar horn section of Bromberg regulars like Birch Johnson (trombone), Jon-Erik Kellso (trumpet), Matt Koza (tenor sax) and Bob Stewart (tuba) with Larry Campbell on mandolin and pedal steel.\n\nWe think you’ll agree that traveling the David Bromberg Band’s Big Road is a trip work taking.\nWebsite | Facebook"}]