[{"date":"2022-05-31T00:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2021/08/27125408/KakiKing.jpg","title":"Kaki King","url":"https://secure.thefreight.org/871/modern-yesterdays","details":"Known as one of the greatest guitar innovators of our time, Kaki King presents MODERN YESTERDAYS, a refinement of her now signature guitar-projection mapping performance. With technicolor imagination, technical wizardry, and carefully choreographed guitar and drum playing, “she’ll do the unexpected, every time” (Digital Trends). Bridging future-forward modernity with contemplative longing, MODERN YESTERDAYS sends us on an audiovisual journey reset by our recent past, arriving at the emotional place we yearn to visit.\n\nThe album Modern Yesterdays (released in late 2020 on Cantaloupe Music) derives broadly from the music composed for Data Not Found (DNF), Kaki King’s largest-scale and most theatrical performance piece yet. With the post-pandemic performance world ever-evolving, Kaki King set out to create an analog to Data Not Found, which can now be found in MODERN YESTERDAYS: an interlocking puzzle piece nimble enough to tour the world in 2021, and beyond.\n\n**In Data Not Found, numerous projection sources, an enormous tent, and 1000 pounds of sand were set to tell a story about the traces of things we leave behind in this world.** Unfortunately, the show’s production came to a halt in March 2020 due to the COVID-19 lockdown.\nWebsite | Facebook"},{"date":"2022-06-01T00:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2021/08/31061918/TheMoth.jpg","title":"The Moth StorySLAM - BIRTHDAYS","url":"https://secure.thefreight.org/837/the-moth-jun","details":"The Moth StorySLAM - BIRTHDAYS\nPrepare a five-minute story about a celebration. Once a year, for better or worse. Party hats, blowing out the candle, opening the gifts, or weeping in solitude, wondering where all the years have gone.\nSince its launch in 1997, The Moth has presented thousands of stories told live and without notes.\nMoth shows are renowned for the great range of human experience they showcase. Each show starts with a theme, and the storytellers explore it, often in unexpected ways. Since each story is true and every voice authentic, the shows dance between documentary and theater, creating a unique, intimate, and often enlightening experience for the audience.\nThe Moth was founded by the novelist George Dawes Green, who wanted to recreate in New York the feeling of sultry summer evenings in his native Georgia, when moths were attracted to the light on the porch where he and his friends would gather to spin spellbinding tales. The first New York Moth event was held in George’s living room and the story events quickly spread to larger venues throughout the city.\nThrough ongoing programs in more than 29 cities, The Moth has presented over 30,000 stories to standing-room-only crowds worldwide and it currently produces more than 500 live shows each year. Additionally, The Moth runs storytelling workshops for high school students and adults in underserved communities through their Education and Community Programs.\nThe Moth has an enthusiastic following for all of its content. The Moth podcast is downloaded more than 50 million times a year, and each week, the Peabody Award-winning Moth Radio Hour is heard on over 480 radio stations worldwide. The Moth’s first book, The Moth: 50 True Stories was a NYT Bestseller and its newest book, All These Wonders: True Stories About Facing the Unknown was released March, 2017."},{"date":"2022-06-02T00:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2022/01/22081336/LittleVillageFoundation.jpg","title":"Little Village Presents 5 World Premieres","url":"https://secure.thefreight.org/11254/little-village-presents","details":"Deshawn Hickman/Charlie Hunter *\nSacred Steel from Greensboro NC produced and performed along with Charlie Hunter\nDiunna Greenleaf  * \nAward winning Houston Blues chanteuse\nMarina Crouse  *   \nSung in Spanish w/ songs originally performed by Eydie Gormé \nMaurice Tani \nHe will host and also share some of his new songs       \nRome Yamilov/Henry Kaiser  *   \n2 generations of avant garde guitar in a musical exploration of blues legend JB Lenoir.\nMike Schermer   *\nMarcia Ball to Bruce Springsteen (Big Sister's Radio) have noted his songwriting prowess\n*= record release and maiden performance or premiere live performance\nAlthough Maurice has a new cd it won't be released until July/August hence the 6 acts - 5 \"world premieres\"\nAll new recordings will be available for purchase that evening.\n  Little Village is a 501c3 nonprofit record company that seeks to shine the light of awareness on musicians who might not otherwise be heard and in doing so further the belief that a life filled with diverse music builds empathy making for stronger communities and a better world."},{"date":"2022-06-03T00:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2022/02/04160050/eilenjewell.jpg","title":"Eilen Jewell","url":"https://secure.thefreight.org/11189/eilen-jewell","details":"American Songwriter describes Eilen Jewell as one of America's most intriguing, creative and idiosyncratic voices. The Boise, Idaho songwriter leads a tight quartet that blends influences of surf-noir, early blues, classic country, folk, and 1960s era rock ’n’ roll. For well over a decade, they’ve toured relentlessly for legions of fans from Boston to Boise and Madrid to Melbourne, playing large festivals, theaters, rock clubs, and coffeehouses. The group has shared stages with the likes of Lucinda Williams, Loretta Lynn, Mavis Staples, Wanda Jackson, George Jones, Emmylou Harris, and Blind Boys of Alabama. Eilen’s fans have marveled at her warmth and onstage humor alongside her beautiful songs and fiery performances. In addition to six of her own full-length albums, Jewell has released two albums with her country-gospel side-project, the Sacred Shakers; a tribute album to Loretta Lynn titled Butcher Holler; and a recent album of rare blues covers, Down Hearted Blues.\nThe Los Angeles Daily News said, “Sometimes as darkly damaged as Lucinda Williams, at others as defiant and teasing as prime Peggy Lee and always authentically Americana in the Gillian Welch tradition … She’s mighty good.”  \nWebsite | Facebook"},{"date":"2022-06-04T00:00:00.000+00:00","img":"https://cdn.thefreight.org/assets/2022/03/16110605/Y-La-Bamba.jpg","title":"Y La Bamba","url":"https://secure.thefreight.org/11356/y-la-bamba","details":"DANCE FLOOR OPEN\n\nY La Bamba has been many things, but at the heart of it is singer-songwriter Luz Elena Mendoza’s inquisitive sense of self. Their fifth record, Mujeres, carries on the Portland-based band’s affinity for spiritual contemplation, but goes a step further in telling a story with a full emotional spectrum. Coming off Ojos Del Sol, one of NPR’s Top 50 Albums of 2016, Mujeres exhibits the scope of Mendoza’s artistic voice like never before. “Soy como soy,” Mendoza says, and that declaration is the bold— even political— statement that positions Mujeres to be Y La Bamba’s most unbridled offering yet.\n\nThe record exists in the post-2016 landscape of a national identity crisis, and Mendoza explores what it means to be a Mexican American woman by leading us through places we are afraid to go. Mujeres ventures in to the discomfort of the stories we tell ourselves. Those of our past, our futures. We all have these stories somewhere inside of us, but with Y La Bamba, Mendoza forges new narratives from old stories of heritage and family, tracing history while forging modern chicana feminism.\n\n“Music is an extension of everything I have inside. It’s how I emote,” Mendoza says. The raw honesty of Mujeres is in fact the raw honesty of Mendoza. Armed with the emotionality of traditional música mexicana and the storytelling of American folk, Y La Bamba’s artistry is not just their musical ability but Mendoza’s search for unadulterated truth. It is in an ancestral, spiritual journey in which Mendoza comes to terms with the influence and limitations of her upbringing. Mendoza’s experience of childhood summers in the San Joaquin Valley listening to mariachi, of being raised strict Catholic by immigrant parents, of being a woman having to prove herself to the boys, paints strokes of both melancholy and healing on the tracks. “From the way that my family struggles, to the way they shoot the shit… it’s so different from whiteness,” Mendoza says. “It’s a different dimension.”\n\nY La Bamba exists in the dimension of the Mexican American imagination: somewhere cynical and optimistic at the same time. While there is a celebration of the Mexican creativity that has informed Mendoza’s life, there is a darker side to reconcile with. Where do mujeres fit in to the American story? What are the sins for which we are all guilty? How do different generations interact with the world? How can a culture become visible without tokenization? It is no surprise that in Mujeres, Y La Bamba’s first record with Mendoza at the helm of production, Mendoza contemplates these questions to tell her story. But it is not just Mendoza’s story. Challenging a narrative and dealing with the emotionality of that effort— that is everyone’s story.\n\nMujeres was recorded by Luz Elena Mendoza and Ryan Oxford at Color Therapy Studios and Besitos Fritos Studios in Portland, Oregon. Mixed by Jeff Bond, with Grace Bugbee on bass, John Niekrasz on drums, Margaret Wher Gibson on keys, and Ed Rodriguez and Ryan Oxford on electric guitar. \nWebsite | Facebook"}]