[{"date":"2022-05-06T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiNTRjMTM2NDktZDQxNi00YjQ5LTgxMWYtMmMyNzM2MzRhMzJkIiwiZWRpdHMiOnt9fQ==","title":"Amyl and The Sniffers, C.O.F.F.I.N","url":"https://wl.seetickets.us/event/Amyl-andTheSniffers/452988?afflky=GreatAmericanMusicHall","details":"Amyl \u0026 the Sniffers, the Melbourne, Australia rock band fronted by Amy Taylor, released their sophomore album Comfort To Me a few weeks ago via ATO Records/Rough Trade to a massive reception. The record hit #1 on Billboard’s Alternative New Albums chart, #2 on both Heatseekers and Top New Artists Albums, #4 on Independent Albums, #7 on Rock Albums, #9 on Alternative Albums, and made the top 20 on the Album Sales chart. Across the pond has made BBC 6 Music’s Album of the Day, and on the band’s home turf it was named Triple J’s Featured Album of the Week.\n\nNow, after a triumphant release from the world’s longest lockdown in Australia, Amyl \u0026 the Sniffers announce their long-awaited return stateside for a U.S. 2022 tour. In addition to the band’s previously announced show at Music Hall of Williamsburg in December which sold out in less than one day, the Sniffers will tour Spring 2022. \n\nComfort To Me, which was co-produced by the band and Dan Luscombe, is the follow-up to Amyl \u0026 the Sniffers’ critically acclaimed 2019 self-titled debut album, which won Australia’s esteemed ARIA Award for Best Rock Album and saw the band tour their anarchic and ridiculously fun live show internationally for the past two years. With its lyrics largely written during the Australian Bushfire season, when The Sniffers were already wearing masks to protect themselves from smoke in the air, Comfort To Me came together in a 3-bedroom apartment where the four band members quarantined together during COVID-19 lockdown. The result is a less spontaneous and more darkly considered record that masterfully captures the essence of the band like never before. “This album is just us — raw self expression, defiant energy, unapologetic vulnerability,” says Taylor. “It was written by four self-taught musicians who are all just trying to get by and have a good time.”"},{"date":"2022-05-07T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiMDU3ZDU5MDUtZWNjZC00NWEwLWE4NzItODMwYjUzYWNkNGUyIiwiZWRpdHMiOnt9fQ==","title":"Amyl and The Sniffers, Saturday, May 07, 2022","url":"https://wl.seetickets.us/event/Amyl-andTheSniffers/452991?afflky=GreatAmericanMusicHall","details":"Amyl \u0026 the Sniffers, the Melbourne, Australia rock band fronted by Amy Taylor, released their sophomore album Comfort To Me a few weeks ago via ATO Records/Rough Trade to a massive reception. The record hit #1 on Billboard’s Alternative New Albums chart, #2 on both Heatseekers and Top New Artists Albums, #4 on Independent Albums, #7 on Rock Albums, #9 on Alternative Albums, and made the top 20 on the Album Sales chart. Across the pond has made BBC 6 Music’s Album of the Day, and on the band’s home turf it was named Triple J’s Featured Album of the Week.\n\nNow, after a triumphant release from the world’s longest lockdown in Australia, Amyl \u0026 the Sniffers announce their long-awaited return stateside for a U.S. 2022 tour. In addition to the band’s previously announced show at Music Hall of Williamsburg in December which sold out in less than one day, the Sniffers will tour Spring 2022. \n\nComfort To Me, which was co-produced by the band and Dan Luscombe, is the follow-up to Amyl \u0026 the Sniffers’ critically acclaimed 2019 self-titled debut album, which won Australia’s esteemed ARIA Award for Best Rock Album and saw the band tour their anarchic and ridiculously fun live show internationally for the past two years. With its lyrics largely written during the Australian Bushfire season, when The Sniffers were already wearing masks to protect themselves from smoke in the air, Comfort To Me came together in a 3-bedroom apartment where the four band members quarantined together during COVID-19 lockdown. The result is a less spontaneous and more darkly considered record that masterfully captures the essence of the band like never before. “This album is just us — raw self expression, defiant energy, unapologetic vulnerability,” says Taylor. “It was written by four self-taught musicians who are all just trying to get by and have a good time.”"},{"date":"2022-05-08T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiMzNkNWVjYmEtY2U2OC00MWQ4LTlmOWUtYjgxZTJlZGU4NGQ5IiwiZWRpdHMiOnt9fQ==","title":"Fozzy, GFM, Krash Karma, The Nocturnal Affair","url":"https://wl.seetickets.us/event/Fozzy/452930?afflky=GreatAmericanMusicHall","details":"After touring the world and building a loyal fanbase for the better part of twenty years, Fozzy is the epitome of what a great rock n roll band should be: catchy, groovy, hooky, sweaty and most importantly, an AWESOME F**KIN TIME!  \nWith five consecutive TOP 30 singles, Fozzy is steadily becoming one of the most successful bands on Modern Rock Radio, with their breakthrough massive smash song “Judas” expected to achieve Gold Record status by the end of 2021!\nRich Ward leads the band and is one of the most versatile, talented riff machines \u0026 songwriters in rock n roll today. Chris Jericho’s skills as a frontman are second to none and his vocal style \u0026 range are both unique and instantly recognizable. The powerhouse drumming of Frank Fontsere is the cornerstone of Fozzy’s sound, along with the blazing solos of Billy Grey and the rock star energy of new bass player, PJ Farley. These are five legit rock stars, whose energy and charisma light up every stage they play on and every crowd they perform for. As a result, it’s no surprise that Fozzy has skyrocketed into one of the hottest rock acts in years.  \nThe band inched up the ladder after releasing four progressively popular studio albums in the 2000’s. However, it was 2012’s “Sin And Bones”, which featured the hit single “Sandpaper” (over 4.5 MILLION views on YouTube) that found the band reaching a level of legitimacy that drew a mass audience to drink in their trademark heavy melodic groove. The album eventually reached #143 on the Billboard Top 200 Chart, but it was their next album, “Do You Wanna Start A War” (produced by Ward), released in the summer of 2014, that really blew the door open, debuting at #54 on Billboard and giving the band their first top 30 single in \"Lights Go Out” which was blared in sports arenas nationwide.  \nBut as much success as the band had enjoyed, nothing compared to the juggernaut of 2017’s “Judas” album. Released in May 2017, the aforementioned title track spent 5 WEEKS at NUMBER ONE on the highly influential 'Big Uns Countdown' on Sirius/XM's Octane channel, amassed over 47 MILLION views for its video on YouTube, cracked the TOP 5 on the US Rock Radio Charts and is still heard by millions of fans worldwide weekly on the TNT Network’s hugely popular “AEW Dynamite” program. The follow up single “Painless” hit number 9 on the charts (almost 10 MILLION views on YouTube) with “Burn Me Out” peaking at number 18 and “Nowhere To Run” becoming Fozzy’s third Top Ten hit in 2020.  \nNow, with those massive songs in their arsenal and the new album “Boombox” cocked and ready to go, Fozzy looks forward to being back on the road for their Saving The World 2021Tour. After sharing the stage in recent years with Metallica, Kiss, Iron Maiden, Avenged Sevenfold, Shinedown, Slash, Saxon, Nickelback, Steel Panther \u0026 Buckcherry, Fozzy is stoked to storm back on the stage to bring good times and great tunes to their fans around the world and elsewhere! So get ready to experience the majesty and power of Fozzy LIVE once again, and for Judas’ sake...please wear a helmet!  \nFozzy is: Chris Jericho - vocals\nRich Ward – guitars, vocals \nFrank Fontsere – drums\nBilly Grey – guitars\nPJ Farley – bass  \nfacebook.com/FozzyRock\nFOZZYROCK.com"},{"date":"2022-05-09T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiMzBiZDdiNjgtNmQ2YS00MDRlLWI1ZDgtOTdjNDM5NTEzY2FmIiwiZWRpdHMiOnt9fQ==","title":"Kevin Devine *Relocated to Cafe Du Nord*, Monday, May 09, 2022","url":"https://wl.seetickets.us/event/Kevin-DevineRelocatedtoCafeDuNord/463098?afflky=GreatAmericanMusicHall","details":"Kevin Devine’s performance at the Great American Music Hall on May 9, 2022 has been relocated to Cafe du Nord (2174 Market St., San Francisco, CA). All original tickets will be honored at the show and no exchange is necessary. \n\nAdditional tickets can be purchased through the link here.\n\nTickets on sale Friday, 2/11 at 12pm!\n$18 ADV $22 DOOR\nDoors 6:30pm Show 7:30pm\nSinger/songwriter Kevin Devine rose through New York's indie rock and emo circles in the early years of the millennium, first as the frontman for emo band Miracle of 86, and later as a solo act. Thanks to albums like 2003's Make the Clocks Move and 2005's Split the Country, Split the Street, his introspective and emotionally urgent songs about love, life, and politics won a loyal fan base that followed him through a brief stint as a major-label act. Following his 2009 standout Brother's Blood, Devine collaborated with members of Manchester Orchestra as Bad Books, a project which went on to release three albums over the next decade. He continued releasing solo albums throughout the early 2010s and in 2015 began a split-single series called Devinyl Splits which over the next four years saw him working with artists like David Bazan, Cymbals Eat Guitars, and Jesse Lacey. He also released another solo full-length in 2016's Instigator.\nDevine was born in Brooklyn, New York on December 19, 1979. After graduating from high school, he enrolled at Fordham University to study journalism, but in 1999 his priorities turned to music; he began performing solo at coffee houses and open-mike nights, and soon he and Chris McAllen, a friend since high school, formed the emo band Miracle of 86 (the name came from the unexpected World Series victory by the New York Mets that year). Miracle of 86 earned a potent following on the New York/New Jersey indie rock scene, but it didn't take long for Devine to begin thinking outside of the band's boundaries. In 2002, he released his first solo album, Circle Gets the Square, and began playing solo shows in addition to his dates with the group. In 2003, he would drop a three-song EP, Travelling the EU, and a second full-length solo album, Make the Clocks Move (informed by the death of his father and the 2004 presidential race), before Miracle of 86 finally broke up.\nIn 2005, Devine released his first post-Miracle of 86 album, Split the Country, Split the Street. Produced by two of Devine's former associates from the group, Chris Bracco and Mike Skinner, the album moved back and forth between uptempo rock and quieter, more contemplative songs. In 2006, Devine scored a major-label deal with Capitol Records and, working with producer Rob Schnapf (who had collaborated with one of Devine's key influences, Elliott Smith), made Put Your Ghost to Rest. The album earned enthusiastic reviews, but several months after its release, a merger between Capitol and Virgin Records scuttled its marketing, and Devine was dropped from the label. However, the album soon gained a second life when it was reissued in 2008 by the indie imprint Junketboy, and Devine toured in support of the new release. In 2009, he returned with his next album, Brother's Blood, released by Electric Gentlemen Records; he toured in support of it backed by his occasional touring ensemble the Goddamn Band, and with the group Manchester Orchestra as an opening act. The tour went so well that Devine and members of Manchester Orchestra formed a side project, Bad Books, who released their self-titled debut album in the fall of 2010.\nIn the fall of 2011, Devine returned as a solo act with the album Between the Concrete and Clouds, produced by Chris Bracco and mixed by Schnapf; it was also Devine's first album in a co-release arrangement with Razor \u0026 Tie and Electric Gentlemen. In 2012, Devine reunited with Bad Books for the concisely titled Bad Books II. In early 2013, Devine joined the growing number of artists who turned to crowdfunding to finance their recording projects rather than rely on record labels; he launched a Kickstarter campaign to raise $50,000 in order to produce two albums, and the target figure was reached in less than a day. After raising $114,000, Devine completed and self-released two albums in the fall of 2013: Bulldozer, a solo album produced by Schnapf, and Bubblegum, a collaboration with the Goddamn Band produced by Jesse Lacey. Along with extensive global touring in support of the two albums, Devine also found time to take part in a handful of reunion shows with his Miracle of 86 bandmates, one a benefit for survivors of Hurricane Sandy. From 2015 into 2016, Devine released the six-part Devinyl Splits series, collaborating with artists like Matthew Caws, Meredith Graves, and Cymbals Eat Guitars. In late 2016 he issued his ninth LP, Instigator. Following a brief stint as the touring guitarist for Brand New, Devine issued an acoustic version of Instigator titled We Are Who We've Always Been. Collaborating again with Manchester Orchestra's Andy Hull and Robert McDowell, the trio issued Bad Books III in June 2019."},{"date":"2022-05-10T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiOGU0ZTY5NDEtYTY0MS00OWUwLWIwMjMtYzg2MTJmMTM1Y2Y2IiwiZWRpdHMiOnt9fQ==","title":"Shout Out Louds, Tuesday, May 10, 2022","url":"https://wl.seetickets.us/event/Shout-OutLouds/462350?afflky=GreatAmericanMusicHall","details":"Tickets on sale Fri. 1/14, 9am!\nDoors 7pm / Show 8pm\n$25 ADV / $28 DOORS\nFormed in Stockholm by childhood friends Adam Olenius (vocals), Ted Malmros (bass), and Carl von Arbin (guitars), Shout Out Louds found an international audience during the early 2000s with their peppy Swedish pop. The lineup began taking shape in 2001, with drummer Eric Edman and keyboardist Bebban Stenborg climbing aboard shortly thereafter. Shout Out Louds wasted little time writing songs, the first three of which formed the basis of their first demo tape. The music caught the ear of Filip Wilén, owner of Sweden's Bud Fox Recordings, and he quickly signed the group to his label. Shout Out Louds then spent the majority of 2002 writing more songs, and December found them recording their debut EP, 100°, which was released in 2003. The group's high-energy, ultra-melodic sound was in place from the very beginning. The band toured Sweden and Scandinavia in support of 100°, whose release was followed by two singles, \"Hurry Up Let's Go\" and \"Shut Your Eyes.\" In October 2003, the group released its first album, Howl Howl Gaff Gaff, to great acclaim in Sweden. The band spent the following year touring, releasing additional material (\"Please Please Please,\" \"Very Loud/Wish I Was Dead,\" and the Oh, Sweetheart EP), and inking an American deal with Capitol Records. The U.S. version of Howl Howl Gaff Gaff was released in May 2005, featuring songs from the Swedish release plus some early singles and EP tracks. A tour of the U.S. with indie darlings the Dears helped boost the band's profile, as did airplay on The OC. Despite such growing success, the band's 2007 album -- Our Ill Wills, produced by Björn Yttling -- was a somber, melancholy affair, replete with icy synths and Cure-inspired vocals. Another round of tour dates kept the bandmates busy until mid-2008, at which point they decided to take a half-year hiatus. March 2009 found the musicians reconvening in Stockholm to write new material, and by August the band had decamped to Seattle to begin recording with producer Phil Ek. Their third album, Work, arrived in early 2010. After coming home from a tour to support the album, the bandmembers felt that a change in the way they worked was in order. Hoping to recapture the more relaxed spirit of earlier recordings, they spent time outside the studio composing the songs, with each bandmember responsible for coming up with their own parts. When they came back together, the band produced their next record themselves (with help from Johannes Berglund) in a small Stockholm studio. Optica was released by Merge in early 2013. The next few years saw a handful of solo releases from both Olenius and from Stenborg's Astropol project. Regrouping in Stockholm, the Shout Out Louds returned with 2017's more guitar-oriented Ease My Mind."}]