[{"date":"2022-05-25T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiMTI5ZmVjMzAtZDVkZS00ZjRmLTg3MmYtMGQ5MWFhZDIwMDVlIiwiZWRpdHMiOnt9fQ==","title":"MarchFourth","url":"https://wl.seetickets.us/event/MarchFourth/478714?afflky=GreatAmericanMusicHall","details":" On sale now!\n$20 ADV | $20 DOOR\nDoors 7pm | Show 8pm\n\nMarchFourth is a joy-inducing force of entertainment. The colorful explosion of brassy funk, rock, and jazz is all about the groove. This larger-than-life group of musicians and acrobats tours the country year-round, bringing a spirit of celebration wherever they go. MarchFourth is, in a word, FUN! \nWith exceptional musical quality and a visual kaleidoscope of performers, MarchFourth is a spectacle of high-energy compositions, colorful costumes, and irresistible charisma! M4 has been seen on stages from ESPN’s Espy Awards to festivals like Wakarusa, Bumbershoot, and High Sierra Music Fest, to world-class venues like The Kennedy Center and The Fillmore, and even a cultural exchange tour to China, sponsored by the US State Department.\nMarchFourth’s track “Gospel” (from their self-released album Rise Up, 2009) was featured as the closing credits theme song in the Disney/Pixar animated film, Monsters University. Their next album Magnificent Beast was self-released in 2011, produced by fellow Portlander Steve Berlin (Los Lobos).\nFor their most recent album, Magic Number, fifteen MarchFourth musicians traveled from Portland, Oregon to New Orleans, Louisiana to record with Producer Ben Ellman (Galactic) and Engineer/Producer Mikael “Count” Eldridge (DJ Shadow, Tycho, Trombone Shorty). With local talent at the helm, the album is full of the captivating grooves and brassy swagger you’d expect from MarchFourth, plus a healthy dose of New Orleans magic, with guest appearance by Trombone Shorty, Stanton Moore (drums), and Matt Perrine (sousaphone). \n“Perfectly merging the artistic spirit of Portland with the musical spectacle of New Orleans, MarchFourth put on one of the most complete shows of any band on any stage. From rocking big band jam tunes, choreography and feats of strength that need to be seen to be believed, MarchFourth entertains on every level every second they are on the stage…or off!” ~Live for Live Music.\n“From the first note to the last, the sound was pumping and the fun never stopped… It’s worth noting that there are serious musicians behind all the fun. It’s obvious these guys (and gals) have had lots of training and formal practice. Talented band geeks turned rebels.”  ~USAToday\n“Just when you think you’ve heard it all, suddenly a band crosses paths with your ears and changes everything… Full of auditory goodness...”  ~NYS Music\n\n“Mighty, Explosive, Carnivalesque Brass Band Funk”  ~New York Music Daily"},{"date":"2022-05-26T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiOTI0OGU0YWYtMTY5Zi00MDYwLWEwN2MtODdlNjdhMzRiN2ZmIiwiZWRpdHMiOnt9fQ==","title":"Flipper with Fletcher (of The Garden), The Mutants, Longshoremen","url":"https://wl.seetickets.us/event/Flipper-withFletcherofTheGarden/471968?afflky=GreatAmericanMusicHall","details":"On Sale Now!\n$28 ADV | $33 DOOR\nDoors 7pm | Show 8pm\n*Part of the Tenderloin Museum's “Punk/Performance in the Loin\" project \u0026 \"Sounds of the Tenderloin\" live music series, generously funded by Hardly Strictly Bluegrass*\n\n\"FLIPPER with Fletcher\"\n\nAs previously announced, the final Flipper shows with David Yow took place this past December. As of 2022, Flipper will be getting out to play shows and tour “Till the Wheels fall off.” The world is ready to get back to live music so it’s time to get back out in the world.  \nFlipper will be out making new friends and rekindling old friendships with guest vocalists and musicians along the way. First up at bat is Fletcher Shears of The Garden, who Flipper shared the stage with at The Fonda Theatre last December. Fletcher will be appearing on vocals with Flipper for an East Coast run of shows this April. Fletcher will then also be appearing with Flipper for a couple of California show including at the legendary Great American Music Hall on May 26th as part of the Tenderloin Museums \"Punk/ Performance In The Loin\" series honoring legendary punk venues of SF's past and present day, alongside Flipper will be the legendary Mutants and The Longshoremen. "},{"date":"2022-05-27T21:00:00.000-07:00","img":"https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F136974911%2F302496356207%2F1%2Foriginal.20210529-001244?w=600\u0026auto=format%2Ccompress\u0026q=75\u0026sharp=10\u0026rect=0%2C0%2C2160%2C1080\u0026s=d144b1f5f357d1db349b167892261131","title":"MOLCHAT DOMA, DJ Omar","url":"https://www.eventbrite.com/e/molchat-doma-tickets-156849014625?aff=ebdsoporgprofile","details":""},{"date":"2022-05-28T21:00:00.000-07:00","img":"https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F136975257%2F302496356207%2F1%2Foriginal.20210529-001244?w=600\u0026auto=format%2Ccompress\u0026q=75\u0026sharp=10\u0026rect=0%2C0%2C2160%2C1080\u0026s=f00dae3270cb9f670528b163e201d8e0","title":"MOLCHAT DOMA, DJ Omar","url":"https://www.eventbrite.com/e/molchat-doma-tickets-157305487949?aff=ebdsoporgprofile","details":""},{"date":"2022-05-29T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiZjBlMWIxNzUtNTljYy00ZWZlLWIxN2UtZjhjMjJhYTdhODM4IiwiZWRpdHMiOnt9fQ==","title":"The Pineapple Thief, The Cyberiam","url":"https://wl.seetickets.us/event/The-PineappleThief/442075?afflky=GreatAmericanMusicHall","details":"For Bruce Soord, there’s a quote that sums up Versions Of The Truth, the stunning new album from his band The Pineapple Thief. It comes from The Leopard, Giuseppe Tomasi di Lampedusa’s 1958 novel about political ambition and personal upheaval in 19th century Sicily:\n'... a fact has scarcely happened five minutes before its genuine kernel has vanished, been camouflaged, embellished, disfigured, squashed, annihilated by imagination and self-interest; shame, fear, generosity, malice, opportunism, charity, all the passions, good as well as evil, fling themselves onto the fact and tear it to pieces; very soon it has vanished altogether'\nGiuseppe Tomasi di Lampedusa wrote those words more than 60 years ago but for Soord they are more pertinent than ever. From the political to the personal, from world leaders to personal friends and enemies, truth is more than just a malleable commodity – it’s a weapon in the hands of whoever wields it. \nThat blurring between the real and the perceived, between meaning and intent, is the idea behind Versions Of The Truth. It’s an album that holds up a mirror to the chaos and conflict of 21st-century life and tries to make sense of the distorted reflections that gaze back at it. The title says it all: this is the soundtrack for a post-truth world.\n“When you have conflict, the truth gets bent and kicked around, the facts get changed,” says Bruce Soord. “That’s why people argue or get divorced or fight – because nobody can agree on what the truth is. That idea of different versions of the truth especially applies to the world we’re living in right now. All these things are happening where nobody has any idea of what the real truth of anything is because everything is so distorted.”\nWhat has emerged stands as The Pineapple Thief’s finest album yet. It takes the creative and commercial triumphs of their last two albums, 2016’s breakthrough Your Wilderness and its follow-up Dissolution and magnifies them.Musically bold and lyrically thought-provoking, this is the sound of a band determined to push themselves forward.\n“You strive to make something different with every album,” says Soord. “We didn’t want to make another Dissolution. We didn’t want to make another Your Wilderness. We wanted something that sounded different, yet still sounded like The Pineapple Thief.”\n“I think our sound has evolved, and these new songs are more to the point,” adds drummer Gavin Harrison.\nInspired by the success of Dissolution, which gave TPT their first UK Top 40 album, as well as the birth of his baby daughter, Soord began working on music for the band’s next album. “Four or five” songs emerged from this burst of creativity, the very first track of which was the album’s lead single “Demons”, a track whose deceptively upbeat sound masks a deep well of emotion and darkness.\n“I’ve never written a song that has that kind of playful, bouncy vibe, but with such dark lyrics,” says Soord. “At a certain point the song breaks down and it suddenly dawns: ‘Hold on, this is a really dark song.’ It’s one of the most direct songs in terms of sentiment: the older you get, the more demons are idling in your closet, and you have to learn to live with them.”\nAs Soord continued writing, he began bouncing ideas off Gavin Harrison, the former Porcupine Tree/King Crimson drummer who joined The Pineapple Thief in 2014.\n\n“I think we now understand each other musically more than before and have refined a method of working that is productive,” says Harrison. “Although we both come from very different musical backgrounds our collective sense of what is correct for the project is absolutely on the same page.”\n\nThe album was written in two major sessions, separated by The Pineapple Thief’s biggest US tour to date and the release of Soord’s second solo album, 2019’s All This Will Be Yours. “The songs really benefited from that break,” says Soord. “I listened to the first batch and they felt really fresh, and so I was inspired to go and write some more.”\nProduced by the four members of the band themselves – Soord and Harrison plus bassist Jon Sykes and keyboard player Steve Kitch – Versions Of The Truth marries a stellar musical breadth to a spectrum of emotions that run from anger and confusion to sadness and regret and even glimmers of hope. In places, the album is starkly autobiographical. In others, it confronts the chaos of modern life head-on.\nThe darkly anthemic title track opens the album and sows the seeds for what follows. Alluding to broken friendships and how the truth becomes the first casualty even in the most personal conflicts, it finds Soord approaching the subject from two opposite yet connected perspectives. “There’s one person saying one thing, then it jumps to the other person going, ‘Wait, that’s not how I remember it, they’ve sold me out.’ It keeps jumping until the end, where both people are saying exactly the same thing.”\nThat very personal undercurrent flows beneath the entire album. The haunting and nocturnal “Driving Like Maniacs” paints a vivid picture of a friendship always destined to crash and burn. “It’s about those relationships that are so fast and intense – too fast and intense to last,” says Soord. “There comes a point where you have to give up, you have to lift your hand from the wheel and say, ‘That’s it.’”\nElsewhere, the seven-and-a-half minute “Our Mire” finds Soord addressing the consequences that come in the wake of a broken relationship, jagged edges poking through its otherwise calm musical surface before a striking coda lead plunges it down into darker depths. “Out Of Line” looks at missed opportunities and missed chances – those moments when we could have stopped something but chose not to or maybe didn’t see that we had to.\n“That idea can apply to life or to society,’ says Soord. “Everybody knows we’re ruining the planet, everybody knew there was going to be a pandemic at some point, but we ignore it and ignore it until it’s too late.”\nJust as Versions Of The Truth runs the gamut of emotions, so it draws from a breathtakingly broad musical palette. Where “Demons” is sonically upbeat, “Break It All” bristles with aggression and narcissistic self-loathing. The deliberately subdued atmospherics of “Too Many Voices” is punctuated by the quiet cacophony of an internal choir, while an air of quiet menace underpins “Leave Me Be”. The title track and “Stop Making Sense” even feature the appearance of a marimba – a percussive instrument resembling a giant xylophone.\n“I was working on one of the demos and it just hit me that the marimba might sound good,” explains Harrison. “I have owned a marimba for more than 10 years now and I occasionally play it on projects and play it a little bit for fun. When I look across my studio I can see it sitting there. So I thought, ‘Why not?’ I wanted to create the feeling of a bustling, busy street scene. It’s quite a different sound for Pineapple Thief but I think it really works.”\n“Stop Making Sense” is one of the album’s key moments, offering a flash of hope amid the darkness. What starts out as an all-too-timely dissection of people who will do and say anything they need to, to get what they want flips on its head at the song’s climax. “That song is ultimately about having somebody with you that’s true, and that you can believe in,” says Soord. “At the end, the lyrics change from me singing, ‘They stop making sense to me’, to me going, ‘Without you, this makes no sense to me.’”\nThe album concludes on an unexpected note. Where past albums have ended with a grandly epic climax, here closing track “The Game” seethes with barely suppressed anger. “You’re taking us all for fools/You’re selling us down the river,” sings Soord over music whose slow-building tension hides a palpable fury. \n“Everybody has had enough, people are thinking, ‘What is going on, what has happened to the world?’’ he says. “You have to hope that the truth will prevail at some point.”\nThe themes of the album – ever-changing perspectives and malleable truths – are reflected in its artwork. An etching by the late German artist Michael Schoenholtz, it features a series of kinetic, abstract shapes that seem to reveal a different image to whoever looks at it. Gavin Harrison came across the etching just as the band were finishing Versions Of The Truth, and showed it to his bandmates.\n“That particular etching just seemed to resonate with me,” says Harrison. “Within five minutes we had all chosen the same image. It was the fastest selection process of a band that I’ve ever witnessed. As is often the case with modern contemporary art, different people find different meaning within it. Personally I see it as an intriguing maze that depicts the mental process of creativity. It never has straight lines.”\nThat creativity, that sense of the unexpected and often unsettling, flows through this stunning album. With it, The Pineapple Thief are questioning the very nature of truth and the impact it has. In a world of deception, confusion and multiple versions of the truth, they stand as something to believe in."},{"date":"2022-05-30T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiNTIyMjVkNTgtOGM5My00ODNmLTlkZjYtZTJiNmMzY2Y3ZmJjIiwiZWRpdHMiOnt9fQ==","title":"RX Bandits, Monday, May 30, 2022","url":"https://wl.seetickets.us/event/RX-Bandits/472123?afflky=GreatAmericanMusicHall","details":" On sale Fri, 3/18 @ 10am!\n$25 ADV | $30 DOOR\nDoors 7pm | Show 8pm\nRXBANDITS will resume their musical campaign after another hiatus following their OC House Of Blues performance in January of 2020. Two decades of destroying and rebuilding musical genres into a unique energy exchange between audience and band has shaped the band's motivation for live performances; anyone who has been to an RX show knows this and feels it deeply. After surviving multiple periods of chaos and disarray which nearly ended the band, RXBANDITS are stronger than ever and ready to bring their highly interactive live show to you and leave it all on the stage and in your hearts. "},{"date":"2022-05-31T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiMGFkODZjZTctMTQyMC00N2Q3LWIzODEtYzIzYjU3MTNjZjY0IiwiZWRpdHMiOnt9fQ==","title":"Ricky Montgomery, Back In Business Tour","url":"https://wl.seetickets.us/event/Ricky-Montgomery/467469?afflky=GreatAmericanMusicHall","details":"Tickets on sale Friday, 2/18 @ 10am!\n$25 ADV / $30 DOORS\nDoors 7pm / Show 8pm\n\nRicky Montgomery's music was ahead of its time -- literally. Four years after the release of his debut album, and a decade after he wrote some of it, the Los Angeles native's indie-pop has been a balm in the midst of a heavy time, comforting listeners with warm melodies and relatable lyrics. It all started in July of 2020, when a pair of singles from 2016's Montgomery Ricky -- the gently swaying \"Mr Loverman\" and string-soaked stunner \"Line Without a Hook\" -- took off on TikTok. \"I think because we had a really traumatizing year, these songs kind of found a moment,\" Montgomery says. \"Because they're all, in their own way, about traumas in my life.\"\n\nNow, with a fan base that's all caught up, Montgomery is sitting on a trove of new music built on this now-familiar foundation: \"Mr. Loverman\" pairs intense family strife with soft acoustic strums that build to a rousing sing-along chorus; \"Line Without a Hook\" rocks a bit heavier, with strings and power-pop riffs weaving around cathartic one-liners that speak to the jumble that is one's coming of age. He balances melancholy with a touch of sweet humor and loads of humanity. It's no wonder these songs have racked up more than 210M streams so far, landing simultaneously on the Spotify 200 and Spotify Viral 50 charts -- a feat few artists can claim -- with over 50 entries worldwide. As of early 2021, Montgomery's catalog was picking up 15M global streams weekly.\n\nMontgomery began honing his singing and songwriting chops at age 14, shortly after moving from L.A. to Missouri. To flee the culture shock, he went underground, literally, shuffling through various bands in the suburban basements of West St. Louis County. \"Music was just an escape from everything,\" he says. \"It was a way to go into myself and figure out how to have fun on my own.\" In college, he found the fun he was looking for -- and his first viral audience -- on the now-defunct Vine platform, interspersing comedic bits with intimate music performances.\n\nBut in the summer of 2014, he released his debut EP, Caught on the Moon, and found himself climbing iTunes' Rock and Alternative charts. His yearning to move back to the West Coast was palpable in those songs, and he knows it. \"At the time, I defined my personality around wanting to leave Missouri,\" he admits. \"It was almost obsessive for me.\" The success gave him the excuse. He dropped out, hightailed it to his hometown, and released Montgomery Ricky.\n\nOf course, music careers in L.A. are rarely so simple. When things didn't exactly take off, Montgomery swerved into The Honeysticks, a side project with a childhood friend meant to be an outlet for experimentation. In 2018, he took a year off of music. And by the summer of 2020, he was considering quitting entirely. Then the seemingly impossible -- yet somehow inevitable -- happened: Suddenly people were finding solace in his songs. Now, he's using that momentum to prepare for the release of new music on Warner Records. While the songs will certainly be updated, Montgomery's sincere songwriting will continue to shine through. \"I just want to create something that can feel as special for other people as it is to me,\" he says."},{"date":"2022-06-02T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiYzkwMjE1Y2ItNzZhYy00ZmI4LTgzNDItNGI0N2VkYWI0ZTg5IiwiZWRpdHMiOnt9fQ==","title":"Vundabar, Runnner","url":"https://wl.seetickets.us/event/Vundabar/452950?afflky=GreatAmericanMusicHall","details":"The Vundabar performance at Great American Music Hall on March 7, 2022 has postponed to June 2, 2022. Your ticket will be honored at the door and no exchange is necessary. If you would like a refund, please contact your point of purchase by Friday, February 18. Refund requests received after Friday, February 18 will not be honored.\nOn Sale: Friday, 11/12 @ 7 AM PST\n$20 ADV / $25 DOOR\nDoors 7pm / Show 8pm\nThere's somewhat of a paradox inherent in Vundabar's songwriting - a conflicting sense of nostalgia contrasted with the realization that they couldn't sound more current. The music they make feels like something that should have been heard a long time ago, while simultaneously continuing to forge ahead sonically. Vundabar's high energy live show is the stand out quality of this band and is an art they’ve undoubtedly perfected by touring non-stop around the country. Vundabar’s shows never fail to be captivating, complete with infectious jams, guitar moves galore, intricate drum work, and humorous stage banter to top it all off, the band has become known for putting on an entertaining show."},{"date":"2022-06-03T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiNDM5YWQ3ZTItNjZjYS00YjRiLTgxNWYtNjI2ZDViNDg1ZDViIiwiZWRpdHMiOnt9fQ==","title":"UMI, Forest in the City Tour","url":"https://wl.seetickets.us/event/UMI/471957?afflky=GreatAmericanMusicHall","details":" On Sale Fri, 3/18 @ 10am!\n$35 ADV | $89 VIP\nDoors 7pm / Show 8pm \nUMI is a 23-year-old Seattle native pioneering a new sound rooted in R\u0026B and neo-soul - Her artistry manifests itself through her honest lyrics and healing sonics, which gives listeners a personal connection to UMI and her music. The energy of her artistry is a reflection of her personality - unique and nostalgic. Currently living in Los Angeles, UMI continues to create genre-bending music that captivates and inspires listeners. "},{"date":"2022-06-04T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiMzdmNTk2NjgtZTQyZS00ZGQxLTk2MjUtZDBiZTRkMTVlMDRkIiwiZWRpdHMiOnt9fQ==","title":"UMI, Forest in the City Tour","url":"https://wl.seetickets.us/event/UMI/472146?afflky=GreatAmericanMusicHall","details":"On sale now!\n$35 ADV | $89 VIP\nDoors 8pm | Show 9pm \nUMI is a 23-year-old Seattle native pioneering a new sound rooted in R\u0026B and neo-soul - Her artistry manifests itself through her honest lyrics and healing sonics, which gives listeners a personal connection to UMI and her music. The energy of her artistry is a reflection of her personality - unique and nostalgic. Currently living in Los Angeles, UMI continues to create genre-bending music that captivates and inspires listeners. "},{"date":"2022-06-07T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiZjcyNzNjMGMtNWM5ZC00NTcxLTlkNmYtYWVhODM1NWY2YzM2IiwiZWRpdHMiOnt9fQ==","title":"Dean Lewis, Sad Boi Winter Summer Tour","url":"https://wl.seetickets.us/event/Dean-Lewis/480937?afflky=GreatAmericanMusicHall","details":"On sale now!\n$30 ADV | $35 DOOR\nDoors 7pm | Show 8pm\nDean Lewis has over 6.1+ billion streams of his music with 3.3M+ albums and Eps sold worldwide. He was welcomed into the Spotify Billions club for his song ‘Be Alright’ and has over 1M YouTube followers and 1.1M Tik Tok followers. His most recent single ‘Falling Up’ is ARIA GOLD accredited in Australia with 57M+ Global Streams. 2019 saw Lewis as an Apple Up Next artist while his tours in the US and Australia were sold out, and he performed shows and festivals in the UK and Europe. He performed over 200 shows that year. In Australia Lewis performed on the mainstage at Splendour in the Grass and performed at the AFL Grand Final. Be Alright has over 3 billion streams and spent 5 weeks at # 1 on the ARIA SINGLES chart. It has been certified 11x platinum in Australia, triple platinum in the U.S.A, platinum in the UK and platinum+ in 22 other countries."},{"date":"2022-06-09T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiNGRjYmEwYTktMWU0NS00ZDMyLWIwY2QtMzkxMjNhODYxMjJmIiwiZWRpdHMiOnt9fQ==","title":"Taj Mahal and Ry Cooder","url":"https://wl.seetickets.us/event/Taj-MahalandRyCooder/470134?afflky=GreatAmericanMusicHall","details":"We are sorry to have to announce that due to an instance of Covid amongst the touring party, the Taj Mahal \u0026 Ry Cooder performances at Great American Music Hall in San Francisco on Thursday, May 19 and Friday, May 20 are unfortunately postponed and have to be rescheduled. \n\nThe new dates for these shows will be Thursday, June 9 and Friday, June 10 2022.\nAll tickets held are transferable and will be accepted for the newly scheduled dates. Tickets for Thursday May 19th will automatically transfer to the new Thursday date on June 9th, and tickets held for the Friday May 20th show, will similarly transfer to the new Friday show date, on June 10th.\n\nAll seat numbers and seat positions will remain the same and will be transferred over to the new date.\nIf you’re unable to attend the rescheduled dates, you may request a refund within 10 days from this announcement (Refund requests will be honored up to June 1st, 2022.)If you have any questions, or need assistance please contact the venue box office directly. \nWe apologize for any inconvenience caused and we look forward to seeing you in June!\n\nTickets on sale Friday, 3/4 @ 10am!\n*This is a FULLY SEATED event*\nGOLD SEATING - $150\nSILVER SEATING - $125\nSTANDARD SEATING - $85 [a small amount of seats may a have partially obstructed view of the stage]\nDoors 7pm Show 8:30pm\nThe city \u0026 county of San Francisco has mandated that we must require all guests to provide proof of full vaccination, OR a negative Covid test. Please read our full FAQ for details on mask \u0026 vaccination requirements before you purchase tickets: https://gamh.com/faqs/\n\n\nTaj Mahal – vocals, harmonica and guitar\nRy Cooder - vocals, guitar, mandolin, and banjo\nJoachim Cooder - percussion, mbira\n\n\n\nRiding with Sonny and Brownie\nTaj Mahal and Ry Cooder’s Get on Board\nNeedle to the groove, before you know it, you’re somewhere: “That whole chugga-chugga-chugga rhythm,” says Taj Mahal, “it carried you.” There was a seductive kind of locomotion, harmonizing and scene-setting that blues musicians Sonny Terry and Brownie McGhee set forth,”could get together.” It worked a spell. Gave you a hint of what was rounding the corner, heading your way.\nWhile a young musician, still tinkering with his sound, Taj Mahal had heard the names “Sonny and Brownie,” in passing conversation, but it wasn’t until he got to the University of Massachusetts in 1961 that a new world cracked open. “It’s when I encountered a whole different level of record recording and collecting that didn’t have anything to do with popular music on the radio. You know labels like Folkways, Prestige, Bluesville, Stinson, Vanguard, all these different companies that were putting out all these records—Pete Seeger, Reverend Gary Davis, Doc Watson. There was this whole movement.” But, in time Taj Mahal saw first-hand, “Brownie McGhee and Sonny Terry were in the middle of this whole thing.”\nLater, when he pulled Sonny Terry’s 1963 album Sonny is King out of its sleeve and gave it a spin, his curiosity only deepened. “I mean this fascinating sound, straight out of the country”—his harmonica’s earthy whoops and hollers, his sustained curving simulation of a train’s echoing whistle. “About that same time both Sonny and Brownie were coming around doing concerts at colleges, small clubs and coffeehouses so I was able to get into that whole thing.” What struck Taj Mahal was the richness, the specificity—of time and place and sentiments that the music, live and on record, preserved. “I was like, look over here. This is a whole world unto itself. The music isn’t disappearing. There are folks who think that it is important enough for it to be here.” Born in Harlem and living in Massachusetts, reflects Taj Mahal, “I might have been ‘up north,’ but I was ‘up south.’”\nOn the other edge of the country, as had become his custom, a twelve-year-old Ry Cooder had boarded two buses, to make his way to a favorite record store, housed in an old California Bungalow at the center of Los Angeles. “It was run by the Fox sisters and they had all of these records. They had a Webcor record player where you could listen. And I saw this ten-inch record with these black and white pictures, and how they laid out the photos.” He was drawn to the story the cover suggested: the musicians’ faces, the liner notes, the title itself, Get on Board, was an invitation. “There was something about the information. It was not processed. It was just something you should know about. And it cost $4.98. I bought it, took it home and it really rocked,” Cooder recalls, “just really swinging and strong. When you’re young and you hear something like that for the first time and if you’re a kid in Santa Monica, well, it was just unbelievable.”\nFor both musicians, Sonny and Brownie were a glimpse onto something vanishing fast—a pathway, both back to the past and, for them creatively, a step forward into their futures.\nBack on Board\nNearly sixty years later, Taj Mahal and Cooder’s twenty-first century re-exploration of Sonny and Brownie’s Get on Board is, in a singular way, a sonic map of all the territory Taj Mahal and Cooder have traveled and of a legacy that they’ve absorbed and now honor.\nSonny Terry, born in Greensboro, Georgia in 1911, learned the basics of the blues harp from his farmer father. After two devastating injuries to his eyes left him blind, he turned to music to scrape together a living, traveling to North Carolina to play the blues. In the mid-1930s he partnered with Blind Boy Fuller (born Fulton Allen), a master of the Piedmont blues-style guitar. “Fuller had the rhythm and the guitar and a good voice,” says Cooder, “and Sonny had his incredible harmonica ability. The Piedmont rhythm was distinct. That area, the Carolinas, with players like Reverend Gary Davis, Blind Boy Fuller, Blind Blake, they all have this finger-picking style, and this kind of dance rhythm that was popular.”\nTogether, they were powerful, says Cooder, “With Sonny, the other side of the duet is like a jazz band almost, it’s like an orchestra. So you had a real performance.” But Fuller died in 1941, leaving Sonny to find another accompanist, and that he found in McGhee, Tennessee-born, but steeped in the music of the region, and particularly fluid in Fuller’s style.\n“The format was the same. the same idea, rhythm guitar, lead harmonica trading voice singing and harmony,” says Cooder, “same fingerpicking sound. “Brownie just stepped into his shoes and went on with it. Same basic style.”\nAs Taj Mahal reflects, “It was a matched pair. Two musicians who really knew how to play along. I mean, Brownie gave the great rhythm to whatever Sonny was playing on the harmonica, and they both grew to command of the idiom. And the tunes I mean, they’re coming in from the ‘20s and the ‘30s. They’re carrying that forward. That history. They were the young boys back then. They were learning from the older people. All the different kinds of songs.” This was critical. Even though some of those songs were beginning to be recorded by some players, says Taj Mahal, “They weren’t really popularly known by everybody. Sonny and Brownie changed that. They’d become the titans of the folk- blues.”\nNew Territories\nWhen Get on Board was released in 1953 by Folkways, it was one of the label’s earlier offerings. “But by that time the duo had made a huge leap to New York. I mean huge,” says Cooder, “It’s one thing for someone like an Earl Hines to go in and do what he wants, but these guys are country guys. And it worked! Once Folkways’ producer Moe Asch got a hold of them, they became part of the scene, along with the Almanac Singers and Pete Seeger and Woody Guthrie. They found themselves in front of white nightclub audiences in New York. That’s what launched them into this early folk revival and this idea, as Pete Seeger put forward, was to bring people together, shoulder to shoulder.”\nIn a sense, says Taj Mahal, looking back, that music, even more, his circuitous path to learning and understanding the breadth and depth of it, is what brought him together with Cooder all those years ago. It was all part of an essential soundscape.\n“You know, it was the fountain that both of us drank from deeply,” says Taj Mahal. “Ry is the central reason I came to California. I came here to find him. I’d heard from other musicians who’d taken lessons from him, saying ‘he’s hearing the music.’” How Taj Mahal interpreted this was that Cooder shared both a curiosity and adroitness. “Ry had gotten this same message too, from the older musicians. It’s not just knowing the notes. You just had to hear it for what it really is. And deliver that. Deliver it correctly and with respect.”\nAfter their brief collaboration in the short-lived band Rising Sons ended in 1966, Cooder and Taj Mahal kept moving—charting separate courses, traveling the country and the world.\nIt wouldn’t be until 2014 that the two would play together on the same stage once more. Taj Mahal was to receive a lifetime achievement award from the Americana Music Association. “I was going down to Nashville to accept the award. A communique came through the office from Ry that he was part of the band and wanted to know what I was going to do. Well, maybe I’ll play a tune like ‘Lovin’ in My Baby’s Eyes,” or something like that, more fitting for the Ryman Auditorium. But Ry shot back: ‘Oh, well, why don’t we just stomp ‘em down?’ And from Ry I knew that that meant ‘Statesboro Blues.’ A tune from the Rising Son days. So that’s what we ended up playing.”\nThat opened a line of conversation. They would interact sporadically, hear tell of a sighting, “And a little bit after that we started sending music back and forth that we like, not irregularly,” says Taj Mahal “And at some point, you know, I think both of us talked about, ‘Well, hey, man, what do you think about doing something?’”\nAbout a year before the pandemic, Cooder says, “Taj had come to the house, and we played. It didn’t seem to be about anything specific, but it got me thinking. Then my son, Joachim said, ‘You really should do something with him’. And I usually try to do what Joachim says.”\nFinally, it came to him, while working in the garden, hands in the earth. In certain respects, the answer was hiding in plain sight: “It’s Brownie and Sonny for sure.” It’s territory they knew, musicians they revered and tunes that were foundational, rooted deep. “We can pull that off. I figured Taj can play into that role. He understands it and can make the combination of the guitar and the harmonica operate,” Ideas started to take real shape, even a feeling. “My thought was, if we can’t do this now, we have no business in the business.” \n“Stomping it down”\nLate summer 2021, tunes sorted, a plan in play, Taj Mahal arrived in Southern California where he and Cooder set up for recording in Joachim’s Altadena living room. Stripped down and simple: Taj on guitar, harmonicas, and piano; Ry on guitar, mandolin, banjo; and Joachim on percussion and bass. Three days, eleven songs, and more than fifty years between the last recording session and this one.\nFor the occasion, Taj Mahal brought along a custom-made guitar, “A Keb’ Mo’ special” as well as “a couple of low harps. It almost sounds like an accordion. Just to bring something bigger.”\nCooder pulled out Mike Seeger’s finger picks and an old guitar, much like the one Brownie McGhee once played, “Very similar, probably a similar year. I’d had it for about five years because I thought someday, I might need to be Brownie.”\nOnce they leaped in, says Taj Mahal, it was like no time had passed. “Here we were, putting things together again. It’s what we acquired, you know, where we’ve been and what got imprinted. All that information that came to those guys, Sonny and Brownie? Now we’ve got it and we have to take it forward.”\nThis opportunity was a glimpse onto something, says Cooder. “You look at someone like Sonny Terry and know, nobody can ever be that good again. It’s impossible.”\nAnd yet, reflects Taj Mahal, sinking back into this rich repertoire—one that acknowledges struggle and sorrow, revelry and resistance—underscored something essential: “There are basic things in our culture that connect us, that allow us to be able to reach back and connect to a history of people, the things that nourish us as a people, and music, this music is one of those things.”\nIt’s all landscape, soundscape, and memory speeding by at a clip, “And this becomes a little window onto something,” says Cooder. “Something that’s long gone, never to be re-created. You can’t have a lot of things again. But with music—that music—it can happen again, when you put the needle down.”\n—Lynell George"},{"date":"2022-06-10T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiZDQyNzM2ZDEtMDQ0ZC00N2Y3LThmN2QtMjA0ZDE4NWE1YzIyIiwiZWRpdHMiOnt9fQ==","title":"Taj Mahal and Ry Cooder","url":"https://wl.seetickets.us/event/Taj-MahalandRyCooder/470169?afflky=GreatAmericanMusicHall","details":"We are sorry to have to announce that due to an instance of Covid amongst the touring party, the Taj Mahal \u0026 Ry Cooder performances at Great American Music Hall in San Francisco on Thursday, May 19 and Friday, May 20 are unfortunately postponed and have to be rescheduled. \n\nThe new dates for these shows will be Thursday, June 9 and Friday, June 10 2022.\nAll tickets held are transferable and will be accepted for the newly scheduled dates. Tickets for Thursday May 19th will automatically transfer to the new Thursday date on June 9th, and tickets held for the Friday May 20th show, will similarly transfer to the new Friday show date, on June 10th.\n\nAll seat numbers and seat positions will remain the same and will be transferred over to the new date.\nIf you’re unable to attend the rescheduled dates, you may request a refund within 10 days from this announcement (Refund requests will be honored up to June 1st, 2022.)If you have any questions, or need assistance please contact the venue box office directly. \nWe apologize for any inconvenience caused and we look forward to seeing you in June!\n\nTickets on sale Friday, 3/4 @ 10am!\n*This is a FULLY SEATED event*\nGOLD SEATING - $150\nSILVER SEATING - $125\nSTANDARD SEATING - $85 [a small amount of seats may a have partially obstructed view of the stage]\nDoors 7pm Show 8:30pm\nThe city \u0026 county of San Francisco has mandated that we must require all guests to provide proof of full vaccination, OR a negative Covid test. Please read our full FAQ for details on mask \u0026 vaccination requirements before you purchase tickets: https://gamh.com/faqs/\n\n\nTaj Mahal – vocals, harmonica and guitar\nRy Cooder - vocals, guitar, mandolin, and banjo\nJoachim Cooder - percussion, mbira\n\n\nRiding with Sonny and Brownie\nTaj Mahal and Ry Cooder’s Get on Board\nNeedle to the groove, before you know it, you’re somewhere: “That whole chugga-chugga-chugga rhythm,” says Taj Mahal, “it carried you.” There was a seductive kind of locomotion, harmonizing and scene-setting that blues musicians Sonny Terry and Brownie McGhee set forth,”could get together.” It worked a spell. Gave you a hint of what was rounding the corner, heading your way.\nWhile a young musician, still tinkering with his sound, Taj Mahal had heard the names “Sonny and Brownie,” in passing conversation, but it wasn’t until he got to the University of Massachusetts in 1961 that a new world cracked open. “It’s when I encountered a whole different level of record recording and collecting that didn’t have anything to do with popular music on the radio. You know labels like Folkways, Prestige, Bluesville, Stinson, Vanguard, all these different companies that were putting out all these records—Pete Seeger, Reverend Gary Davis, Doc Watson. There was this whole movement.” But, in time Taj Mahal saw first-hand, “Brownie McGhee and Sonny Terry were in the middle of this whole thing.”\nLater, when he pulled Sonny Terry’s 1963 album Sonny is King out of its sleeve and gave it a spin, his curiosity only deepened. “I mean this fascinating sound, straight out of the country”—his harmonica’s earthy whoops and hollers, his sustained curving simulation of a train’s echoing whistle. “About that same time both Sonny and Brownie were coming around doing concerts at colleges, small clubs and coffeehouses so I was able to get into that whole thing.” What struck Taj Mahal was the richness, the specificity—of time and place and sentiments that the music, live and on record, preserved. “I was like, look over here. This is a whole world unto itself. The music isn’t disappearing. There are folks who think that it is important enough for it to be here.” Born in Harlem and living in Massachusetts, reflects Taj Mahal, “I might have been ‘up north,’ but I was ‘up south.’”\nOn the other edge of the country, as had become his custom, a twelve-year-old Ry Cooder had boarded two buses, to make his way to a favorite record store, housed in an old California Bungalow at the center of Los Angeles. “It was run by the Fox sisters and they had all of these records. They had a Webcor record player where you could listen. And I saw this ten-inch record with these black and white pictures, and how they laid out the photos.” He was drawn to the story the cover suggested: the musicians’ faces, the liner notes, the title itself, Get on Board, was an invitation. “There was something about the information. It was not processed. It was just something you should know about. And it cost $4.98. I bought it, took it home and it really rocked,” Cooder recalls, “just really swinging and strong. When you’re young and you hear something like that for the first time and if you’re a kid in Santa Monica, well, it was just unbelievable.”\nFor both musicians, Sonny and Brownie were a glimpse onto something vanishing fast—a pathway, both back to the past and, for them creatively, a step forward into their futures.\nBack on Board\nNearly sixty years later, Taj Mahal and Cooder’s twenty-first century re-exploration of Sonny and Brownie’s Get on Board is, in a singular way, a sonic map of all the territory Taj Mahal and Cooder have traveled and of a legacy that they’ve absorbed and now honor.\nSonny Terry, born in Greensboro, Georgia in 1911, learned the basics of the blues harp from his farmer father. After two devastating injuries to his eyes left him blind, he turned to music to scrape together a living, traveling to North Carolina to play the blues. In the mid-1930s he partnered with Blind Boy Fuller (born Fulton Allen), a master of the Piedmont blues-style guitar. “Fuller had the rhythm and the guitar and a good voice,” says Cooder, “and Sonny had his incredible harmonica ability. The Piedmont rhythm was distinct. That area, the Carolinas, with players like Reverend Gary Davis, Blind Boy Fuller, Blind Blake, they all have this finger-picking style, and this kind of dance rhythm that was popular.”\nTogether, they were powerful, says Cooder, “With Sonny, the other side of the duet is like a jazz band almost, it’s like an orchestra. So you had a real performance.” But Fuller died in 1941, leaving Sonny to find another accompanist, and that he found in McGhee, Tennessee-born, but steeped in the music of the region, and particularly fluid in Fuller’s style.\n“The format was the same. the same idea, rhythm guitar, lead harmonica trading voice singing and harmony,” says Cooder, “same fingerpicking sound. “Brownie just stepped into his shoes and went on with it. Same basic style.”\nAs Taj Mahal reflects, “It was a matched pair. Two musicians who really knew how to play along. I mean, Brownie gave the great rhythm to whatever Sonny was playing on the harmonica, and they both grew to command of the idiom. And the tunes I mean, they’re coming in from the ‘20s and the ‘30s. They’re carrying that forward. That history. They were the young boys back then. They were learning from the older people. All the different kinds of songs.” This was critical. Even though some of those songs were beginning to be recorded by some players, says Taj Mahal, “They weren’t really popularly known by everybody. Sonny and Brownie changed that. They’d become the titans of the folk- blues.”\nNew Territories\nWhen Get on Board was released in 1953 by Folkways, it was one of the label’s earlier offerings. “But by that time the duo had made a huge leap to New York. I mean huge,” says Cooder, “It’s one thing for someone like an Earl Hines to go in and do what he wants, but these guys are country guys. And it worked! Once Folkways’ producer Moe Asch got a hold of them, they became part of the scene, along with the Almanac Singers and Pete Seeger and Woody Guthrie. They found themselves in front of white nightclub audiences in New York. That’s what launched them into this early folk revival and this idea, as Pete Seeger put forward, was to bring people together, shoulder to shoulder.”\nIn a sense, says Taj Mahal, looking back, that music, even more, his circuitous path to learning and understanding the breadth and depth of it, is what brought him together with Cooder all those years ago. It was all part of an essential soundscape.\n“You know, it was the fountain that both of us drank from deeply,” says Taj Mahal. “Ry is the central reason I came to California. I came here to find him. I’d heard from other musicians who’d taken lessons from him, saying ‘he’s hearing the music.’” How Taj Mahal interpreted this was that Cooder shared both a curiosity and adroitness. “Ry had gotten this same message too, from the older musicians. It’s not just knowing the notes. You just had to hear it for what it really is. And deliver that. Deliver it correctly and with respect.”\nAfter their brief collaboration in the short-lived band Rising Sons ended in 1966, Cooder and Taj Mahal kept moving—charting separate courses, traveling the country and the world.\nIt wouldn’t be until 2014 that the two would play together on the same stage once more. Taj Mahal was to receive a lifetime achievement award from the Americana Music Association. “I was going down to Nashville to accept the award. A communique came through the office from Ry that he was part of the band and wanted to know what I was going to do. Well, maybe I’ll play a tune like ‘Lovin’ in My Baby’s Eyes,” or something like that, more fitting for the Ryman Auditorium. But Ry shot back: ‘Oh, well, why don’t we just stomp ‘em down?’ And from Ry I knew that that meant ‘Statesboro Blues.’ A tune from the Rising Son days. So that’s what we ended up playing.”\nThat opened a line of conversation. They would interact sporadically, hear tell of a sighting, “And a little bit after that we started sending music back and forth that we like, not irregularly,” says Taj Mahal “And at some point, you know, I think both of us talked about, ‘Well, hey, man, what do you think about doing something?’”\nAbout a year before the pandemic, Cooder says, “Taj had come to the house, and we played. It didn’t seem to be about anything specific, but it got me thinking. Then my son, Joachim said, ‘You really should do something with him’. And I usually try to do what Joachim says.”\nFinally, it came to him, while working in the garden, hands in the earth. In certain respects, the answer was hiding in plain sight: “It’s Brownie and Sonny for sure.” It’s territory they knew, musicians they revered and tunes that were foundational, rooted deep. “We can pull that off. I figured Taj can play into that role. He understands it and can make the combination of the guitar and the harmonica operate,” Ideas started to take real shape, even a feeling. “My thought was, if we can’t do this now, we have no business in the business.” \n“Stomping it down”\nLate summer 2021, tunes sorted, a plan in play, Taj Mahal arrived in Southern California where he and Cooder set up for recording in Joachim’s Altadena living room. Stripped down and simple: Taj on guitar, harmonicas, and piano; Ry on guitar, mandolin, banjo; and Joachim on percussion and bass. Three days, eleven songs, and more than fifty years between the last recording session and this one.\nFor the occasion, Taj Mahal brought along a custom-made guitar, “A Keb’ Mo’ special” as well as “a couple of low harps. It almost sounds like an accordion. Just to bring something bigger.”\nCooder pulled out Mike Seeger’s finger picks and an old guitar, much like the one Brownie McGhee once played, “Very similar, probably a similar year. I’d had it for about five years because I thought someday, I might need to be Brownie.”\nOnce they leaped in, says Taj Mahal, it was like no time had passed. “Here we were, putting things together again. It’s what we acquired, you know, where we’ve been and what got imprinted. All that information that came to those guys, Sonny and Brownie? Now we’ve got it and we have to take it forward.”\nThis opportunity was a glimpse onto something, says Cooder. “You look at someone like Sonny Terry and know, nobody can ever be that good again. It’s impossible.”\nAnd yet, reflects Taj Mahal, sinking back into this rich repertoire—one that acknowledges struggle and sorrow, revelry and resistance—underscored something essential: “There are basic things in our culture that connect us, that allow us to be able to reach back and connect to a history of people, the things that nourish us as a people, and music, this music is one of those things.”\nIt’s all landscape, soundscape, and memory speeding by at a clip, “And this becomes a little window onto something,” says Cooder. “Something that’s long gone, never to be re-created. You can’t have a lot of things again. But with music—that music—it can happen again, when you put the needle down.”\n—Lynell George"},{"date":"2022-06-12T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiZTJjZmU5OTctMDVhNi00NmY5LWJlN2YtZDM2Y2NiZWYyODVjIiwiZWRpdHMiOnt9fQ==","title":"Lingua Ignota presents “SINNER GET READY”","url":"https://wl.seetickets.us/event/Lingua-IgnotapresentsSINNERGETREADY/471448?afflky=GreatAmericanMusicHall","details":" On sale now!\n$28 ADV / $33 DOOR\nDoors 7pm / Show 8pm\nKristen Hayter, the classically trained multi-instrumentalist, performance artist, and vocalist known as Lingua Ignota is set to release her third full-length and Sargent House debut, SINNER GET READY. A graduate of the School of the Art Institute of Chicago with an MFA in Literary Art from Brown University, much of Hayter’s work is centralized around abuse. A survivor of domestic abuse for much of her life, her music seeks to explore survivor hood of abuse through the vantage point of rage and despair in leu of common approaches she views as \"enforced patriarchal models of civilized femininity\". The follow up to her critically acclaimed break out CALIGULA, SINNER GET READY is an abrasive, unsettling portrait of devotion and betrayal, judgment and consequence, set in the derelict landscape of rural Pennsylvania, a neglected region deeply embedded with a particular god-fearing brand of Christianity, and where Hayter currently lives.\nWith SINNER GET READY, Hayter continues to build on the mythology she has created with CALIGULA and ALL BITCHES DIE but renegotiates and dismantles her own aesthetic language. She abandons any previous industrial grandeur and multi-genre approach, instead focusing on creating dissonance with traditional instruments of the Appalachian region, otherworldly vocals and congregational polyphony, subverting American primitive forms with avant-garde techniques and nods to modern composition. Lyrics and melodic motifs from past work reappear in unexpected ways, mirroring the repetition of cognitive patterns, the trappings of a lonely cycle.\nLyrically, Hayter’s distinctive ability to weave the allegorical with personal tragedy is further refined, as intimate lamentations on abandonment and loneliness are carefully braided with references to Mennonite treatises (“MAN IS LIKE A SPRING FLOWER”), calls to repent written on barns in Amish Country (REPENT NOW CONFESS NOW), illuminated manuscripts from ascetic religious sects in the monastic cloisters of Ephrata (THE ORDER OF SPIRITUAL VIRGINS, THE SOLITARY BRETHREN OF EPHRATA), and lore of the Pennsylvania Dutch. Songs are rich with duality. “PENNSYLVANIA FURNACE” is a liebestod ruminates on the inevitability of God’s judgment, evoking the legend of an 18th century ironmaster whose dogs return to drag him down to hell after he throws them all into his furnace in a rage. “PERPETUAL FLAME OF CENTRALIA” is a quiet meditation on one of the major lyrical motifs of the record, the blood of Jesus; that which can “wash and cleanse every stain,” as tearfully expressed by disgraced evangelist Jimmy Swaggart in a televised confession sampled on the previous song “THE SACRED LINAMENT OF JUDGMENT”. “PERPETUAL FLAME”, named after an abandoned mining town where fire has been burning underground since 1962, opens with an interview with the prostitute that brought Swaggart’s indiscretions to the surface. It serves as a warning, deceptive in its beauty.\nSINNER GET READY was created with Hayter's primary collaborator, producer, and engineer Seth Manchester at Machines With Magnets in Rhode Island, with additional arrangements and performances from multi-instrumentalist and composer Ryan Seaton, and banjo-playing from J. Mamana. Otherwise, it is a solitary endeavor, where the listener is very much forced to contend with Hayter; raw, haggard, and alone."},{"date":"2022-06-14T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiOWUzOWRmMjYtNTY1NS00NGU4LTk4ODMtNWIxYTRhOGM4OWIyIiwiZWRpdHMiOnt9fQ==","title":"Tim Bluhm and The Coffis Brothers","url":"https://wl.seetickets.us/event/Tim-BluhmandTheCoffisBrothers/474238?afflky=GreatAmericanMusicHall","details":"Tim Bluhm and The Coffis Brothers’ performance at the Great American Music Hall on June 10th, 2022 has been postponed to June 14th, 2022. All original tickets will be honored and no exchange is necessary. If you would like a refund, please contact your point of purchase by May 30th, 2022.\n\nOn sale Fri, 3/25 @ 10am!\n$22 ADV | $25 DOOR\nDoors 8pm | Show 9pm\nIn one brief, excruciating instant, Tim Bluhm’s life changed forever. The acclaimed songwriter and avid outdoorsman was speed flying (a more intense version of paragliding) down a California mountainside when he lost control and crashed, slamming feet-first into a pile of felled trees at roughly 35 miles-per-hour. The force of the impact snapped his ankle in half and nearly tore his foot from his leg. By the time his body finally came to rest, his pelvis was completely shattered. While Bluhm was lucky to be alive, he faced a daunting road to recovery, one that required him to be bedridden for the better part of a year as he underwent more than a dozen surgeries. It was the kind of traumatic injury that could easily end a career, but for Tim Bluhm, it was more like a second chance.\n\n“It changed my outlook on life and it changed my whole self-image,” says Bluhm, a California native best known as a frontman for the legendary The Mother Hips. “It was a humbling thing to be physically incapacitated like that, and it was a reminder of just how fragile we all are. I’m more grateful than ever to be alive right now.”\n\nBluhm began his musical journey while studying at Chico State, where he co-founded the now-iconic Mother Hips, a group the San Francisco Chronicle has hailed as “one of the Bay Area’s most beloved live outfits.” Performing at frat parties quickly gave way to club shows, regional touring, and national buzz, and before they’d graduated from school, Bluhm and his bandmates were signed to Rick Rubin’s American Recordings on the strength of their debut album, ‘Back To The Grotto.’ Over the ensuing two-and-a-half decades, Bluhm would release eight more studio albums with the band as they cemented their status as architects of a new breed of California soul and earned a reputation as festival and critical favorites, sharing bills with everyone from Johnny Cash and Wilco to Lucinda Williams and The Black Crowes along the way. Rolling Stone called them “divinely inspired,” while Pitchfork praised their “rootsy mix of 70s rock and power pop,” and The New Yorker lauded their ability to “sing it sweet and play it dirty.”\n\nEver-curious and wildly prolific, Bluhm simultaneously released a slew of his own solo and collaborative projects on the side. He toured for years as music director with Nicki Bluhm \u0026 The Gramblers, teamed up with The Grateful Dead’s Mickey Hart and Bill Kreutzmann among others, and opened up Mission Bells Studio with fellow California favorite Jackie Greene and engineer Dave Simon-Baker. There, Bluhm produced albums for everyone from the Hips and Greene to Hot Buttered Rum and Little Wings in addition to hosting Phil Lesh, Josh Ritter, Rogue Wave, Los Lobos, Jonathan Richman, and more. As if that wasn’t enough to keep him busy, in 2007, Bluhm and the Hips launched the Hipnic, an intimate and immaculately-curated music festival that’s still held annually amongst the towering redwoods of Big Sur.\n\nIt’s no coincidence that Bluhm chose a spot like Big Sur for the festival. He’s always drawn strength and inspiration from nature (rock climbing, surfing, and backcountry skiing have long numbered among his favorite activities), but the accident left him a prisoner in his own body for extended periods of time, physically unable to perform even the simplest tasks. Rather than mourn the loss of his old life, though, Bluhm learned to develop a new appreciation for the rich world inside his own mind.\n\n“For the first three or four months, I couldn’t move,” he remembers. “I couldn’t walk, I couldn’t read a book, I couldn’t even roll over in bed because of my injuries. But as I got used to my new condition, my brain got back to its normal self and I realized I was able to start putting songs together again. In a way, I look at it as almost a nudge from some higher power telling me to look inwards and pay more attention to my musical gifts.”\n\nBluhm signed with Blue Rose Music’s Joe Poletto from the hospital, and upon his release, headed into the studio to cut a new record of his own.\n\n“It’s liberating to be on a label that supports you making the best possible art that you can,” he reflects."}]