[{"date":"2022-05-30T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiNTIyMjVkNTgtOGM5My00ODNmLTlkZjYtZTJiNmMzY2Y3ZmJjIiwiZWRpdHMiOnt9fQ==","title":"RX Bandits, Monday, May 30, 2022","url":"https://wl.seetickets.us/event/RX-Bandits/472123?afflky=GreatAmericanMusicHall","details":" On sale Fri, 3/18 @ 10am!\n$25 ADV | $30 DOOR\nDoors 7pm | Show 8pm\nRXBANDITS will resume their musical campaign after another hiatus following their OC House Of Blues performance in January of 2020. Two decades of destroying and rebuilding musical genres into a unique energy exchange between audience and band has shaped the band's motivation for live performances; anyone who has been to an RX show knows this and feels it deeply. After surviving multiple periods of chaos and disarray which nearly ended the band, RXBANDITS are stronger than ever and ready to bring their highly interactive live show to you and leave it all on the stage and in your hearts. "},{"date":"2022-05-31T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiMGFkODZjZTctMTQyMC00N2Q3LWIzODEtYzIzYjU3MTNjZjY0IiwiZWRpdHMiOnt9fQ==","title":"Ricky Montgomery, Back In Business Tour","url":"https://wl.seetickets.us/event/Ricky-Montgomery/467469?afflky=GreatAmericanMusicHall","details":"Tickets on sale Friday, 2/18 @ 10am!\n$25 ADV / $30 DOORS\nDoors 7pm / Show 8pm\n\nRicky Montgomery's music was ahead of its time -- literally. Four years after the release of his debut album, and a decade after he wrote some of it, the Los Angeles native's indie-pop has been a balm in the midst of a heavy time, comforting listeners with warm melodies and relatable lyrics. It all started in July of 2020, when a pair of singles from 2016's Montgomery Ricky -- the gently swaying \"Mr Loverman\" and string-soaked stunner \"Line Without a Hook\" -- took off on TikTok. \"I think because we had a really traumatizing year, these songs kind of found a moment,\" Montgomery says. \"Because they're all, in their own way, about traumas in my life.\"\n\nNow, with a fan base that's all caught up, Montgomery is sitting on a trove of new music built on this now-familiar foundation: \"Mr. Loverman\" pairs intense family strife with soft acoustic strums that build to a rousing sing-along chorus; \"Line Without a Hook\" rocks a bit heavier, with strings and power-pop riffs weaving around cathartic one-liners that speak to the jumble that is one's coming of age. He balances melancholy with a touch of sweet humor and loads of humanity. It's no wonder these songs have racked up more than 210M streams so far, landing simultaneously on the Spotify 200 and Spotify Viral 50 charts -- a feat few artists can claim -- with over 50 entries worldwide. As of early 2021, Montgomery's catalog was picking up 15M global streams weekly.\n\nMontgomery began honing his singing and songwriting chops at age 14, shortly after moving from L.A. to Missouri. To flee the culture shock, he went underground, literally, shuffling through various bands in the suburban basements of West St. Louis County. \"Music was just an escape from everything,\" he says. \"It was a way to go into myself and figure out how to have fun on my own.\" In college, he found the fun he was looking for -- and his first viral audience -- on the now-defunct Vine platform, interspersing comedic bits with intimate music performances.\n\nBut in the summer of 2014, he released his debut EP, Caught on the Moon, and found himself climbing iTunes' Rock and Alternative charts. His yearning to move back to the West Coast was palpable in those songs, and he knows it. \"At the time, I defined my personality around wanting to leave Missouri,\" he admits. \"It was almost obsessive for me.\" The success gave him the excuse. He dropped out, hightailed it to his hometown, and released Montgomery Ricky.\n\nOf course, music careers in L.A. are rarely so simple. When things didn't exactly take off, Montgomery swerved into The Honeysticks, a side project with a childhood friend meant to be an outlet for experimentation. In 2018, he took a year off of music. And by the summer of 2020, he was considering quitting entirely. Then the seemingly impossible -- yet somehow inevitable -- happened: Suddenly people were finding solace in his songs. Now, he's using that momentum to prepare for the release of new music on Warner Records. While the songs will certainly be updated, Montgomery's sincere songwriting will continue to shine through. \"I just want to create something that can feel as special for other people as it is to me,\" he says."},{"date":"2022-06-02T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiYzkwMjE1Y2ItNzZhYy00ZmI4LTgzNDItNGI0N2VkYWI0ZTg5IiwiZWRpdHMiOnt9fQ==","title":"Vundabar, Runnner","url":"https://wl.seetickets.us/event/Vundabar/452950?afflky=GreatAmericanMusicHall","details":"The Vundabar performance at Great American Music Hall on March 7, 2022 has postponed to June 2, 2022. Your ticket will be honored at the door and no exchange is necessary. If you would like a refund, please contact your point of purchase by Friday, February 18. Refund requests received after Friday, February 18 will not be honored.\nOn Sale: Friday, 11/12 @ 7 AM PST\n$20 ADV / $25 DOOR\nDoors 7pm / Show 8pm\nThere's somewhat of a paradox inherent in Vundabar's songwriting - a conflicting sense of nostalgia contrasted with the realization that they couldn't sound more current. The music they make feels like something that should have been heard a long time ago, while simultaneously continuing to forge ahead sonically. Vundabar's high energy live show is the stand out quality of this band and is an art they’ve undoubtedly perfected by touring non-stop around the country. Vundabar’s shows never fail to be captivating, complete with infectious jams, guitar moves galore, intricate drum work, and humorous stage banter to top it all off, the band has become known for putting on an entertaining show."},{"date":"2022-06-03T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiNDM5YWQ3ZTItNjZjYS00YjRiLTgxNWYtNjI2ZDViNDg1ZDViIiwiZWRpdHMiOnt9fQ==","title":"UMI, Forest in the City Tour","url":"https://wl.seetickets.us/event/UMI/471957?afflky=GreatAmericanMusicHall","details":" On Sale Fri, 3/18 @ 10am!\n$35 ADV | $89 VIP\nDoors 7pm / Show 8pm \nUMI is a 23-year-old Seattle native pioneering a new sound rooted in R\u0026B and neo-soul - Her artistry manifests itself through her honest lyrics and healing sonics, which gives listeners a personal connection to UMI and her music. The energy of her artistry is a reflection of her personality - unique and nostalgic. Currently living in Los Angeles, UMI continues to create genre-bending music that captivates and inspires listeners. "},{"date":"2022-06-04T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiMzdmNTk2NjgtZTQyZS00ZGQxLTk2MjUtZDBiZTRkMTVlMDRkIiwiZWRpdHMiOnt9fQ==","title":"UMI, Forest in the City Tour","url":"https://wl.seetickets.us/event/UMI/472146?afflky=GreatAmericanMusicHall","details":"On sale now!\n$35 ADV | $89 VIP\nDoors 8pm | Show 9pm \nUMI is a 23-year-old Seattle native pioneering a new sound rooted in R\u0026B and neo-soul - Her artistry manifests itself through her honest lyrics and healing sonics, which gives listeners a personal connection to UMI and her music. The energy of her artistry is a reflection of her personality - unique and nostalgic. Currently living in Los Angeles, UMI continues to create genre-bending music that captivates and inspires listeners. "}]