[{"date":"2022-06-03T00:00:00.000+00:00","title":"BELLE \u0026 SEBASTIAN, Tennis Thee Sacred Souls","url":"https://thegreekberkeley.com/events/belle-and-sebastian-220603","img":"https://thegreekberkeley.com/wp-content/uploads/2022/03/bellesebastian-press-photo_1024.jpg","details":"BELLE \u0026 SEBASTIAN\nA Bit of Previous is the tenth studio album by Belle and Sebastian and their first full-length in seven years. This may be surprising to anyone following the recent life pursuits of the Glasgow 7-piece: The Boaty Weekender – a 3000 capacity star-studded four-day music festival on a cruise liner sailing the Mediterranean; a trilogy of EP’s; a soundtrack for the directorial debut of The Inbetweeners’ Simon Bird; a live album showcasing the band’s present-day iteration as savvy main stage entertainers; and in 2020 a collaborative project with fans called ‘Protecting The Hive’. But in all these idiosyncratic endeavours, as intrinsic to the band’s DNA as the stage invasion at the end of each of their shows, a full-length has eluded us.\nA Bit Of Previous is a classic Belle and Sebastian album preoccupied with songs and melodies that won’t leave your head and lyrics that can make you smile and ponder and sometimes be melancholic. It’s an album self-produced and recorded by Belle and Sebastian (with contributions from Brian McNeill, Matt Wiggins, Kevin Burleigh and Shawn Everett) and their most hands-on since The Boy With The Arab Strap.\nIn some respects, A Bit Of Previous is also a first. It’s the first album the band recorded in their native Glasgow in 20 years (the last being 2000’s Fold Your Hands Child, You Walk Like a Peasant). What started off as a pandemic necessity – having to ditch plans to record in California in spring of 2020 – became a refreshing change of pace. Unbeholden to restrictive and expensive studio schedules, it allowed for long walks through the streets and parks of Glasgow and spontaneous train journeys to nearby towns which embedded proceedings with a peculiar sense of place. The band upgraded their practice space to a makeshift studio, making some creative interior design choices to keep it pandemic safe.\nA Bit of Previous is Belle and Sebastian taking on age and getting older and emerging all the more vital for it. ‘Young And Stupid’ is a stuttering acoustic rocker that without its lilting violin might be mistaken for a T. Rex song, the lyrics and nonchalant vocals facing the passage of time with wry ennui: “Now we’re old with creaking bones / Some with partners some alone  / Some with kids and some with dogs  / Getting through the nightly slog / Everything is fine when you’re young and stupid”. ‘Come On Home’, with its fireside piano and conversational exchanges between Murdoch and Martin, evokes a handing over of the generational baton with a call to “Give a chance to the old / Set the record straight on the welfare state / Give a chance to the young / Everyone deserves a life in the sun”.\nWhile the arrangements are often playful, there is an underlying gravity. The deceptively feelgood, choir backed ‘If They’re Shooting At You’ reads like a poignant ode to defiance and survival: ‘If they’re shooting at you kid / You must be doing something right”. On Martin’s ‘Reclaim The Night’, a jaunty backbeat tells of a cross-generational everywoman trepidation that in 2022 is more pertinent than ever.\nA Bit of Previous is also scattered with big, occasionally delirious pop moments. ‘Unnecessary Drama’ rips through a cacophony of overdriven riffs and a droning harmonica that borders on the unhinged and is one of the band’s heaviest outings since, well, ever. The 140+ bpm ’Talk To Me Talk To Me’ is ablaze with euro synths and keyboard horns as the voices of Murdoch and Martin intertwine on a breathless chorus. ‘Working Boy in New York City’ exists in a parallel universe where the band did in fact make it to California – such is the escapist bliss of its sloping flute and bittersweet funk.\nOn the other side of the spectrum are some of Belle and Sebastian’s most moving ballads. Tender finger-picked paean to a lover ‘Do It For Your Country’ and doo-wop-inflicted ‘Sea Of Sorrow’ showcase Murdoch’s tenor at its most bare and affecting, while Stevie Jackson contributes lovelorn country waltz ‘Deathbed of My Dreams’.\nSo what is a A Bit of Previous? It’s a bit of everything, and a lot of what makes Belle and Sebastian so special and enduring. It’s a band tackling the insight, experience and responsibility that come with getting older with humour and irreverence and lyrical exactitude and musical bravado. It’s one of the UK’s most beloved pop portraitists asserting themselves as an infallible source of energy and fun.\nThere’s a touch of Buddhism, too, a practice increasingly influential on Murdoch’s outlook in recent years and given a further manifestation via his popular weekly guided online meditation sessions. The album title is possibly a reference to the concept of reincarnation. As Murdoch notes in the liner notes:  “There is a firmly held belief in Buddhism that we have been reborn so many times and in so many guises that if we look around us, we are bound to see a person who has been our mother in a past life. And we are surrounded by people who have been our children. If we truly had that in our minds and in our hearts, we would drop the prejudice we had: our attitude to strangers and difficult people would alter emphatically.”\nTENNIS\nTHEE SACRED SOULS"},{"date":"2022-06-05T00:00:00.000+00:00","title":"REX ORANGE COUNTY","url":"https://thegreekberkeley.com/events/rex-orange-county-220605","img":"https://thegreekberkeley.com/wp-content/uploads/2022/01/waespi_rexoc_press2022_20.jpg","details":"REX ORANGE COUNTY"},{"date":"2022-06-10T00:00:00.000+00:00","title":"ERYKAH BADU, Noname","url":"https://thegreekberkeley.com/events/erykah-badu-220610","img":"https://thegreekberkeley.com/wp-content/uploads/2022/03/ErykahBadu_1024.jpg","details":"ERYKAH BADU\nNONAME\nNoname (born Fatimah Warner) is an American artist from Chicago, Illinois, who blurs the lines of poetry and rap through the music she creates.\nNoname grew up in Bronzeville, a historic neighborhood on the southside of Chicago that famously attracted accomplished black artists and intellectuals of all types. Noname first discovered her love for words while taking a creative writing class as a sophmore in highschool.\nShe became enamored with poetry and spoken word- pouring over Def Poetry Jam clips on YouTube and attending open mics around the city. Noname regularly attended and performed at an open mic at Harold Washington Library- YouMedia’s Lyricist Loft.\nAfter sessions at YouMedia, Noname would participate in cyphers and started getting into freestyling. When she was just a senior in highschool, she placed third in “Louder Than A Bomb”, a poetry competition with 120 Chicago high schools in participation. She remained connected with the artists she met at YouMedia and in 2013, her verse on Chance the Rapper’s “Lost” attracted the beginning of her large fan base, most of whom have been following her every move since.\nOn July 31st Noname released her debut project entitled Telefone which was 3 years in the making and highly anticipated by fans and media alike. Instantly the project gained critical acclaim with a rave review by Pitchfork and landing her praise from major outlets like Rolling Stones, Complex and Dazed \u0026 Confused. Noname has been hailed by The FADER, Complex, and Rolling Stone as one of the most exciting and important new artists of 2016.\nThanks to Telefone’s success, Noname played some shows in support of Ms. Lauryn Hill, who hand-picked Noname to open for her on tour. When first approaching the project, Noname set out to emulate the feeling of talking on the phone with someone for the first time. She describes Telefone as “an introductory conversation with someone you’re interested in”. But as Noname continued to work on the tape, it also transitioned a bit into mortality: the idea of life and death and the duality between those two things."},{"date":"2022-06-11T00:00:00.000+00:00","title":"ALISON WONDERLAND, Mr. Carmack Quiet Bison","url":"https://thegreekberkeley.com/events/alison-wonderland-220611","img":"https://thegreekberkeley.com/wp-content/uploads/2022/01/Alison_wonderland_22_1024.jpg","details":"ALISON WONDERLAND\nAlison Wonderland architects a world of her own design as its chief author, creator, and voice. The Sydney-born and Los Angeles-based singer, producer, songwriter, and DJ realises this vision at the intersection of future-facing pop, explosive beat-craft, and eternal dance rhythms.\nEmerging in 2009 with regular night club sets around Australia and a series of remixes for everyone from Little Dragon to Justin Bieber, she ignited an international splash in 2015 with the full-length debut, Run. It reached gold status in Australia and earned two ARIA Awards nominations, for Best Dance Release and Best Video for “U Don’t Know.” She went on to debut her live set in the US that year at Coachella. Fast forward to 2017, she achieved the Best New Artist honour at the first-ever Electronic Dance Music Awards, while her remix of Dua Lipa’s “New Rules” soared to #1 on the Billboard Dance Charts.\nHer sound has quietly inched towards mainstream ubiquity as the sonic sorceress received the “Highest Female DJ Billing Ever at Coachella,” captured #1 on the Billboard Top Dance/Electronic Albums Chart twice consecutively, headlined sold out arenas around the globe, and clocked upwards of 100 million streams by 2018. Not to mention, Triple J declared that “both sonically and vocally, Awake is Alison’s biggest work to date,” The Music called Alison “an intuitive songwriter, who wires into any sort of emotion,” and Stack Magazine named her an “Industry Leader.” In the US, Billboard gave Awake rave reviews whilst ELLE proclaimed her one of its “Women On The Verge,” and she garnered features from FADER, Glamour, Seventeen, Interview, and more. Simultaneously, Alison’s Radio Wonderland show clocked 5 million-plus iTunes downloads as well as broadcasting to over 20 countries and featuring prominently on the Sirius XM channel Diplo’s Revolution.\nMR. CARMACK\n“Make music like no one’s listening” is the motto of Aaron Carmack, and appropriately so.  His story is a three-part series, divided into factions of past, present, and future. Every element of the past, as Aaron Carmack would explain, has had an effect on who he is today as both a writer/producer and DJ. Being born and raised in San Francisco, attending and dropping out of college in Long Beach, CA, moving to Oahu for three years and living off income from monthly releases on Bandcamp – Carmack’s music is an expression and perpetual reflection of all of it.\nConstantly translating personal experience into his craft, Carmack finds inspiration from a range of sources, from his friends and fellow musicians in production cliques, Team Supreme and Soulection, to his travels and numerous sold out tours of five continents over the past two years, sharing stages with folks like Hudson Mohawke, Just Blaze, Cashmere Cat, and Diplo. These influences, combined with a hunger for discovering the newest, most cutting-edge sounds on sites like Soundcloud, are some of the ingredients to the now-Los Angeles-based producer’s distinct creative process.\nLike a hinge to the doorway between dance music and hip hop, Carmack’s musical output increasingly occupies a void frontier between the two genres, identified by his contemporaries, fans, and himself purely as “Carmack”. With a devotion to the studio and a grinding work ethic, the inventive producer aims to release a prolific amount of music in coming months, all while performing as often as possible. Stay tuned.\nQUIET BISON"},{"date":"2022-06-16T00:00:00.000+00:00","title":"SOFI TUKKER, The Knocks Mary Droppinz","url":"https://thegreekberkeley.com/events/sofi-tukker-220616","img":"https://thegreekberkeley.com/wp-content/uploads/2022/02/approved-photo_horizontal-photo-credit-Elizabeth-Miranda-1.jpg","details":"SOFI TUKKER\nSOFI TUKKER, the genre-defying duo of Sophie Hawley-Weld and Tucker Halpern, is celebrated for their inclusive and global perspective on electronic music as well as their work’s themes of liberation, unity, and self-empowerment. They began daily livestreams at the start of the pandemic, eventually doing hundreds of streams for millions of viewers, becoming the second most live-streamed artist of 2020. The daily livestreams also birthed the Freak Fam, their vibrant fan community that assembles 24/7 online and in-person at Freak Fam meetups spanning the globe. In 2021 SOFI TUKKER dove back into the live world with field-packing, high energy festival sets at Firefly and Outside Lands. Now the group is back with their first headline live tour since their sold-out 2019 run, in support of their new album WET TENNIS, the highly anticipated follow-up to their GRAMMY-nominated debut album Treehouse, out April 29th.\nWET TENNIS is an acronym: When Everyone Tries to Evolve, Nothing Negative Is Safe. WET TENNIS is about forward movement, optimism and positive growth, no matter what the challenge. WET TENNIS is a dedication to constantly evolving and celebrating aliveness. WET TENNIS is a lifestyle. It says: everything’s better when wet. Wetness is excitement, mother nature, movement, flow, sweat, and juice. It’s athletic and elegant. It’s loud and bright. All these qualities will be on full display when SOFI TUKKER comes to town, both on stage and in the audience.\nThe band sums it up best – “We’re overjoyed and proud to be announcing our first headline tour since the world was turned upside down. Over the past few years, the most incredible community was formed out of love, connection, acceptance, and music through our daily livestreams. The time has come to bring us all together in person. This tour is unlike any other we’ve done because it’s with brand new music and production from our upcoming album WET TENNIS and because, this time around, somehow it’s gonna be even crazier because the Freak Fam exists!”\nTHE KNOCKS\nMARY DROPPINZ"}]