[{"date":"2022-05-25T00:00:00.000+00:00","title":"LORD HURON, with special guest Erin Rae","url":"https://thegreekberkeley.com/events/lord-huron-220525","img":"https://thegreekberkeley.com/wp-content/uploads/2022/01/LORDHURON-_22_1024.jpg","details":"LORD HURON\nRecently, those good-time bootscooters known as Lord Huron booked the live room in Whispering Pines for a recordin’ spell. Those boys know what they’re doin’, having made a few records with us. But the live room, this was a first. If you’ve ever recorded at the Pines, then you know nothin’ is off limits. Guitars, cymbals, pianos, pedal steel, mandolins, microphones, saxophones—I was glad to see their hands on all of it. I even heard ’em talk about recordin’ a gigantic string and woodwind orchestra in some dang place like Sweden.\nThe boys filled the air—and my own soul—with those tales of hard luck, heartbreak, and redemption, as if they had become conduits for the spirits of the room and were usin’ them to tap into that cosmic eternal. It was like some long, lost dream come to life, a forgotten classic from a parallel dimension, the echo of a memory that wasn’t mine. But the feelin’ was real.\nI must have drifted off in a cosmic slumber with the tunes janglin’ heavy and happy in my heart. When I woke, the light from the next day was easin’ into the Pines and I was alone. But somethin’ caught my eye: a hand-scratched note bound to a faded vinyl record called “Long Lost.” I brushed the dust off the cover and saw that the artist was none other than Lord Huron. Say, Tubbs, the note read. Time washes aways what man creates, but ‘Long Lost’ might convince you that a note can live on. Be good now.\nAnd just like that, they were gone.\nERIN RAE\nErin Rae, whose genre-fusing mix of traditional folk and indie-rock has landed her collaborations with artists like Margo Price and Andrew Combs—not to mention critical acclaim from some of the world’s top music media, including Rolling Stone, NPR, and the BBC—is finally stepping out into the spotlight with her new album Putting On Airs. The album is out now on Single Lock Records."},{"date":"2022-06-03T00:00:00.000+00:00","title":"BELLE \u0026 SEBASTIAN, Tennis Thee Sacred Souls","url":"https://thegreekberkeley.com/events/belle-and-sebastian-220603","img":"https://thegreekberkeley.com/wp-content/uploads/2022/03/bellesebastian-press-photo_1024.jpg","details":"BELLE \u0026 SEBASTIAN\nA Bit of Previous is the tenth studio album by Belle and Sebastian and their first full-length in seven years. This may be surprising to anyone following the recent life pursuits of the Glasgow 7-piece: The Boaty Weekender – a 3000 capacity star-studded four-day music festival on a cruise liner sailing the Mediterranean; a trilogy of EP’s; a soundtrack for the directorial debut of The Inbetweeners’ Simon Bird; a live album showcasing the band’s present-day iteration as savvy main stage entertainers; and in 2020 a collaborative project with fans called ‘Protecting The Hive’. But in all these idiosyncratic endeavours, as intrinsic to the band’s DNA as the stage invasion at the end of each of their shows, a full-length has eluded us.\nA Bit Of Previous is a classic Belle and Sebastian album preoccupied with songs and melodies that won’t leave your head and lyrics that can make you smile and ponder and sometimes be melancholic. It’s an album self-produced and recorded by Belle and Sebastian (with contributions from Brian McNeill, Matt Wiggins, Kevin Burleigh and Shawn Everett) and their most hands-on since The Boy With The Arab Strap.\nIn some respects, A Bit Of Previous is also a first. It’s the first album the band recorded in their native Glasgow in 20 years (the last being 2000’s Fold Your Hands Child, You Walk Like a Peasant). What started off as a pandemic necessity – having to ditch plans to record in California in spring of 2020 – became a refreshing change of pace. Unbeholden to restrictive and expensive studio schedules, it allowed for long walks through the streets and parks of Glasgow and spontaneous train journeys to nearby towns which embedded proceedings with a peculiar sense of place. The band upgraded their practice space to a makeshift studio, making some creative interior design choices to keep it pandemic safe.\nA Bit of Previous is Belle and Sebastian taking on age and getting older and emerging all the more vital for it. ‘Young And Stupid’ is a stuttering acoustic rocker that without its lilting violin might be mistaken for a T. Rex song, the lyrics and nonchalant vocals facing the passage of time with wry ennui: “Now we’re old with creaking bones / Some with partners some alone  / Some with kids and some with dogs  / Getting through the nightly slog / Everything is fine when you’re young and stupid”. ‘Come On Home’, with its fireside piano and conversational exchanges between Murdoch and Martin, evokes a handing over of the generational baton with a call to “Give a chance to the old / Set the record straight on the welfare state / Give a chance to the young / Everyone deserves a life in the sun”.\nWhile the arrangements are often playful, there is an underlying gravity. The deceptively feelgood, choir backed ‘If They’re Shooting At You’ reads like a poignant ode to defiance and survival: ‘If they’re shooting at you kid / You must be doing something right”. On Martin’s ‘Reclaim The Night’, a jaunty backbeat tells of a cross-generational everywoman trepidation that in 2022 is more pertinent than ever.\nA Bit of Previous is also scattered with big, occasionally delirious pop moments. ‘Unnecessary Drama’ rips through a cacophony of overdriven riffs and a droning harmonica that borders on the unhinged and is one of the band’s heaviest outings since, well, ever. The 140+ bpm ’Talk To Me Talk To Me’ is ablaze with euro synths and keyboard horns as the voices of Murdoch and Martin intertwine on a breathless chorus. ‘Working Boy in New York City’ exists in a parallel universe where the band did in fact make it to California – such is the escapist bliss of its sloping flute and bittersweet funk.\nOn the other side of the spectrum are some of Belle and Sebastian’s most moving ballads. Tender finger-picked paean to a lover ‘Do It For Your Country’ and doo-wop-inflicted ‘Sea Of Sorrow’ showcase Murdoch’s tenor at its most bare and affecting, while Stevie Jackson contributes lovelorn country waltz ‘Deathbed of My Dreams’.\nSo what is a A Bit of Previous? It’s a bit of everything, and a lot of what makes Belle and Sebastian so special and enduring. It’s a band tackling the insight, experience and responsibility that come with getting older with humour and irreverence and lyrical exactitude and musical bravado. It’s one of the UK’s most beloved pop portraitists asserting themselves as an infallible source of energy and fun.\nThere’s a touch of Buddhism, too, a practice increasingly influential on Murdoch’s outlook in recent years and given a further manifestation via his popular weekly guided online meditation sessions. The album title is possibly a reference to the concept of reincarnation. As Murdoch notes in the liner notes:  “There is a firmly held belief in Buddhism that we have been reborn so many times and in so many guises that if we look around us, we are bound to see a person who has been our mother in a past life. And we are surrounded by people who have been our children. If we truly had that in our minds and in our hearts, we would drop the prejudice we had: our attitude to strangers and difficult people would alter emphatically.”\nTENNIS\nTHEE SACRED SOULS"},{"date":"2022-06-05T00:00:00.000+00:00","title":"REX ORANGE COUNTY","url":"https://thegreekberkeley.com/events/rex-orange-county-220605","img":"https://thegreekberkeley.com/wp-content/uploads/2022/01/waespi_rexoc_press2022_20.jpg","details":"REX ORANGE COUNTY"},{"date":"2022-06-10T00:00:00.000+00:00","title":"ERYKAH BADU, Noname","url":"https://thegreekberkeley.com/events/erykah-badu-220610","img":"https://thegreekberkeley.com/wp-content/uploads/2022/03/ErykahBadu_1024.jpg","details":"ERYKAH BADU\nNONAME\nNoname (born Fatimah Warner) is an American artist from Chicago, Illinois, who blurs the lines of poetry and rap through the music she creates.\nNoname grew up in Bronzeville, a historic neighborhood on the southside of Chicago that famously attracted accomplished black artists and intellectuals of all types. Noname first discovered her love for words while taking a creative writing class as a sophmore in highschool.\nShe became enamored with poetry and spoken word- pouring over Def Poetry Jam clips on YouTube and attending open mics around the city. Noname regularly attended and performed at an open mic at Harold Washington Library- YouMedia’s Lyricist Loft.\nAfter sessions at YouMedia, Noname would participate in cyphers and started getting into freestyling. When she was just a senior in highschool, she placed third in “Louder Than A Bomb”, a poetry competition with 120 Chicago high schools in participation. She remained connected with the artists she met at YouMedia and in 2013, her verse on Chance the Rapper’s “Lost” attracted the beginning of her large fan base, most of whom have been following her every move since.\nOn July 31st Noname released her debut project entitled Telefone which was 3 years in the making and highly anticipated by fans and media alike. Instantly the project gained critical acclaim with a rave review by Pitchfork and landing her praise from major outlets like Rolling Stones, Complex and Dazed \u0026 Confused. Noname has been hailed by The FADER, Complex, and Rolling Stone as one of the most exciting and important new artists of 2016.\nThanks to Telefone’s success, Noname played some shows in support of Ms. Lauryn Hill, who hand-picked Noname to open for her on tour. When first approaching the project, Noname set out to emulate the feeling of talking on the phone with someone for the first time. She describes Telefone as “an introductory conversation with someone you’re interested in”. But as Noname continued to work on the tape, it also transitioned a bit into mortality: the idea of life and death and the duality between those two things."},{"date":"2022-06-11T00:00:00.000+00:00","title":"ALISON WONDERLAND, Quiet Bison","url":"https://thegreekberkeley.com/events/alison-wonderland-220611","img":"https://thegreekberkeley.com/wp-content/uploads/2022/01/Alison_wonderland_22_1024.jpg","details":"ALISON WONDERLAND\nAlison Wonderland architects a world of her own design as its chief author, creator, and voice. The Sydney-born and Los Angeles-based singer, producer, songwriter, and DJ realises this vision at the intersection of future-facing pop, explosive beat-craft, and eternal dance rhythms.\nEmerging in 2009 with regular night club sets around Australia and a series of remixes for everyone from Little Dragon to Justin Bieber, she ignited an international splash in 2015 with the full-length debut, Run. It reached gold status in Australia and earned two ARIA Awards nominations, for Best Dance Release and Best Video for “U Don’t Know.” She went on to debut her live set in the US that year at Coachella. Fast forward to 2017, she achieved the Best New Artist honour at the first-ever Electronic Dance Music Awards, while her remix of Dua Lipa’s “New Rules” soared to #1 on the Billboard Dance Charts.\nHer sound has quietly inched towards mainstream ubiquity as the sonic sorceress received the “Highest Female DJ Billing Ever at Coachella,” captured #1 on the Billboard Top Dance/Electronic Albums Chart twice consecutively, headlined sold out arenas around the globe, and clocked upwards of 100 million streams by 2018. Not to mention, Triple J declared that “both sonically and vocally, Awake is Alison’s biggest work to date,” The Music called Alison “an intuitive songwriter, who wires into any sort of emotion,” and Stack Magazine named her an “Industry Leader.” In the US, Billboard gave Awake rave reviews whilst ELLE proclaimed her one of its “Women On The Verge,” and she garnered features from FADER, Glamour, Seventeen, Interview, and more. Simultaneously, Alison’s Radio Wonderland show clocked 5 million-plus iTunes downloads as well as broadcasting to over 20 countries and featuring prominently on the Sirius XM channel Diplo’s Revolution.\nQUIET BISON"},{"date":"2022-06-16T00:00:00.000+00:00","title":"SOFI TUKKER","url":"https://thegreekberkeley.com/events/sofi-tukker-220616","img":"https://thegreekberkeley.com/wp-content/uploads/2022/02/approved-photo_horizontal-photo-credit-Elizabeth-Miranda-1.jpg","details":"SOFI TUKKER\nSOFI TUKKER, the genre-defying duo of Sophie Hawley-Weld and Tucker Halpern, is celebrated for their inclusive and global perspective on electronic music as well as their work’s themes of liberation, unity, and self-empowerment. They began daily livestreams at the start of the pandemic, eventually doing hundreds of streams for millions of viewers, becoming the second most live-streamed artist of 2020. The daily livestreams also birthed the Freak Fam, their vibrant fan community that assembles 24/7 online and in-person at Freak Fam meetups spanning the globe. In 2021 SOFI TUKKER dove back into the live world with field-packing, high energy festival sets at Firefly and Outside Lands. Now the group is back with their first headline live tour since their sold-out 2019 run, in support of their new album WET TENNIS, the highly anticipated follow-up to their GRAMMY-nominated debut album Treehouse, out April 29th.\nWET TENNIS is an acronym: When Everyone Tries to Evolve, Nothing Negative Is Safe. WET TENNIS is about forward movement, optimism and positive growth, no matter what the challenge. WET TENNIS is a dedication to constantly evolving and celebrating aliveness. WET TENNIS is a lifestyle. It says: everything’s better when wet. Wetness is excitement, mother nature, movement, flow, sweat, and juice. It’s athletic and elegant. It’s loud and bright. All these qualities will be on full display when SOFI TUKKER comes to town, both on stage and in the audience.\nThe band sums it up best – “We’re overjoyed and proud to be announcing our first headline tour since the world was turned upside down. Over the past few years, the most incredible community was formed out of love, connection, acceptance, and music through our daily livestreams. The time has come to bring us all together in person. This tour is unlike any other we’ve done because it’s with brand new music and production from our upcoming album WET TENNIS and because, this time around, somehow it’s gonna be even crazier because the Freak Fam exists!”"},{"date":"2022-06-17T00:00:00.000+00:00","title":"ANDREW BIRD IRON \u0026 WINE, Allison Russell","url":"https://thegreekberkeley.com/events/andrew-birdbriron-wine-220617","img":"https://thegreekberkeley.com/wp-content/uploads/2021/12/andrewbirdxiron_22_1024.png","details":"ANDREW BIRD\nAndrew Bird is an internationally acclaimed, Grammy-nominated multi-instrumentalist, vocalist, whistler, and songwriter who picked up his first violin at the age of four and spent his formative years soaking up classical repertoire completely by ear. Since beginning his recording career in 1997, Bird has released 17 albums and performed extensively across the globe. He has recorded with the Preservation Hall Jazz Band, appeared as “Dr. Stringz” on Jack’s Big Music Show, and headlined concerts at Carnegie Hall, Sydney Opera House, Walt Disney Concert Hall, and festivals worldwide.\nBird performed as the Whistling Caruso in Disney’s The Muppets movie, scored the FX series Baskets, and collaborated with inventor Ian Schneller on Sonic Arboretum, an installation that exhibited at New York’s Guggenheim Museum, Boston’s ICA, and the MCA Chicago. Bird has been a featured TED Talks presenter, a New Yorker Festival guest, and an op-ed contributor for the New York Times.\nMore recently, Bird released a series of site-specific improvisational short films and recordings called Echolocations, recorded in remote and acoustically interesting spaces: a Utah canyon, an abandoned seaside bunker, the middle of the Los Angeles River, and a reverberant stone-covered aqueduct in Lisbon. Additionally, Bird hosts an ongoing series of live-streamed performances called Live from the Great Room, putting the creative process on display for fans as he collaborates and converses with friends in a candid, intimate setting.\nShortly after receiving his 2020 Grammy nomination for Best Folk Album, with My Finest Work Yet, Andrew Bird made his professional acting debut in the cast of Fargo’s fourth installment, which concluded on FX in November 2020 and is currently streaming via Hulu. In March 2021, Bird released his latest project, These 13, an album entirely co-written and recorded with his longtime friend and former Squirrel Nut Zippers collaborator, Jimbo Mathus. Captured live to tape, just the two of them playing and singing from opposite sides of a microphone, These 13 marked the first set of new music that Bird and Mathus created together in more than 20 years.\nIRON \u0026 WINE\nIron \u0026 Wine is the musical project of singer-songwriter Sam Beam. Born and raised in South Carolina, Beam was teaching film when his home recorded debut, The Creek Drank the Cradle, was released on Sub Pop records in 2002. Garnering both critical and popular acclaim, Beam was vaulted into the spotlight of the burgeoning indie-folk and Americana scenes. Now entering its 20th year, Iron \u0026 Wine have released seven full length recordings, numerous EPs / singles, and collaborations with Calexico, Ben Bridwell (Band of Horses) and Jesca Hoop all on their way to becoming a four-time GRAMMY nominee. Iron \u0026 Wine’s music has captured the emotion and imagination of listeners with their distinctly cinematic songs; in particular they’ve become synonymous with the movies Twilight and Garden State and continue to find a home in your favorite film, TV show or streaming playlist. As the world continues to spin – so do Iron \u0026 Wine continue on their path of releasing new music and touring. Follow Iron \u0026 Wine on Instagram, Facebook and Twitter.\n  ALLISON RUSSELL"},{"date":"2022-06-18T00:00:00.000+00:00","title":"BRANDI CARLILE","url":"https://thegreekberkeley.com/events/brandi-carlile-220618","img":"https://thegreekberkeley.com/wp-content/uploads/2022/03/brandi_carlile_1024-2.jpg","details":"BRANDI CARLILE\nOnly a global pandemic could have forced Brandi Carlile to hit pause. After two hard-fought decades-in-the-making, Carlile was in the midst of experiencing the biggest highs of her acclaimed career thus far. From a show-stealing debut at the 61st GRAMMY Awards, to her first sold-out arena show at Madison Square Garden, to an ever-growing number of awards and accolades, all-star collaborations and countless other staggering achievements.\nFinding herself stuck at home outside of Seattle in the rural foothills of the Cascade Mountains, Carlile had no choice but to slow down, reassess and realign her priorities. Luckily for Carlile, home happens to be a 90-acre compound shared with not only her wife, Catherine, and two daughters, but also her chosen family: longtime collaborators and bandmates Tim and Phil Hanseroth as well as her cello player Josh Neumann among an ever-growing contingency.\nIt was during this time that In These Silent Days took shape. Inspired by the mining of her own history while writing her #1 New York Times Best Selling memoir Broken Horses, the new ten-song record chronicles acceptance, faith, loss and love and channels icons like David Bowie, Freddie Mercury, Elton John and Joni Mitchell—the latter two who, by some sort of cosmic alignment of the stars, have turned out to be close friends in addition to being her biggest heroes and inspirations.\nReuniting with producers Dave Cobb and Shooter Jennings, the album takes Carlile’s voice, which The New York Times says, “sounds like an element of nature,” and pushes it to even greater heights and dramatic peaks. From the anthemic first single “Right On Time” to the intimately romantic “You and Me On The Rock” and the blistering “Broken Horses,” the songs tell a story of connection and empathy in the midst of distance and estrangement and showcase an artist continuing to push herself and widen her arms around an inclusive, ever-growing island of misfits."},{"date":"2022-06-24T00:00:00.000+00:00","title":"NORAH JONES","url":"https://thegreekberkeley.com/events/norah-jones-220624","img":"https://thegreekberkeley.com/wp-content/uploads/2022/03/NorahJones_1024-1.jpg","details":"NORAH JONES\nNorah Jones first emerged on the world stage with the February 2002 release of Come Away With Me, her self-described “moody little record” that introduced a singular new voice and grew into a global phenomenon, sweeping the 2003 GRAMMY Awards. Since then, Jones has become a nine-time GRAMMY-winner, sold more than 50 million albums, and her songs have been streamed six billion times worldwide. She has released a series of critically acclaimed and commercially successful solo albums—Feels Like Home (2004), Not Too Late (2007), The Fall (2009), Little Broken Hearts (2012), Day Breaks (2016), Pick Me Up Off The Floor (2020), the live album ‘Til We Meet Again (2021), and her first-ever holiday album I Dream Of Christmas (2021)—as well as albums with her collective bands The Little Willies, El Madmo, and Puss N Boots featuring Sasha Dobson and Catherine Popper who released their second LP Sister in 2020. The 2010 compilation …Featuring Norah Jones showcased her incredible versatility by collecting her collaborations with artists as diverse as Willie Nelson, Outkast, Herbie Hancock, and Foo Fighters. Since 2018 Jones has been releasing a series of singles including collaborations with artists and friends such as Mavis Staples, Jeff Tweedy, Thomas Bartlett, Tarriona Tank Ball, Rodrigo Amarante, and Brian Blade, some of which were compiled on the 2019 singles collection Begin Again."},{"date":"2022-07-09T00:00:00.000+00:00","title":"CAAMP, with special guest Houndmouth","url":"https://thegreekberkeley.com/events/caamp-220709","img":"https://thegreekberkeley.com/wp-content/uploads/2022/03/Caamp_1024.jpg","details":"CAAMP\nOn their earthy, jubilant new album, the Columbus, Ohio, band Caamp examine those in-between days that make up a life—not the best or most eventful days, certainly not the worst or most tragic, but those full of small pleasures and forgotten disappointments. Taylor Meier, the group’s singer and primary songwriter, came up with the phrase Lavender Days to describe them—a phrase that struck him out of the blue, “like a coconut out of the sky,” he says with a laugh. Why lavender? “It’s nostalgic. It can remind you of your grandmother’s perfume or maybe the air freshener in your mom’s car. It can summon up all of these incredible memories and transport you to those in-between days, which I think everybody remembers with more clarity than the big events.”\nCaamp have been writing and singing about those lavender days—in tender love songs tinged with melancholy and determination—ever since Meier played his first notes with bandmate Evan Westfall more than a decade ago. They met as students at Ohio University in Athens, playing local coffeehouses and growing more committed to this extracurricular project. With the addition of Matt Vinson on bass and Joseph Kavalec on keyboards, they built up a grassroots following well beyond the Buckeye State based on the inventiveness of Meier’s songwriting, the exuberance of their live performances, and their tireless dedication to touring as much as possible.\nFrom their self-titled 2016 debut album to their most recent releases of By and By in 2019 to Live From Newport Music Hall, “Fall, Fall, Fall”, and “Officer of Love” in 2020 the band has amassed over 590 million streams globally as well as achieved multiple #1’s at AAA radio. The band has headlined sold out shows and performed at major festivals around the world including Firefly, Shaky Knees, Forecastle, Outside Lands, Austin City Limits, Great Escape and many more. They have also performed on national TV on Jimmy Kimmel Live!, CBS This Morning Saturday and Late Show with Stephen Colbert.\nTheir new album Lavender Days will be released via Mom + Pop records on June 24th.\nHOUNDMOUTH"},{"date":"2022-07-10T00:00:00.000+00:00","title":"FLEET FOXES, Tim Bernardes","url":"https://thegreekberkeley.com/events/fleet-foxes-220710","img":"https://thegreekberkeley.com/wp-content/uploads/2022/02/PRESS-PHOTO-Fleet-Foxes-Photo-Credit-Shervin-Lainez-9-1_1024.jpg","details":"FLEET FOXES\nFleet Foxes is an American indie folk band from Seattle, WA. Led by lead singer-songwriter Robin Pecknold, the band released their fourth critically acclaimed album Shore in the fall of 2020. Shore earned the band their second Grammy nomination (Best Alternative Music Album), and sweeping praise (MOJO five stars, Rolling Stone four stars, Pitchfork fifth consecutive Best New Music) with Rolling Stone calling the album “…the most immediately rewarding Fleet Foxes record since their brilliant 2008 debut.”\nTIM BERNARDES"},{"date":"2022-07-15T00:00:00.000+00:00","title":"KING PRINCESS, with special guests Charlotte Day Wilson Dora Jar","url":"https://thegreekberkeley.com/events/king-princess-220715","img":"https://thegreekberkeley.com/wp-content/uploads/2022/03/king-princess-1024.jpg","details":"KING PRINCESS\nBorn and raised in Brooklyn, NY, King Princess is a vocalist, multi-instrumentalist and songwriter whose debut single, an ode to untold queer histories titled “1950,” became an overnight smash hit with over 560 million streams to date and eventually achieving Platinum status in the United States and Australia. Her debut album Cheap Queen was released in 2019 via Mark Ronson’s Zelig Records/Columbia Records to widespread critical acclaim from The New York Times, Pitchfork, NPR, Rolling Stone and others, and she has performed on “Saturday Night Live” and “The Late Show with Stephen Colbert.” Her sold-out tours have taken her across the world with festival sets at Coachella, Glastonbury, Governors Ball and Bonnaroo and landed her on the cover of V Magazine, GQ Style UK, Highsnobiety and more.\nCHARLOTTE DAY WILSON\nCharlotte Day Wilson is a 28-year-old vocalist, producer and multi-instrumentalist from Toronto.\nWith roots ranging from R\u0026B to folk, her soulful, singular voice and timeless sound garnered global attention with the 2016 release of her debut EP CDW, and through her work with friends and collaborators BADBADNOTGOOD, Daniel Caesar and River Tiber. After sharing stages with the likes of Angel Olsen, Local Natives, Feist, Haim, and Rhye, Charlotte’s first headlining tour in 2018 sold out in major markets across North America and Europe. Her music has received universal acclaim from NPR, Pitchfork, The Fader, Billboard, Spin, and many others, and her songs have received over 150 million streams across all platforms. Charlotte’s anthemic single “Work” has been featured in Apple’s Shot on iPhone 7 commercial as well as TV shows like HBO’s Euphoria and Netflix’s Grace \u0026 Frankie. In 2018, Charlotte and director Fantavious Fritz won the Prism Prize for the “Work” music video and used the prize money to create the Work Film Grant, a $10,000 grant for Canadian female and gender non-binary filmmakers.\nCharlotte returned in 2018 with the poignant EP Stone Woman, a clear statement of intent and a stirring demonstration of Charlotte’s power and poise. Both CDW and Stone Woman EPs were longlisted for Canada’s renowned Polaris Music Prize, and in 2019 Stone Woman was honored with a Juno Award nomination for R\u0026B/Soul Recording of the Year. In 2019 Charlotte made her U.S. television debut performing “Work” on The Late Late Show with James Corden. Charlotte released her debut studio album ALPHA on July 9th, 2021 to critical acclaim, and has amassed over 50 million streams to date. The single “Take Care of You” feat. Syd was nominated for the Traditional R\u0026B/Soul recording of the year at the 2021 Juno Awards.\nALPHA Deluxe is set to be released on Dec 1st, 2021. The album features two bonus tracks; “Even is the Lie” and the remix of “Take Care of You” which features King Princess, Amaarae and Meshell Ndegeocello.\nDORA JAR\nDora Jar is an artist who refuses to be defined. Despite having only shared a handful of songs, each track the 24 year old has released has been distinctive, endlessly fascinating and, quite frankly, brilliant. From the hammering guitars on “Multiply” to the ominous “Did I Get It Wrong,” they exemplify an artist with a clear artistic vision: to be as expansive, honest and unequivocally herself as is humanly possible."},{"date":"2022-07-16T00:00:00.000+00:00","title":"KHRUANGBIN, Men I Trust","url":"https://thegreekberkeley.com/events/khruangbin-220716","img":"https://thegreekberkeley.com/wp-content/uploads/2022/02/2021-Press-Photo-TM-Size-USE-FOR-TICKETING-PAGES-1024x576.jpg","details":"KHRUANGBIN\nKhruangbin has always been multilingual, weaving far-flung musical languages like East Asian surf-rock, Persian funk, and Jamaican dub into mellifluous harmony. But on its third album, it’s finally speaking out loud. Mordechai features vocals prominently on nearly every song, a first for the mostly instrumental band. It’s a shift that rewards the risk, reorienting Khruangbin’s transportive sound toward a new sense of emotional directness, without losing the spirit of nomadic wandering that’s always defined it. And it all started with them coming home.\nBy the summer of 2019, the Houston group—bassist Laura Lee, guitarist Mark Speer, drummer DJ Johnson—had been on tour for nearly three-and-a-half years, playing to audiences across North and South America, Europe, and southeast Asia behind its acclaimed albums The Universe Smiles Upon You and Con Todo El Mundo. They returned to their farmhouse studio in Burton, Texas, ready to begin work on their third album. But they were also determined to slow down, to take their time and luxuriate in building something together. \nIt’s a lesson Lee had recently learned with the help of a new friend, a near-stranger who had reached out when she was feeling particularly unmoored, inviting her to come hiking with his family. That day, as they’d all made their way toward the distant promise of a waterfall, Lee had felt a dawning clarity about the importance of appreciating the journey, rather than rushing headlong toward the next destination—something she’d almost lost sight of during the band’s whirlwind rise. When they reached the waterfall at last, Lee’s friend urged her to jump, a leap she likens to a baptism. As she did, he screamed her name—her full name, the one she’d recently taken from her grandfather. In that instant, Laura Lee Ochoa was reborn. She emerged feeling liberated, grateful for what her friend had shown her. His name was Mordechai.\nOchoa’s rejuvenation found its expression in words—hundreds of pages’ worth, which she’d filled over a self-imposed day of silence. As Khruangbin began putting together the songs that would make up the next record, discovering in them spaces it seemed like only vocals could fill, they turned to those notebooks. Khruangbin had worked with lyrics before: the love-letter poetry of “Friday Morning,” the ghosts of conversations gone by in “Cómo Te Quiero.” But this time Ochoa had found she had something to say—and so did the songs. They needed each other. And letting those words ring out gave Khruangbin’s cavernous music a new thematic depth.\nChief among those themes is memory—holding onto it, letting it go, naming it before it disappears. Again and again the songs play on those notions, from the sun-dappled disco of lead single “Time (You And I)”—which evinces the feeling of a festival winding down to its final blowout hours—to the lilting “So We Won’t Forget,” which finds Ochoa filling her apartment with memories she’s scrawled on Post-Its to prevent them slipping away. It’s there, too, in “Dearest Alfred,” which was inspired by a trove of letters Ochoa’s grandfather wrote to his twin brother, as well as “If There Is No Question,” a metaphysical devotional (by way of Marvin Gaye) that harkens back to Johnson and Speer’s earliest days in a church band. And those same nostalgic wisps curl all around “Connaissais De Face,” a Middle Eastern vamp by way of Serge Gainsbourg that evokes all the ruminative romance of a French New Wave film, layered with its own tender dialogue of reminiscence.\nMusically, the band’s ever-restless ear saw it pulling reference points from Pakistan, Korea, and West Africa, incorporating strains of Indian chanting boxes and Congolese syncopated guitar. But more than anything, the album became a celebration of Houston, the eclectic city that had nurtured them, and a cultural nexus where you can check out country and zydeco, trap rap, or avant-garde opera on any given night. The Roy Ayers funk of opener “First Class” created a lush bed for the band to stretch out on, singing wryly about popping champagne while jet-setting all over the world. But in the end, those brags are revealed to be a shoutout to the home that made all this possible, a love that’s evident in its hands-in-the-air refrain of “H-Town.”\nIn those years away from that home, Khruangbin’s members often felt like they were swimming underwater, unsure of where they were going, or why they were going there. But Mordechai leads them gently back to the surface, allowing them to take a breath, look around, and find itself again. It is a snapshot taken along a larger journey—a moment all the more beautiful for its impermanence. And it’s a memory to revisit again and again, speaking to us now more clearly than ever.\nMEN I TRUST\nHear ye, hear ye! We are super thrilled to announce that we will resume touring in N. America this fall for the release of our new and fourth album called “The Untourable Album”. We started working on this album amidst the global lockdown and didn’t expect to be able to “tour” these songs. We wanted to take the opportunity to work on new and different material, without necessarily intending to play these songs live. We wrote freely, as if we were suspended in time with no external attachments. The initial release date had to be delayed however, when Dragos got into a motorcycle accident and had to recover for several weeks. So here we are now, almost ready to release the album, while everything is slowly reopening and the lockdown seems to be a thing of the past. It looks like the “Untourable Album” will be tourable after all! We are still in the process of polishing the songs and doing the last tweaks before the album is ready. We will have an official release date super soon, stay tuned. Thank you for your ongoing support and we’re looking forward to see everyone again in real life!"},{"date":"2022-07-17T00:00:00.000+00:00","title":"KHRUANGBIN, Men I Trust","url":"https://thegreekberkeley.com/events/khruangbin-220717","img":"https://thegreekberkeley.com/wp-content/uploads/2022/02/2021-Press-Photo-TM-Size-USE-FOR-TICKETING-PAGES-1024x576.jpg","details":"KHRUANGBIN\nKhruangbin has always been multilingual, weaving far-flung musical languages like East Asian surf-rock, Persian funk, and Jamaican dub into mellifluous harmony. But on its third album, it’s finally speaking out loud. Mordechai features vocals prominently on nearly every song, a first for the mostly instrumental band. It’s a shift that rewards the risk, reorienting Khruangbin’s transportive sound toward a new sense of emotional directness, without losing the spirit of nomadic wandering that’s always defined it. And it all started with them coming home.\nBy the summer of 2019, the Houston group—bassist Laura Lee, guitarist Mark Speer, drummer DJ Johnson—had been on tour for nearly three-and-a-half years, playing to audiences across North and South America, Europe, and southeast Asia behind its acclaimed albums The Universe Smiles Upon You and Con Todo El Mundo. They returned to their farmhouse studio in Burton, Texas, ready to begin work on their third album. But they were also determined to slow down, to take their time and luxuriate in building something together. \nIt’s a lesson Lee had recently learned with the help of a new friend, a near-stranger who had reached out when she was feeling particularly unmoored, inviting her to come hiking with his family. That day, as they’d all made their way toward the distant promise of a waterfall, Lee had felt a dawning clarity about the importance of appreciating the journey, rather than rushing headlong toward the next destination—something she’d almost lost sight of during the band’s whirlwind rise. When they reached the waterfall at last, Lee’s friend urged her to jump, a leap she likens to a baptism. As she did, he screamed her name—her full name, the one she’d recently taken from her grandfather. In that instant, Laura Lee Ochoa was reborn. She emerged feeling liberated, grateful for what her friend had shown her. His name was Mordechai.\nOchoa’s rejuvenation found its expression in words—hundreds of pages’ worth, which she’d filled over a self-imposed day of silence. As Khruangbin began putting together the songs that would make up the next record, discovering in them spaces it seemed like only vocals could fill, they turned to those notebooks. Khruangbin had worked with lyrics before: the love-letter poetry of “Friday Morning,” the ghosts of conversations gone by in “Cómo Te Quiero.” But this time Ochoa had found she had something to say—and so did the songs. They needed each other. And letting those words ring out gave Khruangbin’s cavernous music a new thematic depth.\nChief among those themes is memory—holding onto it, letting it go, naming it before it disappears. Again and again the songs play on those notions, from the sun-dappled disco of lead single “Time (You And I)”—which evinces the feeling of a festival winding down to its final blowout hours—to the lilting “So We Won’t Forget,” which finds Ochoa filling her apartment with memories she’s scrawled on Post-Its to prevent them slipping away. It’s there, too, in “Dearest Alfred,” which was inspired by a trove of letters Ochoa’s grandfather wrote to his twin brother, as well as “If There Is No Question,” a metaphysical devotional (by way of Marvin Gaye) that harkens back to Johnson and Speer’s earliest days in a church band. And those same nostalgic wisps curl all around “Connaissais De Face,” a Middle Eastern vamp by way of Serge Gainsbourg that evokes all the ruminative romance of a French New Wave film, layered with its own tender dialogue of reminiscence.\nMusically, the band’s ever-restless ear saw it pulling reference points from Pakistan, Korea, and West Africa, incorporating strains of Indian chanting boxes and Congolese syncopated guitar. But more than anything, the album became a celebration of Houston, the eclectic city that had nurtured them, and a cultural nexus where you can check out country and zydeco, trap rap, or avant-garde opera on any given night. The Roy Ayers funk of opener “First Class” created a lush bed for the band to stretch out on, singing wryly about popping champagne while jet-setting all over the world. But in the end, those brags are revealed to be a shoutout to the home that made all this possible, a love that’s evident in its hands-in-the-air refrain of “H-Town.”\nIn those years away from that home, Khruangbin’s members often felt like they were swimming underwater, unsure of where they were going, or why they were going there. But Mordechai leads them gently back to the surface, allowing them to take a breath, look around, and find itself again. It is a snapshot taken along a larger journey—a moment all the more beautiful for its impermanence. And it’s a memory to revisit again and again, speaking to us now more clearly than ever.\nMEN I TRUST\nHear ye, hear ye! We are super thrilled to announce that we will resume touring in N. America this fall for the release of our new and fourth album called “The Untourable Album”. We started working on this album amidst the global lockdown and didn’t expect to be able to “tour” these songs. We wanted to take the opportunity to work on new and different material, without necessarily intending to play these songs live. We wrote freely, as if we were suspended in time with no external attachments. The initial release date had to be delayed however, when Dragos got into a motorcycle accident and had to recover for several weeks. So here we are now, almost ready to release the album, while everything is slowly reopening and the lockdown seems to be a thing of the past. It looks like the “Untourable Album” will be tourable after all! We are still in the process of polishing the songs and doing the last tweaks before the album is ready. We will have an official release date super soon, stay tuned. Thank you for your ongoing support and we’re looking forward to see everyone again in real life!"},{"date":"2022-07-23T00:00:00.000+00:00","title":"SLIGHTLY STOOPID, Pepper Common Kings Fortunate Youth","url":"https://thegreekberkeley.com/events/slightly-stoopid-220723","img":"https://thegreekberkeley.com/wp-content/uploads/2022/02/Slightly-Stoopid_KZ_LR.jpg","details":"SLIGHTLY STOOPID\nThe story of Slightly Stoopid, at its core, is one of brotherhood. It’s the story of Miles Doughty and Kyle McDonald, two musicians determined to succeed on their own terms, creating a multi-genre fusion of rock, reggae and blues with hip-hop, funk, American folk, metal, and punk. It’s the story of a duo that has not just survived, but thrived, as “brothers from other mothers”- keeping true to their authenticity, throughout two decades of relentless touring, and evolved songwriting. The duo has repeatedly created lasting artistic statements despite a music industry that too often prioritizes style over substance.\nSlightly Stoopid is and continues to be a musical brotherhood that always welcomes guest musicians and the art of collaboration. Doughty and McDonald remain unwavering in their principles of independence, honoring their diversity of influences and mentors, and furthering their inherited legacy of the Southern California sound.\n“Once we found music as a form of expression, as an outlet, we did whatever it took to survive,” said McDonald in a 2018 interview. “We are who we are- a product of Southern California. And, we are where we are in life because of how passionate we are about the music.”\nPEPPER\nTwo decades. They’ve gone by in a blur, filled with soundchecks, encores, album releases, and sold-out shows stretching from the California coastline to the UK mainland. Along the way, Pepper has sharpened its own “Kona dub-rock” sound — a blend of reggae, alternative rock, island rhythms, and punky spirit — while also building a community of fans and likeminded bands.\nBefore Pepper began building a community in its adopted hometown of Southern California, the group held its very first rehearsal in 1997 in Kailua-Kona, Hawaii. All three members were natives of the Big Island, and together, they made a sound that nodded to their tropical roots while also moving forward into new territory. After earning a local fanbase in Hawaii, they moved to the mainland, where Pepper quickly became a popular live act. Pepper’s diverse music allowed the group to tour the country with a wide variety of bands, including reggae icons (The Wailers), punk bands (Pennywise), reggae-rockers (311, Slightly Stoopid), and hip-hop legends (Snoop Dogg). Meanwhile, the band’s admiration for DIYminded groups like NOFX inspired Pepper to launch its own label, LAW Records, which gave the trio complete control over its own music. It also allowed the band to sign other acts, which expanded Pepper’s circle even further.\nCOMMON KINGS\nIn a saturated musical landscape, Common Kings has carved their own path. The Orange County by way of South Pacific four-piece was nominated for a GRAMMY for their debut album (Lost In Paradise) in 2016 and has been on an upward trajectory ever since. Common Kings followed up with their 2018 EP One Day (Mensch House Records) featuring Stephen Marley, ¡Mayday! and Kat Dahlia, and ended the year supporting Bruno Mars on his sold out Hawaii shows. Since wrapping their tour with Sublime, Common Kings are set to embark on the Croptober Tour with Landon McNamara, Eli-Mac, Big Body Cisco, \u0026 Westafa across the West Coast beginning this October in Los Angeles. Fans can expect new music very soon.\nCommon Kings strikes the perfect balance between R\u0026B, rock, reggae, pop and island influences from the collective minds of JR King (vocals), Mata (guitar), Uncle Lui (bass), and Rome (drums). The amalgamation comes from growing up on healthy doses of Van Morrison, Stevie Wonder, George Benson, Jim Croce, The Who, Led Zeppelin, Gypsy Kings, Earth Wind and Fire, and Bob Marley. These influences originate from each band members love for various genres, and widespread knowledge of music.\nWith a GRAMMY nomination under their belt, the achievement of reaching 500,000 single downloads, along with their remarkable touring accomplishments (providing direct support for major acts such as opening two sold out shows for Bruno Mars at Aloha Stadium in November, Justin Timberlake’s 20/20 World Experience Tour, Meghan Trainor’s Untouchable Tour and Matisyahu’s 2017 Fall Tour), Common Kings show no signs of slowing down.\nFORTUNATE YOUTH"},{"date":"2022-07-29T00:00:00.000+00:00","title":"DAVID GRAY, Performing White Ladder in its entirety and greatest hits","url":"https://thegreekberkeley.com/events/david-gray-3","img":"https://thegreekberkeley.com/wp-content/uploads/2019/11/DavidGray_19_1024-1024x576.jpg","details":"DAVID GRAY\nWhite Ladder was one in a million. It was a game changer, a life changer, the people’s choice blockbuster that launched a thousand troubadours. It may be the greatest ever word-of-mouth success in the history of the music business.\nRecorded for no budget in a Stoke Newington bedroom in 1998 by a down on his luck singer-songwriter and self-released on a kitchen sink label, White Ladder slowly (very, very slowly) found an audience. It took a year to creep into the lower reaches of the British charts, then worked its way all the way up to number one. White Ladder eventually spent 3 years (from May 2000 to March 2003) in the UK top 100, spawning classic hit singles ‘Babylon’, ‘Please Forgive Me’ and ‘Sail Away’. It went on to sell over 7 million copies worldwide. It remains in the top 30 best-selling British albums of all time and the best-selling album ever in Ireland (a nation who know a good song when they hear it).\nCelebrating its 20th anniversary with an expanded edition, it is interesting to consider the extraordinary aftermath of White Ladder. Its success spawned a new wave of singer-songwriters in an acoustic boom that resonates to this day, a soul-baring lineage that can be directly traced from David Gray to the all-conquering Ed Sheeran. Indeed, Ed is a fan, whose passionate live version of ‘This Year’s Love’ can bring tears to the eye. Fellow world beating British superstar Adele is also an admirer, citing ‘This Year’s Love’ as one of her all-time favourite break-up songs.\nIn the wake of White Ladder, every major record company began signing and developing guitar wielding troubadours. David Gray was followed into the UK charts by Damien Rice, KT Tunstall, Katie Melua, James Blunt, James Morrison, James Bay, Paolo Nutini, and, ultimately, Ed Sheeran and a second wave of guitar boys including George Ezra, Tom Walker, Tom Grennan and Lewis Capaldi. In the US (where White Ladder sold 2 million copies), Jack Johnson, John Mayer and Jazon Mraz were amongst singer-songwriters whose careers received a significant commercial boost. White Ladder was a music industry game changer.\nAnd yet White Ladder remains apart from everything that followed. While the record company model involved putting young guitarist-singers into the studio with teams of established pop writers and producers, White Ladder was the work of a lone artist plumbing the depths of his soul.\n“I’ve been happy after the event to get back to writing the music that I felt was in me and following my creative path. I don’t think the records I’ve made since have been worse or better. I just think what happened with White Ladder involved more than music. It was a sort of heart and soul moment of total surrender for everybody involved, for me and the audience. That was it. It doesn’t get any better than that.”\nTwenty years on, White Ladder remains an album of great depth and startling beauty, a superlative collection of emotional songs capturing a very special moment in time, as raw and immediate as when it was recorded."},{"date":"2022-07-30T00:00:00.000+00:00","title":"SHARON VAN ETTEN ANGEL OLSEN JULIEN BAKER, with special guest Spencer.","url":"https://thegreekberkeley.com/events/wild-hearts-tour-220730","img":"https://thegreekberkeley.com/wp-content/uploads/2022/01/SharonVanEtten_1024.jpg","details":"THE WILD HEARTS TOUR\nThe Wild Hearts Tour: Sharon Van Etten, Angel Olsen, and Julien Baker with Special Guest Spencer.\nJoin Sharon, Angel, and Julien as they head across the country with their bands for three very special individual sets of music on The Wild Hearts Tour. Special guest Spencer. will be opening the evening. These summer time shows will be full nights of music and a true experience from beginning to end.\nSHARON VAN ETTEN\nSharon Van Etten’s Remind Me Tomorrow comes four years after Are We There, and reckons with the life that gets lived when you put off the small and inevitable maintenance in favor of something more present. Throughout Remind Me Tomorrow, Sharon Van Etten veers towards the driving, dark glimmer moods that have illuminated the edges of her music and pursues them full force. With curling low vocals and brave intimacy, Remind Me Tomorrow is an ambitious album that provokes our most sensitive impulses: reckless affections, spirited nurturing, and tender courage.\nSince her last album, Van Etten has had a young son, and family life is joyful. Preparing and finishing these songs, she found herself expressing deep doubts about the world around him, and a complicated need to present a bright future for him. “There is a tear welling up in the back of my eye as I’m singing these love songs,” she says, “I am trying to be positive. There is strength to them. It’s— I wouldn’t say it’s a mask, but it’s what the parents have to do to make their kid feel safe.”\nAlongside working on Remind Me Tomorrow, Van Etten has been exploring her talents (musical, emotional, otherwise) down other paths. She’s continuing to act, to write scores and soundtrack contributions, and she’s returning to school for psychology. The breadth of these passions, of new careers and projects and lifelong roles, have inflected Remind Me Tomorrow with a wise sense of a warped-time perspective. This is the tension that arches over the album, fusing a pained attentive realism and radiant lightness about new love.\nANGEL OLSEN\nJULIEN BAKER\n‘Little Oblivions’ is Julien Baker’s third album and follow-up to 2017’s ‘Turn Out The Lights’, both on Matador Records. The New York Times said the ‘Turn Out The Lights’ is “the work of a songwriter who has resonated with an international audience (…), the rare second album that, despite new self-consciousness, stretches beyond an unspoiled debut to reach for even bigger things, with all its passion intact”. The Sunday Times said “the mix of detached vocals, lush arrangements and laid-bare post-mortems on love, loss, dysfunction and acceptance is devastating.”\nIn 2018, Baker formed boygenius with Phoebe Bridgers and Lucy Dacus. The resulting eponymous EP and joint North American tour made for one of the most celebrated and talked about musical communions of that year, highlighting Baker at the forefront of a burgeoning generation of era-defining artists.\nBaker shot to worldwide attention in 2015 with show-stopping debut, Sprained Ankle. Recorded in only a few days, it was a bleak yet hopeful meditation on identity, addiction, faith, resilience and redemption. An intense and immersive performer, her live shows were described by The New Yorker as “…. hushed, reverential. The only sounds you hear between songs are her fingers as she tweaks the tuning on her electric guitar, scattered whispers between friends, and the rustling as the crowd waits patiently for Baker to start strumming again”.\nBaker has collaborated on studio recordings with Frightened Rabbit, Matt Berninger, Hayley Williams, Becca Mancari, Mary Lambert, and on stage with Justin Vernon, The National, Sharon Van Etten, Ben Gibbard, and others.\nSPENCER."},{"date":"2022-08-12T00:00:00.000+00:00","title":"REBELUTION, Steel Pulse DENM DJ Mackle","url":"https://thegreekberkeley.com/events/rebelution-220812","img":"https://thegreekberkeley.com/wp-content/uploads/2021/12/Rebelution_22_1024.png","details":"REBELUTION\nFounded in Isla Vista, CA, Rebelution has followed their instincts since the release of their breakout 2007 debut, Courage To Grow. In 2009, the band topped the Billboard Reggae Chart for the first of what would be five consecutive #1 records; and in 2017, they garnered a GRAMMY nomination for Best Reggae Album. Rebelution’s transcendent live performances, meanwhile, have earned the group sell-out headline shows everywhere from Red Rocks to The Greek Theatre, along with festival slots at Bonnaroo, Lollapalooza, ACL, Glastonbury, and more. Their latest album, In The Moment, is deliberate and wide-ranging, infusing the quartet’s soulful, exhilarating brand of modern reggae with addictive pop hooks, alt-rock grit, and hip-hop grooves. The performances here are bold and self-assured, and the production is equally ambitious, drawing on swirling reverb and trippy delay to create an immersive sonic universe that’s both futuristic and vintage.\nSTEEL PULSE\nBearing witness to the accelerating negativity of global affairs, UK reggae legends, Steel Pulse, emerge with musical vengeance to halt the disarray of humanity. The forthcoming album, Mass Manipulation, set for early 2019 release (Rootfire Cooperative / Wiseman Doctrine), reflects four decades of bettering mankind through music. The debut single “Stop You Coming And Come” features ancient melodies paired with catchy lyrics, transporting the mind to a period of time where secrets of an African dynasty are unmasked. As reggae revolutionaries, Steel Pulse is revered by the younger generation of artists and remains a powerhouse on stages around the globe. Through the example of Mass Manipulation, Steel Pulse demonstrates the endless possibilities that come from breaking down the walls of systemic greed, and nurturing the fellowship of mankind.\nDENM\nDJ MACKLE"},{"date":"2022-08-13T00:00:00.000+00:00","title":"NATHANIEL RATELIFF \u0026 THE NIGHT SWEATS, Bahamas","url":"https://thegreekberkeley.com/events/nathaniel-rateliff-220813","img":"https://thegreekberkeley.com/wp-content/uploads/2022/03/Nathaniel_Rateliff_The_Night_Sweats_1024.jpg","details":"NATHANIEL RATELIFF \u0026 THE NIGHT SWEATS\nIt took Nathaniel Rateliff \u0026 the Night Sweats less than five years to become one of the most recognizable new forces in contemporary rock ’n’ roll. Since 2015, Rateliff has led his denim-clad, horn-flanked Night Sweats, supplying the zeal of a whiskey-chugging Pentecostal preacher to songs about this world’s shared woes. They’ve had hits, sure, but their combustible mix of soul and rock quickly cemented them as the rare generational band who balanced ecstatic live shows with engrossing and rich records. To wit, is there any other modern act capable of revving up stadium crowds for The Rolling Stones while also appearing on Saturday Night Live and CMT Crossroads and at NPR’s Tiny Desk in short order?\nWhen Rateliff returned from his pandemic-truncated solo tour in March 2020, he struggled with the same question that vexed so many of us then—what now? Fortunately, he returned to his Colorado homestead and penned a set of songs that synthesized his introspection with his anthemic inclinations. The result is The Future, the third Night Sweats album but the first to capture this octet’s true depth and breadth. An instant classic of 11 songs, the album presents something more sustainable, interesting, and indeed open—a songwriter and band growing into bigger questions and sounds, into a future that allows them to remain recognizable but be so much more compelling than some denim-clad caricature.\nBAHAMAS"},{"date":"2022-08-14T00:00:00.000+00:00","title":"COHEED AND CAMBRIA, Dance Gavin Dance Mothica","url":"https://thegreekberkeley.com/events/coheed-and-cambria-220814","img":"https://thegreekberkeley.com/wp-content/uploads/2022/02/Coheed-And-Cambria-New-Pub-2022-Alexandra-Gavillet-1024x576.jpg","details":"COHEED AND CAMBRIA\nThe music world’s most intriguing storytellers, Coheed and Cambria, have shared their anthemic new single, “The Liars Club.” The follow up to the top 10 Active Rock single “Shoulders,” will be featured on their widely anticipated new album, Vaxis II: A Window of the Waking Mind [album art \u0026 track list below], and is available today on all streaming platforms. “The Liars Club” is joined by an official animated video which follows the opening chapter of the story in Vaxis II and is streaming on the band’s YouTube channel.\nExpanding on the “The Liars Club,” Coheed and Cambria vocalist / guitarist Claudio Sanchez remarked, “When the truth is such a mess, who doesn’t want to live out a different reality? Who doesn’t want to embrace a lie?”\nCoheed and Cambria have also announced details of a massive 2022 North American summer headline tour. Deemed the “A Window of The Waking Mind Tour,” it’s the band’s first major headline tour in five years. The upcoming trek will kick off on July 12th and see the band performing at some of the largest venues of their career in major cities across the continent including Boston, Philadelphia, Nashville, Denver, Queens, Toronto, Los Angeles and more. Featuring support from Dance Gavin Dance and Mothica, artist pre-sale tickets for the summer tour will be available beginning tomorrow February 23rd at 9:00AM local time with all remaining tickets going on sale to the public on Friday, February 25th at 10:00AM local time. Coheed and Cambria are currently out on “The Great Destroyer Tour,” a U.S. headline run with special guests Sheer Mag which is set continue through mid-March giving audiences an opportunity to see the band live in intimate clubs across the U.S. [full tour itinerary below]. For tickets and more information on Coheed and Cambria’s upcoming tour dates, visit www.coheedandcambria.com.\nVaxis II: A Window of the Waking Mind, Coheed And Cambrias’s ambitious thirteen track album is produced by the band’s own Claudio Sanchez and Zakk Cervini, and will be released worldwide on May 27th. Pre-orders for the album on DSPs and for the collection’s deeply immersive Vaxis II: A Window of the Waking Mind Limited Edition Deluxe Box Set are available now.\nVaxis II: A Window of the Waking Mind welcomes us back to “The Amory Wars” as the 2nd installment of the new five-part “Vaxis” arc about a couple on the run from tyrannical forces and their mysterious new addition. The album’s limited edition deluxe box set [packaging shot below] includes the exclusive 96-page illustrated hardcover novel “A Window of the Waking Mind” which was developed by Sanchez and written by his wife Chondra Echert with strikingly realistic color artwork by Chase Stone. The 9” x 12” box set also houses an exclusive Quintillan Speaker Containment Unit Lamp (approx. 8” diameter), a 3-panel fold out poster of expanded album cover art, and the A Window of the Waking Mind Black Card which will allow all card holders early access to tickets and early entry to Coheed and Cambria headline dates. All box sets will also come with a CD copy and download of Vaxis II: A Window of the Waking Mind along with an official Certificate of Authenticity. The box set sold 8,000 copies in its first week on sale. For more information on Vaxis II: A Window of the Waking Mind Limited Edition Deluxe Box Set, visit www.coheedandcambria.com.\nNamed one of REVOLVER’s “Most Anticipated Albums of 2022,” Vaxis II: A Window of the Waking Mind includes the recently released singles “Rise, Naianasha (Cut The Cord)” and “Shoulders,” the latter of which vaulted into the Top 10 at Active Rock Radio, marking the group’s career highest radio chart position to date. “(It) masterfully pairs heavy metal-infused riffs with sweeping, melodic vocals in a way that only Coheed can,” declared MTV who placed “Shoulders” in their 2021 Favorites round-up. “Coheed and Cambria are back, and they’re heavy as ever,” asserted Billboard, with Guitar World attesting “Coheed and Cambria have come out swinging.” Brooklyn Vegan observed, “It finds the band embracing their love of classic heavy metal riffage, before exploding into the kind of soaring chorus that Coheed have been churning out since day one… they sound pretty damn inspired.”\nFor the last 20 years, Coheed and Cambria have continuously broken the mold of what a rock band can be, forging their own path and building a universe around their music unlike any other. Whether it is in the way their genre-spanning approach to songwriting has allowed them to bridge worlds without being contained to one, or the multifaceted story arc of their albums and comic book series which mark the longest running concept story in music, Coheed and Cambria have consistently shaped new standards, never conformed. Comprised of Claudio Sanchez (Vocals / Guitar), Travis Stever (Guitar), Josh Eppard (Drums) and Zach Cooper (Bass) the band has gripped listeners and press around the globe with their visionary compositions and conceptual mastery. In 2018, Coheed and Cambria made a stunning debut with their album Vaxis I: The Unheavenly Creatures, which debuted at #1 on Billboard’s “Hard Rock Albums” chart, #6 current sales and Top 15 on the “Billboard 200” chart.\nDANCE GAVIN DANCE\nMOTHICA"}]