[{"date":"2022-06-03T00:00:00.000+00:00","title":"BELLE \u0026 SEBASTIAN, Tennis Thee Sacred Souls","url":"https://thegreekberkeley.com/events/belle-and-sebastian-220603","img":"https://thegreekberkeley.com/wp-content/uploads/2022/03/bellesebastian-press-photo_1024.jpg","details":"BELLE \u0026 SEBASTIAN\nA Bit of Previous is the tenth studio album by Belle and Sebastian and their first full-length in seven years. This may be surprising to anyone following the recent life pursuits of the Glasgow 7-piece: The Boaty Weekender – a 3000 capacity star-studded four-day music festival on a cruise liner sailing the Mediterranean; a trilogy of EP’s; a soundtrack for the directorial debut of The Inbetweeners’ Simon Bird; a live album showcasing the band’s present-day iteration as savvy main stage entertainers; and in 2020 a collaborative project with fans called ‘Protecting The Hive’. But in all these idiosyncratic endeavours, as intrinsic to the band’s DNA as the stage invasion at the end of each of their shows, a full-length has eluded us.\nA Bit Of Previous is a classic Belle and Sebastian album preoccupied with songs and melodies that won’t leave your head and lyrics that can make you smile and ponder and sometimes be melancholic. It’s an album self-produced and recorded by Belle and Sebastian (with contributions from Brian McNeill, Matt Wiggins, Kevin Burleigh and Shawn Everett) and their most hands-on since The Boy With The Arab Strap.\nIn some respects, A Bit Of Previous is also a first. It’s the first album the band recorded in their native Glasgow in 20 years (the last being 2000’s Fold Your Hands Child, You Walk Like a Peasant). What started off as a pandemic necessity – having to ditch plans to record in California in spring of 2020 – became a refreshing change of pace. Unbeholden to restrictive and expensive studio schedules, it allowed for long walks through the streets and parks of Glasgow and spontaneous train journeys to nearby towns which embedded proceedings with a peculiar sense of place. The band upgraded their practice space to a makeshift studio, making some creative interior design choices to keep it pandemic safe.\nA Bit of Previous is Belle and Sebastian taking on age and getting older and emerging all the more vital for it. ‘Young And Stupid’ is a stuttering acoustic rocker that without its lilting violin might be mistaken for a T. Rex song, the lyrics and nonchalant vocals facing the passage of time with wry ennui: “Now we’re old with creaking bones / Some with partners some alone  / Some with kids and some with dogs  / Getting through the nightly slog / Everything is fine when you’re young and stupid”. ‘Come On Home’, with its fireside piano and conversational exchanges between Murdoch and Martin, evokes a handing over of the generational baton with a call to “Give a chance to the old / Set the record straight on the welfare state / Give a chance to the young / Everyone deserves a life in the sun”.\nWhile the arrangements are often playful, there is an underlying gravity. The deceptively feelgood, choir backed ‘If They’re Shooting At You’ reads like a poignant ode to defiance and survival: ‘If they’re shooting at you kid / You must be doing something right”. On Martin’s ‘Reclaim The Night’, a jaunty backbeat tells of a cross-generational everywoman trepidation that in 2022 is more pertinent than ever.\nA Bit of Previous is also scattered with big, occasionally delirious pop moments. ‘Unnecessary Drama’ rips through a cacophony of overdriven riffs and a droning harmonica that borders on the unhinged and is one of the band’s heaviest outings since, well, ever. The 140+ bpm ’Talk To Me Talk To Me’ is ablaze with euro synths and keyboard horns as the voices of Murdoch and Martin intertwine on a breathless chorus. ‘Working Boy in New York City’ exists in a parallel universe where the band did in fact make it to California – such is the escapist bliss of its sloping flute and bittersweet funk.\nOn the other side of the spectrum are some of Belle and Sebastian’s most moving ballads. Tender finger-picked paean to a lover ‘Do It For Your Country’ and doo-wop-inflicted ‘Sea Of Sorrow’ showcase Murdoch’s tenor at its most bare and affecting, while Stevie Jackson contributes lovelorn country waltz ‘Deathbed of My Dreams’.\nSo what is a A Bit of Previous? It’s a bit of everything, and a lot of what makes Belle and Sebastian so special and enduring. It’s a band tackling the insight, experience and responsibility that come with getting older with humour and irreverence and lyrical exactitude and musical bravado. It’s one of the UK’s most beloved pop portraitists asserting themselves as an infallible source of energy and fun.\nThere’s a touch of Buddhism, too, a practice increasingly influential on Murdoch’s outlook in recent years and given a further manifestation via his popular weekly guided online meditation sessions. The album title is possibly a reference to the concept of reincarnation. As Murdoch notes in the liner notes:  “There is a firmly held belief in Buddhism that we have been reborn so many times and in so many guises that if we look around us, we are bound to see a person who has been our mother in a past life. And we are surrounded by people who have been our children. If we truly had that in our minds and in our hearts, we would drop the prejudice we had: our attitude to strangers and difficult people would alter emphatically.”\nTENNIS\nTHEE SACRED SOULS"},{"date":"2022-06-05T00:00:00.000+00:00","title":"REX ORANGE COUNTY","url":"https://thegreekberkeley.com/events/rex-orange-county-220605","img":"https://thegreekberkeley.com/wp-content/uploads/2022/01/waespi_rexoc_press2022_20.jpg","details":"REX ORANGE COUNTY"},{"date":"2022-06-10T00:00:00.000+00:00","title":"ERYKAH BADU, Noname","url":"https://thegreekberkeley.com/events/erykah-badu-220610","img":"https://thegreekberkeley.com/wp-content/uploads/2022/03/ErykahBadu_1024.jpg","details":"ERYKAH BADU\nNONAME\nNoname (born Fatimah Warner) is an American artist from Chicago, Illinois, who blurs the lines of poetry and rap through the music she creates.\nNoname grew up in Bronzeville, a historic neighborhood on the southside of Chicago that famously attracted accomplished black artists and intellectuals of all types. Noname first discovered her love for words while taking a creative writing class as a sophmore in highschool.\nShe became enamored with poetry and spoken word- pouring over Def Poetry Jam clips on YouTube and attending open mics around the city. Noname regularly attended and performed at an open mic at Harold Washington Library- YouMedia’s Lyricist Loft.\nAfter sessions at YouMedia, Noname would participate in cyphers and started getting into freestyling. When she was just a senior in highschool, she placed third in “Louder Than A Bomb”, a poetry competition with 120 Chicago high schools in participation. She remained connected with the artists she met at YouMedia and in 2013, her verse on Chance the Rapper’s “Lost” attracted the beginning of her large fan base, most of whom have been following her every move since.\nOn July 31st Noname released her debut project entitled Telefone which was 3 years in the making and highly anticipated by fans and media alike. Instantly the project gained critical acclaim with a rave review by Pitchfork and landing her praise from major outlets like Rolling Stones, Complex and Dazed \u0026 Confused. Noname has been hailed by The FADER, Complex, and Rolling Stone as one of the most exciting and important new artists of 2016.\nThanks to Telefone’s success, Noname played some shows in support of Ms. Lauryn Hill, who hand-picked Noname to open for her on tour. When first approaching the project, Noname set out to emulate the feeling of talking on the phone with someone for the first time. She describes Telefone as “an introductory conversation with someone you’re interested in”. But as Noname continued to work on the tape, it also transitioned a bit into mortality: the idea of life and death and the duality between those two things."},{"date":"2022-06-11T00:00:00.000+00:00","title":"ALISON WONDERLAND, Mr. Carmack Quiet Bison","url":"https://thegreekberkeley.com/events/alison-wonderland-220611","img":"https://thegreekberkeley.com/wp-content/uploads/2022/01/Alison_wonderland_22_1024.jpg","details":"ALISON WONDERLAND\nAlison Wonderland architects a world of her own design as its chief author, creator, and voice. The Sydney-born and Los Angeles-based singer, producer, songwriter, and DJ realises this vision at the intersection of future-facing pop, explosive beat-craft, and eternal dance rhythms.\nEmerging in 2009 with regular night club sets around Australia and a series of remixes for everyone from Little Dragon to Justin Bieber, she ignited an international splash in 2015 with the full-length debut, Run. It reached gold status in Australia and earned two ARIA Awards nominations, for Best Dance Release and Best Video for “U Don’t Know.” She went on to debut her live set in the US that year at Coachella. Fast forward to 2017, she achieved the Best New Artist honour at the first-ever Electronic Dance Music Awards, while her remix of Dua Lipa’s “New Rules” soared to #1 on the Billboard Dance Charts.\nHer sound has quietly inched towards mainstream ubiquity as the sonic sorceress received the “Highest Female DJ Billing Ever at Coachella,” captured #1 on the Billboard Top Dance/Electronic Albums Chart twice consecutively, headlined sold out arenas around the globe, and clocked upwards of 100 million streams by 2018. Not to mention, Triple J declared that “both sonically and vocally, Awake is Alison’s biggest work to date,” The Music called Alison “an intuitive songwriter, who wires into any sort of emotion,” and Stack Magazine named her an “Industry Leader.” In the US, Billboard gave Awake rave reviews whilst ELLE proclaimed her one of its “Women On The Verge,” and she garnered features from FADER, Glamour, Seventeen, Interview, and more. Simultaneously, Alison’s Radio Wonderland show clocked 5 million-plus iTunes downloads as well as broadcasting to over 20 countries and featuring prominently on the Sirius XM channel Diplo’s Revolution.\nMR. CARMACK\n“Make music like no one’s listening” is the motto of Aaron Carmack, and appropriately so.  His story is a three-part series, divided into factions of past, present, and future. Every element of the past, as Aaron Carmack would explain, has had an effect on who he is today as both a writer/producer and DJ. Being born and raised in San Francisco, attending and dropping out of college in Long Beach, CA, moving to Oahu for three years and living off income from monthly releases on Bandcamp – Carmack’s music is an expression and perpetual reflection of all of it.\nConstantly translating personal experience into his craft, Carmack finds inspiration from a range of sources, from his friends and fellow musicians in production cliques, Team Supreme and Soulection, to his travels and numerous sold out tours of five continents over the past two years, sharing stages with folks like Hudson Mohawke, Just Blaze, Cashmere Cat, and Diplo. These influences, combined with a hunger for discovering the newest, most cutting-edge sounds on sites like Soundcloud, are some of the ingredients to the now-Los Angeles-based producer’s distinct creative process.\nLike a hinge to the doorway between dance music and hip hop, Carmack’s musical output increasingly occupies a void frontier between the two genres, identified by his contemporaries, fans, and himself purely as “Carmack”. With a devotion to the studio and a grinding work ethic, the inventive producer aims to release a prolific amount of music in coming months, all while performing as often as possible. Stay tuned.\nQUIET BISON"},{"date":"2022-06-16T00:00:00.000+00:00","title":"SOFI TUKKER, The Knocks Mary Droppinz","url":"https://thegreekberkeley.com/events/sofi-tukker-220616","img":"https://thegreekberkeley.com/wp-content/uploads/2022/02/approved-photo_horizontal-photo-credit-Elizabeth-Miranda-1.jpg","details":"SOFI TUKKER\nSOFI TUKKER, the genre-defying duo of Sophie Hawley-Weld and Tucker Halpern, is celebrated for their inclusive and global perspective on electronic music as well as their work’s themes of liberation, unity, and self-empowerment. They began daily livestreams at the start of the pandemic, eventually doing hundreds of streams for millions of viewers, becoming the second most live-streamed artist of 2020. The daily livestreams also birthed the Freak Fam, their vibrant fan community that assembles 24/7 online and in-person at Freak Fam meetups spanning the globe. In 2021 SOFI TUKKER dove back into the live world with field-packing, high energy festival sets at Firefly and Outside Lands. Now the group is back with their first headline live tour since their sold-out 2019 run, in support of their new album WET TENNIS, the highly anticipated follow-up to their GRAMMY-nominated debut album Treehouse, out April 29th.\nWET TENNIS is an acronym: When Everyone Tries to Evolve, Nothing Negative Is Safe. WET TENNIS is about forward movement, optimism and positive growth, no matter what the challenge. WET TENNIS is a dedication to constantly evolving and celebrating aliveness. WET TENNIS is a lifestyle. It says: everything’s better when wet. Wetness is excitement, mother nature, movement, flow, sweat, and juice. It’s athletic and elegant. It’s loud and bright. All these qualities will be on full display when SOFI TUKKER comes to town, both on stage and in the audience.\nThe band sums it up best – “We’re overjoyed and proud to be announcing our first headline tour since the world was turned upside down. Over the past few years, the most incredible community was formed out of love, connection, acceptance, and music through our daily livestreams. The time has come to bring us all together in person. This tour is unlike any other we’ve done because it’s with brand new music and production from our upcoming album WET TENNIS and because, this time around, somehow it’s gonna be even crazier because the Freak Fam exists!”\nTHE KNOCKS\nMARY DROPPINZ"},{"date":"2022-06-17T00:00:00.000+00:00","title":"ANDREW BIRD IRON \u0026 WINE, Allison Russell","url":"https://thegreekberkeley.com/events/andrew-birdbriron-wine-220617","img":"https://thegreekberkeley.com/wp-content/uploads/2021/12/andrewbirdxiron_22_1024.png","details":"ANDREW BIRD\nAndrew Bird is an internationally acclaimed, Grammy-nominated multi-instrumentalist, vocalist, whistler, and songwriter who picked up his first violin at the age of four and spent his formative years soaking up classical repertoire completely by ear. Since beginning his recording career in 1997, Bird has released 17 albums and performed extensively across the globe. He has recorded with the Preservation Hall Jazz Band, appeared as “Dr. Stringz” on Jack’s Big Music Show, and headlined concerts at Carnegie Hall, Sydney Opera House, Walt Disney Concert Hall, and festivals worldwide.\nBird performed as the Whistling Caruso in Disney’s The Muppets movie, scored the FX series Baskets, and collaborated with inventor Ian Schneller on Sonic Arboretum, an installation that exhibited at New York’s Guggenheim Museum, Boston’s ICA, and the MCA Chicago. Bird has been a featured TED Talks presenter, a New Yorker Festival guest, and an op-ed contributor for the New York Times.\nMore recently, Bird released a series of site-specific improvisational short films and recordings called Echolocations, recorded in remote and acoustically interesting spaces: a Utah canyon, an abandoned seaside bunker, the middle of the Los Angeles River, and a reverberant stone-covered aqueduct in Lisbon. Additionally, Bird hosts an ongoing series of live-streamed performances called Live from the Great Room, putting the creative process on display for fans as he collaborates and converses with friends in a candid, intimate setting.\nShortly after receiving his 2020 Grammy nomination for Best Folk Album, with My Finest Work Yet, Andrew Bird made his professional acting debut in the cast of Fargo’s fourth installment, which concluded on FX in November 2020 and is currently streaming via Hulu. In March 2021, Bird released his latest project, These 13, an album entirely co-written and recorded with his longtime friend and former Squirrel Nut Zippers collaborator, Jimbo Mathus. Captured live to tape, just the two of them playing and singing from opposite sides of a microphone, These 13 marked the first set of new music that Bird and Mathus created together in more than 20 years.\nIRON \u0026 WINE\nIron \u0026 Wine is the musical project of singer-songwriter Sam Beam. Born and raised in South Carolina, Beam was teaching film when his home recorded debut, The Creek Drank the Cradle, was released on Sub Pop records in 2002. Garnering both critical and popular acclaim, Beam was vaulted into the spotlight of the burgeoning indie-folk and Americana scenes. Now entering its 20th year, Iron \u0026 Wine have released seven full length recordings, numerous EPs / singles, and collaborations with Calexico, Ben Bridwell (Band of Horses) and Jesca Hoop all on their way to becoming a four-time GRAMMY nominee. Iron \u0026 Wine’s music has captured the emotion and imagination of listeners with their distinctly cinematic songs; in particular they’ve become synonymous with the movies Twilight and Garden State and continue to find a home in your favorite film, TV show or streaming playlist. As the world continues to spin – so do Iron \u0026 Wine continue on their path of releasing new music and touring. Follow Iron \u0026 Wine on Instagram, Facebook and Twitter.\n  ALLISON RUSSELL"},{"date":"2022-06-18T00:00:00.000+00:00","title":"BRANDI CARLILE","url":"https://thegreekberkeley.com/events/brandi-carlile-220618","img":"https://thegreekberkeley.com/wp-content/uploads/2022/03/brandi_carlile_1024-2.jpg","details":"BRANDI CARLILE\nOnly a global pandemic could have forced Brandi Carlile to hit pause. After two hard-fought decades-in-the-making, Carlile was in the midst of experiencing the biggest highs of her acclaimed career thus far. From a show-stealing debut at the 61st GRAMMY Awards, to her first sold-out arena show at Madison Square Garden, to an ever-growing number of awards and accolades, all-star collaborations and countless other staggering achievements.\nFinding herself stuck at home outside of Seattle in the rural foothills of the Cascade Mountains, Carlile had no choice but to slow down, reassess and realign her priorities. Luckily for Carlile, home happens to be a 90-acre compound shared with not only her wife, Catherine, and two daughters, but also her chosen family: longtime collaborators and bandmates Tim and Phil Hanseroth as well as her cello player Josh Neumann among an ever-growing contingency.\nIt was during this time that In These Silent Days took shape. Inspired by the mining of her own history while writing her #1 New York Times Best Selling memoir Broken Horses, the new ten-song record chronicles acceptance, faith, loss and love and channels icons like David Bowie, Freddie Mercury, Elton John and Joni Mitchell—the latter two who, by some sort of cosmic alignment of the stars, have turned out to be close friends in addition to being her biggest heroes and inspirations.\nReuniting with producers Dave Cobb and Shooter Jennings, the album takes Carlile’s voice, which The New York Times says, “sounds like an element of nature,” and pushes it to even greater heights and dramatic peaks. From the anthemic first single “Right On Time” to the intimately romantic “You and Me On The Rock” and the blistering “Broken Horses,” the songs tell a story of connection and empathy in the midst of distance and estrangement and showcase an artist continuing to push herself and widen her arms around an inclusive, ever-growing island of misfits."},{"date":"2022-06-24T00:00:00.000+00:00","title":"NORAH JONES, Natalie Bergman","url":"https://thegreekberkeley.com/events/norah-jones-220624","img":"https://thegreekberkeley.com/wp-content/uploads/2022/03/NorahJones_1024-1.jpg","details":"NORAH JONES\nNorah Jones first emerged on the world stage with the February 2002 release of Come Away With Me, her self-described “moody little record” that introduced a singular new voice and grew into a global phenomenon, sweeping the 2003 GRAMMY Awards. Since then, Jones has become a nine-time GRAMMY-winner, sold more than 50 million albums, and her songs have been streamed six billion times worldwide. She has released a series of critically acclaimed and commercially successful solo albums—Feels Like Home (2004), Not Too Late (2007), The Fall (2009), Little Broken Hearts (2012), Day Breaks (2016), Pick Me Up Off The Floor (2020), the live album ‘Til We Meet Again (2021), and her first-ever holiday album I Dream Of Christmas (2021)—as well as albums with her collective bands The Little Willies, El Madmo, and Puss N Boots featuring Sasha Dobson and Catherine Popper who released their second LP Sister in 2020. The 2010 compilation …Featuring Norah Jones showcased her incredible versatility by collecting her collaborations with artists as diverse as Willie Nelson, Outkast, Herbie Hancock, and Foo Fighters. Since 2018 Jones has been releasing a series of singles including collaborations with artists and friends such as Mavis Staples, Jeff Tweedy, Thomas Bartlett, Tarriona Tank Ball, Rodrigo Amarante, and Brian Blade, some of which were compiled on the 2019 singles collection Begin Again."},{"date":"2022-07-09T00:00:00.000+00:00","title":"CAAMP, with special guest Houndmouth","url":"https://thegreekberkeley.com/events/caamp-220709","img":"https://thegreekberkeley.com/wp-content/uploads/2022/03/Caamp_1024.jpg","details":"CAAMP\nOn their earthy, jubilant new album, the Columbus, Ohio, band Caamp examine those in-between days that make up a life—not the best or most eventful days, certainly not the worst or most tragic, but those full of small pleasures and forgotten disappointments. Taylor Meier, the group’s singer and primary songwriter, came up with the phrase Lavender Days to describe them—a phrase that struck him out of the blue, “like a coconut out of the sky,” he says with a laugh. Why lavender? “It’s nostalgic. It can remind you of your grandmother’s perfume or maybe the air freshener in your mom’s car. It can summon up all of these incredible memories and transport you to those in-between days, which I think everybody remembers with more clarity than the big events.”\nCaamp have been writing and singing about those lavender days—in tender love songs tinged with melancholy and determination—ever since Meier played his first notes with bandmate Evan Westfall more than a decade ago. They met as students at Ohio University in Athens, playing local coffeehouses and growing more committed to this extracurricular project. With the addition of Matt Vinson on bass and Joseph Kavalec on keyboards, they built up a grassroots following well beyond the Buckeye State based on the inventiveness of Meier’s songwriting, the exuberance of their live performances, and their tireless dedication to touring as much as possible.\nFrom their self-titled 2016 debut album to their most recent releases of By and By in 2019 to Live From Newport Music Hall, “Fall, Fall, Fall”, and “Officer of Love” in 2020 the band has amassed over 590 million streams globally as well as achieved multiple #1’s at AAA radio. The band has headlined sold out shows and performed at major festivals around the world including Firefly, Shaky Knees, Forecastle, Outside Lands, Austin City Limits, Great Escape and many more. They have also performed on national TV on Jimmy Kimmel Live!, CBS This Morning Saturday and Late Show with Stephen Colbert.\nTheir new album Lavender Days will be released via Mom + Pop records on June 24th.\nHOUNDMOUTH"},{"date":"2022-07-10T00:00:00.000+00:00","title":"FLEET FOXES, Tim Bernardes","url":"https://thegreekberkeley.com/events/fleet-foxes-220710","img":"https://thegreekberkeley.com/wp-content/uploads/2022/02/PRESS-PHOTO-Fleet-Foxes-Photo-Credit-Shervin-Lainez-9-1_1024.jpg","details":"FLEET FOXES\nFleet Foxes is an American indie folk band from Seattle, WA. Led by lead singer-songwriter Robin Pecknold, the band released their fourth critically acclaimed album Shore in the fall of 2020. Shore earned the band their second Grammy nomination (Best Alternative Music Album), and sweeping praise (MOJO five stars, Rolling Stone four stars, Pitchfork fifth consecutive Best New Music) with Rolling Stone calling the album “…the most immediately rewarding Fleet Foxes record since their brilliant 2008 debut.”\nTIM BERNARDES"},{"date":"2022-07-15T00:00:00.000+00:00","title":"KING PRINCESS, with special guests Charlotte Day Wilson Dora Jar","url":"https://thegreekberkeley.com/events/king-princess-220715","img":"https://thegreekberkeley.com/wp-content/uploads/2022/03/king-princess-1024.jpg","details":"KING PRINCESS\nBorn and raised in Brooklyn, NY, King Princess is a vocalist, multi-instrumentalist and songwriter whose debut single, an ode to untold queer histories titled “1950,” became an overnight smash hit with over 560 million streams to date and eventually achieving Platinum status in the United States and Australia. Her debut album Cheap Queen was released in 2019 via Mark Ronson’s Zelig Records/Columbia Records to widespread critical acclaim from The New York Times, Pitchfork, NPR, Rolling Stone and others, and she has performed on “Saturday Night Live” and “The Late Show with Stephen Colbert.” Her sold-out tours have taken her across the world with festival sets at Coachella, Glastonbury, Governors Ball and Bonnaroo and landed her on the cover of V Magazine, GQ Style UK, Highsnobiety and more.\nCHARLOTTE DAY WILSON\nCharlotte Day Wilson is a 28-year-old vocalist, producer and multi-instrumentalist from Toronto.\nWith roots ranging from R\u0026B to folk, her soulful, singular voice and timeless sound garnered global attention with the 2016 release of her debut EP CDW, and through her work with friends and collaborators BADBADNOTGOOD, Daniel Caesar and River Tiber. After sharing stages with the likes of Angel Olsen, Local Natives, Feist, Haim, and Rhye, Charlotte’s first headlining tour in 2018 sold out in major markets across North America and Europe. Her music has received universal acclaim from NPR, Pitchfork, The Fader, Billboard, Spin, and many others, and her songs have received over 150 million streams across all platforms. Charlotte’s anthemic single “Work” has been featured in Apple’s Shot on iPhone 7 commercial as well as TV shows like HBO’s Euphoria and Netflix’s Grace \u0026 Frankie. In 2018, Charlotte and director Fantavious Fritz won the Prism Prize for the “Work” music video and used the prize money to create the Work Film Grant, a $10,000 grant for Canadian female and gender non-binary filmmakers.\nCharlotte returned in 2018 with the poignant EP Stone Woman, a clear statement of intent and a stirring demonstration of Charlotte’s power and poise. Both CDW and Stone Woman EPs were longlisted for Canada’s renowned Polaris Music Prize, and in 2019 Stone Woman was honored with a Juno Award nomination for R\u0026B/Soul Recording of the Year. In 2019 Charlotte made her U.S. television debut performing “Work” on The Late Late Show with James Corden. Charlotte released her debut studio album ALPHA on July 9th, 2021 to critical acclaim, and has amassed over 50 million streams to date. The single “Take Care of You” feat. Syd was nominated for the Traditional R\u0026B/Soul recording of the year at the 2021 Juno Awards.\nALPHA Deluxe is set to be released on Dec 1st, 2021. The album features two bonus tracks; “Even is the Lie” and the remix of “Take Care of You” which features King Princess, Amaarae and Meshell Ndegeocello.\nDORA JAR\nDora Jar is an artist who refuses to be defined. Despite having only shared a handful of songs, each track the 24 year old has released has been distinctive, endlessly fascinating and, quite frankly, brilliant. From the hammering guitars on “Multiply” to the ominous “Did I Get It Wrong,” they exemplify an artist with a clear artistic vision: to be as expansive, honest and unequivocally herself as is humanly possible."},{"date":"2022-07-16T00:00:00.000+00:00","title":"KHRUANGBIN, Men I Trust","url":"https://thegreekberkeley.com/events/khruangbin-220716","img":"https://thegreekberkeley.com/wp-content/uploads/2022/02/2021-Press-Photo-TM-Size-USE-FOR-TICKETING-PAGES-1024x576.jpg","details":"KHRUANGBIN\nKhruangbin has always been multilingual, weaving far-flung musical languages like East Asian surf-rock, Persian funk, and Jamaican dub into mellifluous harmony. But on its third album, it’s finally speaking out loud. Mordechai features vocals prominently on nearly every song, a first for the mostly instrumental band. It’s a shift that rewards the risk, reorienting Khruangbin’s transportive sound toward a new sense of emotional directness, without losing the spirit of nomadic wandering that’s always defined it. And it all started with them coming home.\nBy the summer of 2019, the Houston group—bassist Laura Lee, guitarist Mark Speer, drummer DJ Johnson—had been on tour for nearly three-and-a-half years, playing to audiences across North and South America, Europe, and southeast Asia behind its acclaimed albums The Universe Smiles Upon You and Con Todo El Mundo. They returned to their farmhouse studio in Burton, Texas, ready to begin work on their third album. But they were also determined to slow down, to take their time and luxuriate in building something together. \nIt’s a lesson Lee had recently learned with the help of a new friend, a near-stranger who had reached out when she was feeling particularly unmoored, inviting her to come hiking with his family. That day, as they’d all made their way toward the distant promise of a waterfall, Lee had felt a dawning clarity about the importance of appreciating the journey, rather than rushing headlong toward the next destination—something she’d almost lost sight of during the band’s whirlwind rise. When they reached the waterfall at last, Lee’s friend urged her to jump, a leap she likens to a baptism. As she did, he screamed her name—her full name, the one she’d recently taken from her grandfather. In that instant, Laura Lee Ochoa was reborn. She emerged feeling liberated, grateful for what her friend had shown her. His name was Mordechai.\nOchoa’s rejuvenation found its expression in words—hundreds of pages’ worth, which she’d filled over a self-imposed day of silence. As Khruangbin began putting together the songs that would make up the next record, discovering in them spaces it seemed like only vocals could fill, they turned to those notebooks. Khruangbin had worked with lyrics before: the love-letter poetry of “Friday Morning,” the ghosts of conversations gone by in “Cómo Te Quiero.” But this time Ochoa had found she had something to say—and so did the songs. They needed each other. And letting those words ring out gave Khruangbin’s cavernous music a new thematic depth.\nChief among those themes is memory—holding onto it, letting it go, naming it before it disappears. Again and again the songs play on those notions, from the sun-dappled disco of lead single “Time (You And I)”—which evinces the feeling of a festival winding down to its final blowout hours—to the lilting “So We Won’t Forget,” which finds Ochoa filling her apartment with memories she’s scrawled on Post-Its to prevent them slipping away. It’s there, too, in “Dearest Alfred,” which was inspired by a trove of letters Ochoa’s grandfather wrote to his twin brother, as well as “If There Is No Question,” a metaphysical devotional (by way of Marvin Gaye) that harkens back to Johnson and Speer’s earliest days in a church band. And those same nostalgic wisps curl all around “Connaissais De Face,” a Middle Eastern vamp by way of Serge Gainsbourg that evokes all the ruminative romance of a French New Wave film, layered with its own tender dialogue of reminiscence.\nMusically, the band’s ever-restless ear saw it pulling reference points from Pakistan, Korea, and West Africa, incorporating strains of Indian chanting boxes and Congolese syncopated guitar. But more than anything, the album became a celebration of Houston, the eclectic city that had nurtured them, and a cultural nexus where you can check out country and zydeco, trap rap, or avant-garde opera on any given night. The Roy Ayers funk of opener “First Class” created a lush bed for the band to stretch out on, singing wryly about popping champagne while jet-setting all over the world. But in the end, those brags are revealed to be a shoutout to the home that made all this possible, a love that’s evident in its hands-in-the-air refrain of “H-Town.”\nIn those years away from that home, Khruangbin’s members often felt like they were swimming underwater, unsure of where they were going, or why they were going there. But Mordechai leads them gently back to the surface, allowing them to take a breath, look around, and find itself again. It is a snapshot taken along a larger journey—a moment all the more beautiful for its impermanence. And it’s a memory to revisit again and again, speaking to us now more clearly than ever.\nMEN I TRUST\nHear ye, hear ye! We are super thrilled to announce that we will resume touring in N. America this fall for the release of our new and fourth album called “The Untourable Album”. We started working on this album amidst the global lockdown and didn’t expect to be able to “tour” these songs. We wanted to take the opportunity to work on new and different material, without necessarily intending to play these songs live. We wrote freely, as if we were suspended in time with no external attachments. The initial release date had to be delayed however, when Dragos got into a motorcycle accident and had to recover for several weeks. So here we are now, almost ready to release the album, while everything is slowly reopening and the lockdown seems to be a thing of the past. It looks like the “Untourable Album” will be tourable after all! We are still in the process of polishing the songs and doing the last tweaks before the album is ready. We will have an official release date super soon, stay tuned. Thank you for your ongoing support and we’re looking forward to see everyone again in real life!"},{"date":"2022-07-17T00:00:00.000+00:00","title":"KHRUANGBIN, Men I Trust","url":"https://thegreekberkeley.com/events/khruangbin-220717","img":"https://thegreekberkeley.com/wp-content/uploads/2022/02/2021-Press-Photo-TM-Size-USE-FOR-TICKETING-PAGES-1024x576.jpg","details":"KHRUANGBIN\nKhruangbin has always been multilingual, weaving far-flung musical languages like East Asian surf-rock, Persian funk, and Jamaican dub into mellifluous harmony. But on its third album, it’s finally speaking out loud. Mordechai features vocals prominently on nearly every song, a first for the mostly instrumental band. It’s a shift that rewards the risk, reorienting Khruangbin’s transportive sound toward a new sense of emotional directness, without losing the spirit of nomadic wandering that’s always defined it. And it all started with them coming home.\nBy the summer of 2019, the Houston group—bassist Laura Lee, guitarist Mark Speer, drummer DJ Johnson—had been on tour for nearly three-and-a-half years, playing to audiences across North and South America, Europe, and southeast Asia behind its acclaimed albums The Universe Smiles Upon You and Con Todo El Mundo. They returned to their farmhouse studio in Burton, Texas, ready to begin work on their third album. But they were also determined to slow down, to take their time and luxuriate in building something together. \nIt’s a lesson Lee had recently learned with the help of a new friend, a near-stranger who had reached out when she was feeling particularly unmoored, inviting her to come hiking with his family. That day, as they’d all made their way toward the distant promise of a waterfall, Lee had felt a dawning clarity about the importance of appreciating the journey, rather than rushing headlong toward the next destination—something she’d almost lost sight of during the band’s whirlwind rise. When they reached the waterfall at last, Lee’s friend urged her to jump, a leap she likens to a baptism. As she did, he screamed her name—her full name, the one she’d recently taken from her grandfather. In that instant, Laura Lee Ochoa was reborn. She emerged feeling liberated, grateful for what her friend had shown her. His name was Mordechai.\nOchoa’s rejuvenation found its expression in words—hundreds of pages’ worth, which she’d filled over a self-imposed day of silence. As Khruangbin began putting together the songs that would make up the next record, discovering in them spaces it seemed like only vocals could fill, they turned to those notebooks. Khruangbin had worked with lyrics before: the love-letter poetry of “Friday Morning,” the ghosts of conversations gone by in “Cómo Te Quiero.” But this time Ochoa had found she had something to say—and so did the songs. They needed each other. And letting those words ring out gave Khruangbin’s cavernous music a new thematic depth.\nChief among those themes is memory—holding onto it, letting it go, naming it before it disappears. Again and again the songs play on those notions, from the sun-dappled disco of lead single “Time (You And I)”—which evinces the feeling of a festival winding down to its final blowout hours—to the lilting “So We Won’t Forget,” which finds Ochoa filling her apartment with memories she’s scrawled on Post-Its to prevent them slipping away. It’s there, too, in “Dearest Alfred,” which was inspired by a trove of letters Ochoa’s grandfather wrote to his twin brother, as well as “If There Is No Question,” a metaphysical devotional (by way of Marvin Gaye) that harkens back to Johnson and Speer’s earliest days in a church band. And those same nostalgic wisps curl all around “Connaissais De Face,” a Middle Eastern vamp by way of Serge Gainsbourg that evokes all the ruminative romance of a French New Wave film, layered with its own tender dialogue of reminiscence.\nMusically, the band’s ever-restless ear saw it pulling reference points from Pakistan, Korea, and West Africa, incorporating strains of Indian chanting boxes and Congolese syncopated guitar. But more than anything, the album became a celebration of Houston, the eclectic city that had nurtured them, and a cultural nexus where you can check out country and zydeco, trap rap, or avant-garde opera on any given night. The Roy Ayers funk of opener “First Class” created a lush bed for the band to stretch out on, singing wryly about popping champagne while jet-setting all over the world. But in the end, those brags are revealed to be a shoutout to the home that made all this possible, a love that’s evident in its hands-in-the-air refrain of “H-Town.”\nIn those years away from that home, Khruangbin’s members often felt like they were swimming underwater, unsure of where they were going, or why they were going there. But Mordechai leads them gently back to the surface, allowing them to take a breath, look around, and find itself again. It is a snapshot taken along a larger journey—a moment all the more beautiful for its impermanence. And it’s a memory to revisit again and again, speaking to us now more clearly than ever.\nMEN I TRUST\nHear ye, hear ye! We are super thrilled to announce that we will resume touring in N. America this fall for the release of our new and fourth album called “The Untourable Album”. We started working on this album amidst the global lockdown and didn’t expect to be able to “tour” these songs. We wanted to take the opportunity to work on new and different material, without necessarily intending to play these songs live. We wrote freely, as if we were suspended in time with no external attachments. The initial release date had to be delayed however, when Dragos got into a motorcycle accident and had to recover for several weeks. So here we are now, almost ready to release the album, while everything is slowly reopening and the lockdown seems to be a thing of the past. It looks like the “Untourable Album” will be tourable after all! We are still in the process of polishing the songs and doing the last tweaks before the album is ready. We will have an official release date super soon, stay tuned. Thank you for your ongoing support and we’re looking forward to see everyone again in real life!"},{"date":"2022-07-23T00:00:00.000+00:00","title":"SLIGHTLY STOOPID, Pepper Common Kings Fortunate Youth","url":"https://thegreekberkeley.com/events/slightly-stoopid-220723","img":"https://thegreekberkeley.com/wp-content/uploads/2022/02/Slightly-Stoopid_KZ_LR.jpg","details":"SLIGHTLY STOOPID\nThe story of Slightly Stoopid, at its core, is one of brotherhood. It’s the story of Miles Doughty and Kyle McDonald, two musicians determined to succeed on their own terms, creating a multi-genre fusion of rock, reggae and blues with hip-hop, funk, American folk, metal, and punk. It’s the story of a duo that has not just survived, but thrived, as “brothers from other mothers”- keeping true to their authenticity, throughout two decades of relentless touring, and evolved songwriting. The duo has repeatedly created lasting artistic statements despite a music industry that too often prioritizes style over substance.\nSlightly Stoopid is and continues to be a musical brotherhood that always welcomes guest musicians and the art of collaboration. Doughty and McDonald remain unwavering in their principles of independence, honoring their diversity of influences and mentors, and furthering their inherited legacy of the Southern California sound.\n“Once we found music as a form of expression, as an outlet, we did whatever it took to survive,” said McDonald in a 2018 interview. “We are who we are- a product of Southern California. And, we are where we are in life because of how passionate we are about the music.”\nPEPPER\nTwo decades. They’ve gone by in a blur, filled with soundchecks, encores, album releases, and sold-out shows stretching from the California coastline to the UK mainland. Along the way, Pepper has sharpened its own “Kona dub-rock” sound — a blend of reggae, alternative rock, island rhythms, and punky spirit — while also building a community of fans and likeminded bands.\nBefore Pepper began building a community in its adopted hometown of Southern California, the group held its very first rehearsal in 1997 in Kailua-Kona, Hawaii. All three members were natives of the Big Island, and together, they made a sound that nodded to their tropical roots while also moving forward into new territory. After earning a local fanbase in Hawaii, they moved to the mainland, where Pepper quickly became a popular live act. Pepper’s diverse music allowed the group to tour the country with a wide variety of bands, including reggae icons (The Wailers), punk bands (Pennywise), reggae-rockers (311, Slightly Stoopid), and hip-hop legends (Snoop Dogg). Meanwhile, the band’s admiration for DIYminded groups like NOFX inspired Pepper to launch its own label, LAW Records, which gave the trio complete control over its own music. It also allowed the band to sign other acts, which expanded Pepper’s circle even further.\nCOMMON KINGS\nIn a saturated musical landscape, Common Kings has carved their own path. The Orange County by way of South Pacific four-piece was nominated for a GRAMMY for their debut album (Lost In Paradise) in 2016 and has been on an upward trajectory ever since. Common Kings followed up with their 2018 EP One Day (Mensch House Records) featuring Stephen Marley, ¡Mayday! and Kat Dahlia, and ended the year supporting Bruno Mars on his sold out Hawaii shows. Since wrapping their tour with Sublime, Common Kings are set to embark on the Croptober Tour with Landon McNamara, Eli-Mac, Big Body Cisco, \u0026 Westafa across the West Coast beginning this October in Los Angeles. Fans can expect new music very soon.\nCommon Kings strikes the perfect balance between R\u0026B, rock, reggae, pop and island influences from the collective minds of JR King (vocals), Mata (guitar), Uncle Lui (bass), and Rome (drums). The amalgamation comes from growing up on healthy doses of Van Morrison, Stevie Wonder, George Benson, Jim Croce, The Who, Led Zeppelin, Gypsy Kings, Earth Wind and Fire, and Bob Marley. These influences originate from each band members love for various genres, and widespread knowledge of music.\nWith a GRAMMY nomination under their belt, the achievement of reaching 500,000 single downloads, along with their remarkable touring accomplishments (providing direct support for major acts such as opening two sold out shows for Bruno Mars at Aloha Stadium in November, Justin Timberlake’s 20/20 World Experience Tour, Meghan Trainor’s Untouchable Tour and Matisyahu’s 2017 Fall Tour), Common Kings show no signs of slowing down.\nFORTUNATE YOUTH"},{"date":"2022-07-29T00:00:00.000+00:00","title":"DAVID GRAY, Performing White Ladder in its entirety and greatest hits","url":"https://thegreekberkeley.com/events/david-gray-3","img":"https://thegreekberkeley.com/wp-content/uploads/2019/11/DavidGray_19_1024-1024x576.jpg","details":"DAVID GRAY\nWhite Ladder was one in a million. It was a game changer, a life changer, the people’s choice blockbuster that launched a thousand troubadours. It may be the greatest ever word-of-mouth success in the history of the music business.\nRecorded for no budget in a Stoke Newington bedroom in 1998 by a down on his luck singer-songwriter and self-released on a kitchen sink label, White Ladder slowly (very, very slowly) found an audience. It took a year to creep into the lower reaches of the British charts, then worked its way all the way up to number one. White Ladder eventually spent 3 years (from May 2000 to March 2003) in the UK top 100, spawning classic hit singles ‘Babylon’, ‘Please Forgive Me’ and ‘Sail Away’. It went on to sell over 7 million copies worldwide. It remains in the top 30 best-selling British albums of all time and the best-selling album ever in Ireland (a nation who know a good song when they hear it).\nCelebrating its 20th anniversary with an expanded edition, it is interesting to consider the extraordinary aftermath of White Ladder. Its success spawned a new wave of singer-songwriters in an acoustic boom that resonates to this day, a soul-baring lineage that can be directly traced from David Gray to the all-conquering Ed Sheeran. Indeed, Ed is a fan, whose passionate live version of ‘This Year’s Love’ can bring tears to the eye. Fellow world beating British superstar Adele is also an admirer, citing ‘This Year’s Love’ as one of her all-time favourite break-up songs.\nIn the wake of White Ladder, every major record company began signing and developing guitar wielding troubadours. David Gray was followed into the UK charts by Damien Rice, KT Tunstall, Katie Melua, James Blunt, James Morrison, James Bay, Paolo Nutini, and, ultimately, Ed Sheeran and a second wave of guitar boys including George Ezra, Tom Walker, Tom Grennan and Lewis Capaldi. In the US (where White Ladder sold 2 million copies), Jack Johnson, John Mayer and Jazon Mraz were amongst singer-songwriters whose careers received a significant commercial boost. White Ladder was a music industry game changer.\nAnd yet White Ladder remains apart from everything that followed. While the record company model involved putting young guitarist-singers into the studio with teams of established pop writers and producers, White Ladder was the work of a lone artist plumbing the depths of his soul.\n“I’ve been happy after the event to get back to writing the music that I felt was in me and following my creative path. I don’t think the records I’ve made since have been worse or better. I just think what happened with White Ladder involved more than music. It was a sort of heart and soul moment of total surrender for everybody involved, for me and the audience. That was it. It doesn’t get any better than that.”\nTwenty years on, White Ladder remains an album of great depth and startling beauty, a superlative collection of emotional songs capturing a very special moment in time, as raw and immediate as when it was recorded."},{"date":"2022-07-30T00:00:00.000+00:00","title":"SHARON VAN ETTEN ANGEL OLSEN JULIEN BAKER","url":"https://thegreekberkeley.com/events/wild-hearts-tour-220730","img":"https://thegreekberkeley.com/wp-content/uploads/2022/01/SharonVanEtten_1024.jpg","details":"THE WILD HEARTS TOUR\nThe Wild Hearts Tour: Sharon Van Etten, Angel Olsen, and Julien Baker with Special Guest Spencer.\nJoin Sharon, Angel, and Julien as they head across the country with their bands for three very special individual sets of music on The Wild Hearts Tour. Special guest Spencer. will be opening the evening. These summer time shows will be full nights of music and a true experience from beginning to end.\nSHARON VAN ETTEN\nSharon Van Etten’s Remind Me Tomorrow comes four years after Are We There, and reckons with the life that gets lived when you put off the small and inevitable maintenance in favor of something more present. Throughout Remind Me Tomorrow, Sharon Van Etten veers towards the driving, dark glimmer moods that have illuminated the edges of her music and pursues them full force. With curling low vocals and brave intimacy, Remind Me Tomorrow is an ambitious album that provokes our most sensitive impulses: reckless affections, spirited nurturing, and tender courage.\nSince her last album, Van Etten has had a young son, and family life is joyful. Preparing and finishing these songs, she found herself expressing deep doubts about the world around him, and a complicated need to present a bright future for him. “There is a tear welling up in the back of my eye as I’m singing these love songs,” she says, “I am trying to be positive. There is strength to them. It’s— I wouldn’t say it’s a mask, but it’s what the parents have to do to make their kid feel safe.”\nAlongside working on Remind Me Tomorrow, Van Etten has been exploring her talents (musical, emotional, otherwise) down other paths. She’s continuing to act, to write scores and soundtrack contributions, and she’s returning to school for psychology. The breadth of these passions, of new careers and projects and lifelong roles, have inflected Remind Me Tomorrow with a wise sense of a warped-time perspective. This is the tension that arches over the album, fusing a pained attentive realism and radiant lightness about new love.\nANGEL OLSEN\nJULIEN BAKER\n‘Little Oblivions’ is Julien Baker’s third album and follow-up to 2017’s ‘Turn Out The Lights’, both on Matador Records. The New York Times said the ‘Turn Out The Lights’ is “the work of a songwriter who has resonated with an international audience (…), the rare second album that, despite new self-consciousness, stretches beyond an unspoiled debut to reach for even bigger things, with all its passion intact”. The Sunday Times said “the mix of detached vocals, lush arrangements and laid-bare post-mortems on love, loss, dysfunction and acceptance is devastating.”\nIn 2018, Baker formed boygenius with Phoebe Bridgers and Lucy Dacus. The resulting eponymous EP and joint North American tour made for one of the most celebrated and talked about musical communions of that year, highlighting Baker at the forefront of a burgeoning generation of era-defining artists.\nBaker shot to worldwide attention in 2015 with show-stopping debut, Sprained Ankle. Recorded in only a few days, it was a bleak yet hopeful meditation on identity, addiction, faith, resilience and redemption. An intense and immersive performer, her live shows were described by The New Yorker as “…. hushed, reverential. The only sounds you hear between songs are her fingers as she tweaks the tuning on her electric guitar, scattered whispers between friends, and the rustling as the crowd waits patiently for Baker to start strumming again”.\nBaker has collaborated on studio recordings with Frightened Rabbit, Matt Berninger, Hayley Williams, Becca Mancari, Mary Lambert, and on stage with Justin Vernon, The National, Sharon Van Etten, Ben Gibbard, and others."},{"date":"2022-08-12T00:00:00.000+00:00","title":"REBELUTION, Steel Pulse DENM DJ Mackle","url":"https://thegreekberkeley.com/events/rebelution-220812","img":"https://thegreekberkeley.com/wp-content/uploads/2021/12/Rebelution_22_1024.png","details":"REBELUTION\nFounded in Isla Vista, CA, Rebelution has followed their instincts since the release of their breakout 2007 debut, Courage To Grow. In 2009, the band topped the Billboard Reggae Chart for the first of what would be five consecutive #1 records; and in 2017, they garnered a GRAMMY nomination for Best Reggae Album. Rebelution’s transcendent live performances, meanwhile, have earned the group sell-out headline shows everywhere from Red Rocks to The Greek Theatre, along with festival slots at Bonnaroo, Lollapalooza, ACL, Glastonbury, and more. Their latest album, In The Moment, is deliberate and wide-ranging, infusing the quartet’s soulful, exhilarating brand of modern reggae with addictive pop hooks, alt-rock grit, and hip-hop grooves. The performances here are bold and self-assured, and the production is equally ambitious, drawing on swirling reverb and trippy delay to create an immersive sonic universe that’s both futuristic and vintage.\nSTEEL PULSE\nBearing witness to the accelerating negativity of global affairs, UK reggae legends, Steel Pulse, emerge with musical vengeance to halt the disarray of humanity. The forthcoming album, Mass Manipulation, set for early 2019 release (Rootfire Cooperative / Wiseman Doctrine), reflects four decades of bettering mankind through music. The debut single “Stop You Coming And Come” features ancient melodies paired with catchy lyrics, transporting the mind to a period of time where secrets of an African dynasty are unmasked. As reggae revolutionaries, Steel Pulse is revered by the younger generation of artists and remains a powerhouse on stages around the globe. Through the example of Mass Manipulation, Steel Pulse demonstrates the endless possibilities that come from breaking down the walls of systemic greed, and nurturing the fellowship of mankind.\nDENM\nDJ MACKLE"},{"date":"2022-08-13T00:00:00.000+00:00","title":"NATHANIEL RATELIFF \u0026 THE NIGHT SWEATS, Bahamas","url":"https://thegreekberkeley.com/events/nathaniel-rateliff-220813","img":"https://thegreekberkeley.com/wp-content/uploads/2022/03/Nathaniel_Rateliff_The_Night_Sweats_1024.jpg","details":"NATHANIEL RATELIFF \u0026 THE NIGHT SWEATS\nIt took Nathaniel Rateliff \u0026 the Night Sweats less than five years to become one of the most recognizable new forces in contemporary rock ’n’ roll. Since 2015, Rateliff has led his denim-clad, horn-flanked Night Sweats, supplying the zeal of a whiskey-chugging Pentecostal preacher to songs about this world’s shared woes. They’ve had hits, sure, but their combustible mix of soul and rock quickly cemented them as the rare generational band who balanced ecstatic live shows with engrossing and rich records. To wit, is there any other modern act capable of revving up stadium crowds for The Rolling Stones while also appearing on Saturday Night Live and CMT Crossroads and at NPR’s Tiny Desk in short order?\nWhen Rateliff returned from his pandemic-truncated solo tour in March 2020, he struggled with the same question that vexed so many of us then—what now? Fortunately, he returned to his Colorado homestead and penned a set of songs that synthesized his introspection with his anthemic inclinations. The result is The Future, the third Night Sweats album but the first to capture this octet’s true depth and breadth. An instant classic of 11 songs, the album presents something more sustainable, interesting, and indeed open—a songwriter and band growing into bigger questions and sounds, into a future that allows them to remain recognizable but be so much more compelling than some denim-clad caricature.\nBAHAMAS"},{"date":"2022-08-14T00:00:00.000+00:00","title":"COHEED AND CAMBRIA, Dance Gavin Dance Mothica","url":"https://thegreekberkeley.com/events/coheed-and-cambria-220814","img":"https://thegreekberkeley.com/wp-content/uploads/2022/02/Coheed-And-Cambria-New-Pub-2022-Alexandra-Gavillet-1024x576.jpg","details":"COHEED AND CAMBRIA\nThe music world’s most intriguing storytellers, Coheed and Cambria, have shared their anthemic new single, “The Liars Club.” The follow up to the top 10 Active Rock single “Shoulders,” will be featured on their widely anticipated new album, Vaxis II: A Window of the Waking Mind [album art \u0026 track list below], and is available today on all streaming platforms. “The Liars Club” is joined by an official animated video which follows the opening chapter of the story in Vaxis II and is streaming on the band’s YouTube channel.\nExpanding on the “The Liars Club,” Coheed and Cambria vocalist / guitarist Claudio Sanchez remarked, “When the truth is such a mess, who doesn’t want to live out a different reality? Who doesn’t want to embrace a lie?”\nCoheed and Cambria have also announced details of a massive 2022 North American summer headline tour. Deemed the “A Window of The Waking Mind Tour,” it’s the band’s first major headline tour in five years. The upcoming trek will kick off on July 12th and see the band performing at some of the largest venues of their career in major cities across the continent including Boston, Philadelphia, Nashville, Denver, Queens, Toronto, Los Angeles and more. Featuring support from Dance Gavin Dance and Mothica, artist pre-sale tickets for the summer tour will be available beginning tomorrow February 23rd at 9:00AM local time with all remaining tickets going on sale to the public on Friday, February 25th at 10:00AM local time. Coheed and Cambria are currently out on “The Great Destroyer Tour,” a U.S. headline run with special guests Sheer Mag which is set continue through mid-March giving audiences an opportunity to see the band live in intimate clubs across the U.S. [full tour itinerary below]. For tickets and more information on Coheed and Cambria’s upcoming tour dates, visit www.coheedandcambria.com.\nVaxis II: A Window of the Waking Mind, Coheed And Cambrias’s ambitious thirteen track album is produced by the band’s own Claudio Sanchez and Zakk Cervini, and will be released worldwide on May 27th. Pre-orders for the album on DSPs and for the collection’s deeply immersive Vaxis II: A Window of the Waking Mind Limited Edition Deluxe Box Set are available now.\nVaxis II: A Window of the Waking Mind welcomes us back to “The Amory Wars” as the 2nd installment of the new five-part “Vaxis” arc about a couple on the run from tyrannical forces and their mysterious new addition. The album’s limited edition deluxe box set [packaging shot below] includes the exclusive 96-page illustrated hardcover novel “A Window of the Waking Mind” which was developed by Sanchez and written by his wife Chondra Echert with strikingly realistic color artwork by Chase Stone. The 9” x 12” box set also houses an exclusive Quintillan Speaker Containment Unit Lamp (approx. 8” diameter), a 3-panel fold out poster of expanded album cover art, and the A Window of the Waking Mind Black Card which will allow all card holders early access to tickets and early entry to Coheed and Cambria headline dates. All box sets will also come with a CD copy and download of Vaxis II: A Window of the Waking Mind along with an official Certificate of Authenticity. The box set sold 8,000 copies in its first week on sale. For more information on Vaxis II: A Window of the Waking Mind Limited Edition Deluxe Box Set, visit www.coheedandcambria.com.\nNamed one of REVOLVER’s “Most Anticipated Albums of 2022,” Vaxis II: A Window of the Waking Mind includes the recently released singles “Rise, Naianasha (Cut The Cord)” and “Shoulders,” the latter of which vaulted into the Top 10 at Active Rock Radio, marking the group’s career highest radio chart position to date. “(It) masterfully pairs heavy metal-infused riffs with sweeping, melodic vocals in a way that only Coheed can,” declared MTV who placed “Shoulders” in their 2021 Favorites round-up. “Coheed and Cambria are back, and they’re heavy as ever,” asserted Billboard, with Guitar World attesting “Coheed and Cambria have come out swinging.” Brooklyn Vegan observed, “It finds the band embracing their love of classic heavy metal riffage, before exploding into the kind of soaring chorus that Coheed have been churning out since day one… they sound pretty damn inspired.”\nFor the last 20 years, Coheed and Cambria have continuously broken the mold of what a rock band can be, forging their own path and building a universe around their music unlike any other. Whether it is in the way their genre-spanning approach to songwriting has allowed them to bridge worlds without being contained to one, or the multifaceted story arc of their albums and comic book series which mark the longest running concept story in music, Coheed and Cambria have consistently shaped new standards, never conformed. Comprised of Claudio Sanchez (Vocals / Guitar), Travis Stever (Guitar), Josh Eppard (Drums) and Zach Cooper (Bass) the band has gripped listeners and press around the globe with their visionary compositions and conceptual mastery. In 2018, Coheed and Cambria made a stunning debut with their album Vaxis I: The Unheavenly Creatures, which debuted at #1 on Billboard’s “Hard Rock Albums” chart, #6 current sales and Top 15 on the “Billboard 200” chart.\nDANCE GAVIN DANCE\nMOTHICA"},{"date":"2022-08-19T00:00:00.000+00:00","title":"THE HEAD AND THE HEART, Dawes","url":"https://thegreekberkeley.com/events/the-head-and-the-heart-220819","img":"https://thegreekberkeley.com/wp-content/uploads/2022/01/THATH_22_1024.png","details":"THE HEAD AND THE HEART\nInitially self-released in 2011, The Head And The Heart’s self-titled breakout debut produced instant classics including “Rivers and Roads,” “Down In The Valley” and “Lost In My Mind” (#1 at AAA) and is now Certified Gold. Their next two albums, 2013’s Let’s Be Still and 2016’s Signs of Light, settled into Billboard’s Top 10 albums chart, with Signs of Light securing the #1 position on Rock Album Charts.\n“Honeybee” became a fan favorite and breakout track from the band’s fourth full-length album, Living Mirage, released on Warner Records / Reprise Records to critical praise in 2019. The track has seen 100 million streams globally with weekly streams over 1 million in the U.S.\nThe band’s high energy live show has sold out six previous Red Rocks and established their status as a touring powerhouse, having landed prime time mainstage slots at Coachella, Lollapalooza and Austin City Limits.\nThey have appeared in Cameron Crowe’s Roadies, with music featured in countless other commercials, films and TV, among them Corona, Silver Linings Playbook and more. In total, the band has performed 15 times on national television including appearances on Ellen, The Tonight Show Starring Jimmy Fallon, The Late Show With Stephen Colbert, Austin City Limits with more to come in the coming months.\nDAWES"},{"date":"2022-08-20T00:00:00.000+00:00","title":"TEDESCHI TRUCKS BAND, Los Lobos Gabe Dixon","url":"https://thegreekberkeley.com/events/tedeschi-trucks-band-220820","img":"https://thegreekberkeley.com/wp-content/uploads/2022/02/TedeschiTrucksBand_1024.jpg","details":"TEDESCHI TRUCKS BAND\nTedeschi Trucks Band is a 12-piece powerhouse ensemble led by the husband/wife duo of guitarist Derek Trucks and singer/guitarist Susan Tedeschi, “two of the best roots rock musicians of their generation” (NPR). With their own potent original songwriting alongside an extensive canon of influences, the dynamic all-star band owns a reputation for world-class musical expression bolstered by each album and every performance.\nSince forming in 2010, TTB’s caravan has traveled countless miles to bring their music to audiences around the world. From sold-out multi-night residencies across America to barnstorming tours through Europe and Japan to the flagship Wheels of Soul annual summer amphitheater tour, the band’s shows are an eagerly anticipated highlight of the live music calendar and “nothing short of exhilarating” (Salon). Whether on stage or in the studio, when these supremely talented artists get together, it’s a musical experience of profound quality.\nThe band’s most recent release – Layla Revisited (Live At LOCKN’) featuring Trey Anastasio – is a 2CD/3LP live recording of their “epic” and “now-legendary” (Relix) performance of the classic Derek and the Dominos album and joins an impressive and growing discography that includes Signs (2019), High \u0026 Mighty EP (2019), Let Me Get By (2016), Made Up Mind (2013), and the Grammy-winning debut, Revelator (2011) in addition to their earlier live releases, the Grammy-nominated film/audio, Live From The Fox Oakland (2017), and 2012’s Everybody’s Talkin’.\nIn 2021, TTB convened in the studio to write and record a wealth of new songs for their next studio album. The result is an expansive, conceptual series of recordings that promise to be one of the most exciting projects in band history and is on track for release in 2022.\nTedeschi Trucks Band is also the subject of a newly-released documentary, Learning To Live Together: The Return of Mad Dogs \u0026 Englishmen, which Variety hails as “a serious blast of rock ‘n’ roll love…and a testament to how one gorgeously raucous rock ‘n’ roll moment can reverberate through the decades.” The film chronicles the historic Mad Dogs reunion concert spearheaded by Tedeschi and Trucks that took place at 2015’s LOCKN’ festival.\nTedeschi Trucks Band is Susan Tedeschi (guitar, vocals), Derek Trucks (guitar), Gabe Dixon (keyboards, vocals), Brandon Boone (bass), Tyler “Falcon” Greenwell (drums), Isaac Eady (drums), Mike Mattison (vocals), Mark Rivers (vocals), Alecia Chakour (vocals), Kebbi Williams (saxophone), Ephraim Owens (trumpet) and Elizabeth Lea (trombone).\nLOS LOBOS\nThe journey of Los Lobos began in 1973, when David Hidalgo (vocals, guitar, and pretty much anything with strings), Louie Perez (drums, vocals, guitar), Cesar Rosas (vocals, guitar), and Conrad Lozano (bass, vocals, guitarrón) earned their stripes playing revved-up versions of Mexican folk music in restaurants and at parties. The band evolved in the 1980s as it tapped into L.A.’s burgeoning punk and college rock scenes. They were soon sharing bills with bands like the Circle Jerks, Public Image Ltd. and the Blasters, whose saxophonist, Steve Berlin, would eventually leave the group to join Los Lobos in 1984.\nEarly on, Los Lobos enjoyed critical success, winning the Grammy® for Best Mexican-American Performance for “Anselma” from its 1983 EP …And a Time to Dance. A year later, the group released its full-length, major-label debut, How Will the Wolf Survive? Co-produced by Berlin and T Bone Burnett, the album was a college rock sensation that helped Los Lobos tie with Bruce Springsteen as Rolling Stone’s Artist of the Year.\nA major turning point came in 1987 with the release of the Ritchie Valens biopic, La Bamba. The quintet’s cover of Valens’ signature song topped the charts in the U.S. and the U.K. Rather than capitalize on that massive commercial success, Los Lobos instead chose to record La Pistola y El Corazón, a tribute to Tejano and Mariachi music that won the 1989 Grammy® for Best Mexican-American Performance.\nThat kind of sharp artistic turn has become Los Lobos’ trademark, serving to both fuel the band’s creativity and keep its fans engaged. In 1992, that willingness to defy expectations led them to record Kiko, an adventurous album produced by Mitchell Froom that’s considered by many to be one the band’s very best.\nSince then, Los Lobos has continued to deliver daring and diverse albums such as Colossal Head (1996), Good Morning Aztlán (2002), The Town and the City (2006), Tin Can Trust (2010) and Gates of Gold (2015). On top of that, the band’s live shows never disappoint, as documented on the recent concert recordings Live at the Fillmore (2005) and Disconnected in New York City (2013). Through the years, they’ve managed to keep things interesting with unexpected side trips like an album of Disney songs in 2009, along with countless contributions to tribute albums and film soundtracks. One of those – “Mariachi Suite” from the 1995 film Desperado ¬– earned the band a Grammy® for Best Pop Instrumental Performance.\nLos Lobos has sold millions of records, won prestigious awards and made fans around the world. But perhaps its most lasting impact will be how well its music embodies the idea of America as a cultural melting pot. In it, styles like son jarocho, norteño, Tejano, folk, country, doo-wop, soul, R\u0026B, rock ’n’ roll and punk all come together to create a new sound that’s greater than the sum of its parts.\nGABE DIXON\nBorn and raised in Tennessee, Gabe Dixon is a Nashville-based singer-songwriter and multi-instrumentalist. Since he first emerged in 1999, he has been penning honest and heartfelt tunes that continue to garner fans and crowds across the globe. Gabe’s songs have been covered by many; Garth Brooks, Parachute, Ben Rector, and Erin McCarley to name a few. Gabe’s music has also appeared in major films such as The Proposal and TV shows such as Nashville, Grey’s Anatomy, Vampire Diaries and Parks \u0026 Recreation. Along with his own appearances on Jimmy Kimmel Live! and The Late Late Show, Dixon has performed with notable acts like Paul McCartney, Alison Krauss \u0026 Union Station, Supertramp, Loggins \u0026 Messina, and O.A.R. In 2019, he became the full time Keyboardist with Tedeschi Trucks Band. Gabe’s most recent studio album “Lay It On Me” was released last summer and he has 3 live EP’s slated for 2022. The first being “Live at the Soiled Dove” out on March 4, 2022."},{"date":"2022-08-21T00:00:00.000+00:00","title":"ROBERT PLANT \u0026 ALISON KRAUSS, JD McPherson","url":"https://thegreekberkeley.com/events/robert-plant-amp-alison-krauss-220821","img":"https://thegreekberkeley.com/wp-content/uploads/tm_event/robert-plant-alison-krauss-1024x576.jpg","details":"ROBERT PLANT \u0026 ALISON KRAUSS\n“These are songs that have gone into our hearts way back in time, but got lost in the twists and curves of the passing years,” says Robert Plant. “You hear them and you go ‘Man, listen to that song, we got to sing that song!’ It’s a vacation, really—the perfect place to go that you least expected to find.”\nIn 2007, Plant and Alison Krauss released Raising Sand, one of the most acclaimed albums of the 21st Century. It was an unlikely, mesmerizing pairing of one of rock’s greatest frontmen with one of country music’s finest and most honored artists, produced by the legendary T Bone Burnett. It entered the Billboard 200 at Number Two and was certified platinum, and it won six Grammy awards, including both Album and Record of the Year.\nNow, after fourteen years, the two icons return with Raise the Roof, a dozen songs from a range of traditions and styles that extend this remarkable collaboration in new and thrilling directions.\nPlant and Krauss, though, were determined not to simply replicate a formula. “We wanted it to move,” says Krauss. “We brought other people in, other personalities within the band and coming back together again in the studio brought a new intimacy to the harmonies.”\nThe duo’s intention had always been to continue the momentum of Raising Sand. “There was so much enthusiasm, excitement and adrenaline that it would have been folly if we didn’t keep going,” says Plant. “We did join up and consider songs, try to work out some ideas, but then somebody would ask if I’d want to take my band to the Arctic Circle—‘OK, I’ll do that, call you back, Alison!’ And then she goes off and gets another Grammy. We’ve both constantly made new recordings.\n“I knew what we could share. In the length of time that I’ve been making records, this is very rewarding, but a very unusual place to find myself.”\nIn fact, the two singers were stockpiling ideas for songs they might do together, and passing selections back and forth, during the intervening years. “I’ve heard Lucinda Williams sing ‘Can’t Let Go’ forever, and I sent that to Robert at least ten years ago,” says Krauss. “I remember riding around listening to it and thinking it would be so much fun to do together.”\nPlant had his eyes on a couple of R\u0026B deep cuts. “The Betty Harris song ‘Trouble With My Lover’ was always in the air,” he says. “To hear Alison sing that is such a great way of her turning her gift around. And Bobby Moore’s ‘Searching for My Love’ is something I used to sing at school, another nugget of beautiful lost soul music which has been ricocheting between us for a long time.”\nWhen they were finally able to reconvene in Nashville in late 2019, Plant admits that it was “kind of daunting.” After all, when they first met up, there were no expectations; “When we started, Robert had said that if it didn’t work, we’ll try it for three days and say goodbye,” says Krauss. But this time, they not only had to clear the bar of their own magnificent careers, they also had the success of Raising Sand to contend with. Once they got rolling, though, Krauss says the recordings felt “very natural, very easy—and really fun.”\nFor his part, Plant wanted to introduce a musical tradition that was part of his own culture. “I’ve been a big follower of Bert Jansch’s work since I was a teenager,” he says, “and of that whole Irish, Scottish, English folk style that has a different lilt and different lyrical perspective. I was very keen to bring some of that into the picture.”\n“One of my favorite parts of this is the songs and songwriters that I had never heard of ” says Krauss, noting that in addition to the inclusion of Jansch’s “It Don’t Bother Me,” she feels the “peak of the record” comes with “Go Your Way” by English folk singer Anne Briggs. “Working with Robert, and with T Bone, is always a great education in musical history.”\nThe material on the album encompasses compositions by writers as diverse as Merle Haggard (“Going Where the Lonely Go”) and the mysterious blueswoman Geeshie Wiley (“Last Kind Words Blues”)—and even a Plant-Burnett original, “High and Lonesome”—in arrangements even more evocative, spare, and hypnotic than those on Raising Sand. In addition to the core band of ace musicians assembled by Burnett, including drummer Jay Bellerose and guitarist Marc Ribot on all tracks, there are appearances from such guests as David Hidalgo from Los Lobos, jazz wizard Bill Frisell, and the eternal Buddy Miller.\nBoth Plant and Krauss point to the recording of “Quattro (World Drifts In),” a song by the beloved Americana band Calexico, as a turning point in the Raise the Roof sessions. “When I heard the song for the first time, it came in the group of songs Robert sent me as possibilities he liked as ideas for us to record,” says Krauss. “I thought, ‘Oh gosh, here we go’—hearing that song was the moment I knew we’d make another album.”\nThe recording of Raise the Roof was completed just weeks before the world went into lockdown, after which the two singers were separated by an ocean for eighteen months (“I’ve never been in one place this long since I was at school,” says Plant). Now that they finally feel ready to put this music out into the world, they’re making plans for a tour that fans have been waiting to return for more than a dozen years.\n“It’s time to think about walking on the stage again and having that feeling of being just a little bit nervous,” says Plant. “And that’s really the thing that we both live for—that walk from the side of the stage to the microphone. That’s the longest journey, because it lasts a lifetime.”\nThe accomplishments of Robert Plant and Alison Krauss, of course, are immeasurable. But with Raise the Roof, they take the next step in a project that offers them creative rewards unlike anything else. “There’s so much romance in contrast,” says Krauss.\n“It’s such a far cry from everything I’ve done before,” says Plant. “I love the whole kaleidoscope of music that I’ve explored, but this is a place where you can think within the song, you can decide how to bring home an emotion. It’s another blend that we’ve got, and long may we have more of them.”\nJD MCPHERSON\nHailing from Broken Arrow, OK, JD McPherson has recorded four studio albums and toured extensively at venues worldwide, including festival sets at Glastonbury, Bonnaroo and Newport Folk Festival, among many others. Rolling Stone has described his music as “Timeless, forward-thinking rock \u0026 roll.” His 2017 LP, Undivided Heart \u0026 Soul, was released to widespread critical acclaim with NPR praising, “McPherson’s mastery of rock and soul fundamentals is beyond question, but his voice moves in wild ways on these songs, and the band exudes a new kind of risky energy.”\nMcPherson was born as the youngest child, growing up on the family’s cattle ranch near the town of Talihina. His father was a farmer, while his mother was a church minister. He took up the guitar at age 13.\n“Where I actually grew up was just completely removed from anything resembling a town or a city. It was an hour away from the nearest supermarket. What that granted me was a lot of isolation and when you are bored you tend to work really hard on your interests. So it probably would have been a different story if I grew up in a town somewhere.”\nHe studied visual arts in college, earning a Master of Fine Arts from the University of Tulsa, and later worked as an art and technology teacher. McPherson taught middle school art for four years before embarking on a music career.\nAfter deciding to pursue music more seriously, McPherson sent a demo to Jimmy Sutton of the small independent record label Hi-STYLE Records, which specialized in roots music. This was the start of a process that ultimately led to 2010’s Signs and Signifiers. After its wider release through Rounder Records, Rolling Stone gave Signs and Signifiers a 3½ star (out of 5) review in November 2012 and labeled McPherson an “Artist to Watch.”\nMcPherson’s sophomore LP, Let The Good Times Roll, was released on Rounder Records in 2015, showing McPherson with a wider musical range and an even stronger ability to weave the present with the past.\nIn 2018 McPherson released his breakthrough debut Christmas album, SOCKS, featuring 11 all-original Christmas songs, the album received overwhelming critical praise…\n“JD McPherson is a vivid reinterpreter of the strutting rock ’n’ roll of the 1950s. His holiday album, SOCKS, is a collection of original songs with startlingly original conceits.” –The New York Times\n“SOCKS overflows with vintage rock \u0026 roll tidings of comfort and joy…You could easily fool someone into thinking you discovered a gem of an album from 60 years ago.” –Rolling Stone\n“It’s not really much of a contest, in the end: McPherson’s album is so far ahead of the rest of the 2018 pack, everyone else is having to eat his Christmas dust.” —Variety\nJD is currently recording a covers project (four songs have already been released digitally – “Just Around The Corner” by Big Al Downing, “Lust For Life/Sixteen” by Iggy Pop. “Let’s Rock” by Art Neville and “Manta Ray” by The Pixies). This summer JD will be part of the Robert Plant and Alison Krauss touring band as well as opening the show with his own band, “I was eating a bowl of Count Chocula when I got the call to come do my best Grady Martin impression with this gang of legends. Honored to have been invited, more than I can express.”"},{"date":"2022-09-07T00:00:00.000+00:00","title":"LEON BRIDGES, Little Dragon","url":"https://thegreekberkeley.com/events/leon-bridges-220907","img":"https://thegreekberkeley.com/wp-content/uploads/2022/02/Leon-Bridges-1024.jpg","details":"LEON BRIDGES\nThe Boundless Tour: Leon Bridges with special guest Little Dragon\nLeon Bridges – Grammy Award Winning R\u0026B Artist, Songwriter, Dancer, Actor and Philanthropist.\nLeon’s Boundless Tour will see the Grammy Award winning R\u0026B artist and songwriter bring to the stage all elements of his career spanning experiences, inspirations, and award winning catalog of songs. From working as a dishwasher and busking on the streets of his beloved Fort Worth, TX to being signed to a major label and performing at the White House for Former President Barack Obama within a two-year span, Leon has continued to push the boundaries of his career.\nLeon is currently nominated for two Grammys for Best Traditional R\u0026B Performance and Best R\u0026B Album for his newest full length release Gold-Diggers Sound which the singer toured across the US to instantly sold out audiences, while also giving back to clubs, crew members, and venue staff via NIVA and CrewNation. Gold-Diggers Sound, serves as the follow up to his sophomore album, Good Thing, which saw him win the Grammy for Best Traditional R\u0026B Performance in 2019. Between album releases Leon has issued a steady stream of music including tracks with John Mayer, Lucky Daye, Kacey Musgraves, Jazmine Sullivan, and Diplo as well as Texas Sun, a collaborative project with fellow Texans Khruangbin with new EP Texas Moon out on February 18th. Leon’s musical growth has brought him around the world headlining festivals and selling out shows in the US, Canada, UK, Europe, Australia, Japan, Mexico and more including sold out shows at the Hollywood Bowl and back-to-back nights both at Radio City Music Hall and London’s O2 Brixton Academy. Other career highlights include his breakout track “River” being certified Platinum, portraying Gil Scott Heron in Damien Chazelle’s First Man, and being the face of Wrangler’s 2022 global campaign.\nLITTLE DRAGON\nSwedish four-piece Little Dragon – spearheaded by dynamic vocalist Yukimi Nagano, multi-instrumentalists Håkan Wirenstrand \u0026 Fredrik Wallin on keyboards \u0026 bass respectively, with drums \u0026 percussion by Erik Bodin – are one of the world’s most beloved bands. Earlier this year they released Lover Chanting EP, a 3 track EP self-produced by the band in Gothenburg and they are now due to release their brand new single ‘Tongue Kissing’ as well as embark on their headline European tour playing London’s Brixton O2 Academy (5000 cap) with stops in Paris, Amsterdam, Brussels, Stockholm and more followed by 22 dates across North America.\nWith five unique yet distinct studio albums ranging from their 2007 self-titled debut, the sophomore avant-garde electronic pop of Machine Dreams to must-have breakthrough Ritual Union, then GRAMMY-nominated Nabuma Rubberband followed by 2017’s critically acclaimed stunner Season High, Little Dragon have pioneered their own multi-genre space by writing timeless, impeccably produced songs \u0026 delivering knockout live shows.\nTheir catalogue bursts with an impressive list of collaborations. Yukimi has lent her trademark vocals to Gorillaz, Flume, SBTRKT, Kaytranada, Christian Rich, De La Soul, DJ Shadow, Tinashe, Mac Miller, Big Boi, Faith Evans, and ODESZA. The band has remixed Rhye, Childish Gambino \u0026 more. Additionally, artists such as NAO, Lianne La Havas, Nick Mulvey and Rosie Lowe all have covered Little Dragon. “Tried”, their recent collaboration with BADBADNOTGOOD received great support from the likes of Pitchfork, The FADER, NPR Annie Mac and more."},{"date":"2022-09-09T00:00:00.000+00:00","title":"JACKSON BROWNE","url":"https://thegreekberkeley.com/events/jackson-browne-220909","img":"https://thegreekberkeley.com/wp-content/uploads/2021/06/JacksonBrowne_21_1024.jpg","details":"JACKSON BROWNE\nJackson Browne has written and performed some of the most literate and moving songs in popular music and has defined a genre of songwriting charged with honesty, emotion and personal politics. He was inducted into the Rock and Roll Hall of Fame in 2004 and the Songwriter’s Hall of Fame in 2007.\nExcept for a brief period in NYC in the late 1960s, Jackson has always lived in Southern California. His debut album came out on David Geffen’s Asylum Records in 1972. Since then, he has released fourteen studio albums, four collections of live performances, two “best of” compilations, two DVDs and several single recordings. Jackson’s newest studio album, “Downhill From Everywhere” was released in July 2021 and GRAMMY nominated for Best Americana Album.\nBrowne is known for his advocacy on behalf of the environment, human rights, and arts education. He’s a co-founder of the groups Musicians United for Safe Energy (MUSE) and Nukefree.org and a member of the Ocean advocacy group, Ocean Elders.\nIn 2002, he was the fourth recipient of the John Steinbeck Award, given to artists whose works exemplify the environmental and social values that were essential to the great California-born author. He has received Duke University’s LEAF award for Lifetime Environmental Achievement in the Fine Arts, and both the Chapin-World Hunger Year and NARM Harry Chapin Humanitarian Awards. In 2004, Jackson was given an honorary Doctorate of Music by Occidental College in Los Angeles, for “a remarkable musical career that has successfully combined an intensely personal artistry with a broader vision of social justice.”"},{"date":"2022-09-11T00:00:00.000+00:00","title":"NINE INCH NAILS, Yves Tumor","url":"https://thegreekberkeley.com/events/nine-inch-nails-220911","img":"https://thegreekberkeley.com/wp-content/uploads/2022/02/Nine-Inch-Nails-1024.jpg","details":"NINE INCH NAILS\nYVES TUMOR\nYves Tumor? Try to unravel, and the dimensions and personas spill out like the cracked and warped contents of a grotesquely beautiful matryoshka doll. A gothic soundscape auteur? Details are scant, so the music does most of the talking…\nTo see Yves Tumor step upon a stage is to be thrashed by a howling cyberpunk fiend – yet filter the recorded output and be treated to a kaleidoscopic union of classic songwriting and lobotomized sound experiments. The duality unveils subtly but hints and images can be parsed from music and lyrics, giving that impression that on experience and listen it just might be possible that everything will come into a pop perfect focus."},{"date":"2022-09-13T00:00:00.000+00:00","title":"LANY, Surfaces","url":"https://thegreekberkeley.com/events/lany-220913","img":"https://thegreekberkeley.com/wp-content/uploads/2022/04/LANY_1024.jpg","details":"LANY\nWhen any great band reaches a new point of greatness in their career, they reflect upon the journey that’s led them to that moment. American alt-pop trio LANY started in 2015, when Paul Klein, Jake Goss and Les Priest escaped their humble upbringings for LA, creating a band from the remnants of their own musical projects. Together, they crafted lyrically meticulous anthems with big, pristine soundscapes behind them; songs about love, heartbreak and living that felt world-spanning.\nSigning to Polydor in 2015, their self-titled debut album arrived two years later, causing an international fanbase that had been brewing for a few years to burst to the fore. Paul was the enigmatic frontman Generation Z desired. Its 2018 follow-up Malibu Nights was marred by heartbreak and spawned singles “Thru These Tears” and “I Don’t Wanna Love You Anymore”, cracking the Billboard Album Chart. At present, the band has over 2.5 million followers on Spotify alone.\nWhilst the majority of the band’s first two records were written in LA, their third was originally born in Nashville. It’s called Mama’s Boy. “I felt like I needed to go to Nashville to work with those writers,” Paul says of his decision to start Mama’s Boy somewhere other than another LA music studio; guitars, for the first time, leading the way. “There’s just a certain type of song that they make there.” Writing sessions took place with Dan Smyers from the duo Dan + Shay, Shane McAnally, known best for his Grammy-winning songwriting cuts on Kacey Musgraves’ Golden Hour, and songwriting power couple Sasha Sloan and King Henry.\nIt was here that Mama’s Boy’s first single, the powerful but wistful “good guys” came to be. The distance from his new home helped Paul write about, what he calls, “the quintessential experience” of his recent relationships. Cut off from the temptations of the city and closer to his family, allowed him to delve into a part of himself most might fear to tread, like in “if this is the last time” and “i still talk to jesus”. Within that Nashville fortnight, five of the 14 tracks of what would become their third record came to be. Back in Los Angeles, enriched by the spirit of that place, work continued.\nMama’s Boy is a sweeping tribute to home, heritage and Americana. It’s both wise and knowingly naive; written, Paul says, to highlight what’s “symbolic of being an American kid” today. “I wanted to walk the fine line of pop, cowboy and Americana,” Paul says. “Taking the American sides of brands like Ralph Lauren, and mixing with the European, rock n roll chic of Saint Laurent.”\nThe arrival of Mama’s Boy spells the beginning of a new chapter in the life of LANY. One that’s always been inside of them, keen to be set free. How they got there, though, rested on looking back to the past. “There was only one person in the world I cared about hearing Malibu Nights,” Paul Jason Klein says. “Now, there’s not one person in the world I don’t want to hear Mama’s Boy.” That pouring of everything they have into 14 tracks about where they’re from and what they’re about, glows like a sunset over a southern sky. Finally, LANY are home.\nSURFACES\nSurfaces is a Texas-based duo comprised of Forrest Frank and Colin Padalecki. Formingin 2017, with Forrest manning vocals and production, and Colin handling writing and arrangements, they released their debut album later that year titledSurf.Quickly capturing the attention of fans, they followed in 2019 with the release of Where the Light Is, catapulting them into stardom with breakout smash “Sunday Best.”The RIAA double-platinum certified track went on to surpass 2.5 billion streams, break into the Top 20 on Billboard’s Hot 100, reach #9 at Pop Radio and led to performances onThe Tonight Show with Jimmy Fallon, Late Night with Seth Meyers, The Late Late Show with James Corden, andThe TODAY Show.They continued their momentum with the release of Horizons, in early 2020, featuring “Take It Easy,” followed by their collaboration with the legendary Elton John on “Learn To Fly” and, most recently, the release of their 2021 album, Pacifico, featuring stand out singles “Wave of You” and “Come With Me” featuring Salem Ilese. Now, Forrest and Colin focus on the next chapter of their musical career. Redefining their sound and perfecting their craft, the two isolated themselves in a house in Joshua Tree to experiment with new sounds and record. Inspired heavily by the likes of Tame Impala and Tom Misch, Surfaces pushed themselves to venture outside of their norm and craft some of their most innovative work to date. Kicking things off with “I Can’t Help But Feel,” the duo continue to carve their path and hint at more to come."},{"date":"2022-09-15T00:00:00.000+00:00","title":"LAUV, with special guest Hayley Kiyoko","url":"https://thegreekberkeley.com/events/lauv-220915","img":"https://thegreekberkeley.com/wp-content/uploads/2022/03/LAUV-All-4-Nothing-Im-So-In-Love_Resized-for-Web.jpg","details":"LAUV\nFor as much as he’s known for intriguing and inventive soundscapes, multi-Platinum chart-topping singer, songwriter, producer, and multi-instrumentalist Lauv asserts himself as a storyteller, first and foremost. His stories continue to enchant audiences everywhere by converting the magic around him into generational anthems. After introducing himself with viral sensation “The Other,” he landed a global smash in the form of “I Like Me Better.” It tallied over 2 billion streams, reached the Top 10 on Top 40 and Top 5 on Hot AC radio, went sextuple-Platinum in the US and platinum in twelve other countries. He served up the Gold-selling 2018 playlist I Met You When I Was 18 and a procession of hits, including the Platinum “I’m So Tired” with Troye Sivan as well as Gold-certified singles “There’s No Way” [feat. Julia Michaels] and “Fuck, I’m Lonely” [feat. Anne-Marie]. In 2020, his Gold-certified full-length debut album,  ~how i’m feeling~, bowed in the Top 20 of the Billboard Top 200 buoyed by “Who” [feat. BTS], “El Tejano” [feat. Sofia Reyes], “Canada” [feat. Alessia Cara], and “Mean It” with LANY. NME hailed it as “a powerful, beautiful debut,” while FADER coined it “replay-able pop.” Additionally, Teen Vogue called the record “21 tracks of emotionally-cathartic pop bangers that unpack everything from modern-day romance to love song fatigue.” In between selling out headline tours and supporting Ed Sheeran in stadiums, he performed on The Tonight Show Starring Jimmy Fallon, Jimmy Kimmel LIVE!, The Late Late Show with James Corden, and more. Lauv is kicking off 2022 with an entirely new chapter of music that celebrates the innocence of youth, untangles the complexities of adulthood and once again pushes the boundaries of pop. Now, he tells his most personal story yet on his second full-length album, All 4 Nothing.\nHAYLEY KIYOKO\nHayley Kiyoko has become one of the most celebrated pop artists since releasing 2018’s landmark debut album EXPECTATIONS, which — according to Rolling Stone — placed her “at the forefront of an unapologetically queer pop movement.” In #20GAYTEEN, Kiyoko was nominated for two VMAs, where she performed “Curious” and won Push Artist Of The Year. Since her 2015 debut, Hayley has amassed over 890 million global streams and over 2.2 million YouTube subscribers, accrued over 766 million lifetime YouTube views, and sold out numerous venues across the country and abroad on her previous headline tours. Lauded as one of “The 21st Century’s Most Influential Women Musicians” by NPR, among other milestones, Hayley continues to impact and inspire her community. Through her honest storytelling and lyricism, she encourages hope as her resounding message, as showcased on her collection of songs, I’M TOO SENSITIVE FOR THIS SHIT, which arrived in early 2020. Last year, Hayley launched her gender-inclusive fragrance HUE (available to order at huebyhayley.com) as well as ushered in a new era with her powerful anthem of self-reliance, “Found My Friends,” and the romantically hopeful single “Chance.” Both songs are available now alongside self-directed music videos shot on 16mm film."},{"date":"2022-09-16T00:00:00.000+00:00","title":"DERMOT KENNEDY, Alexander 23","url":"https://thegreekberkeley.com/events/dermot-kennedy-220916","img":"https://thegreekberkeley.com/wp-content/uploads/2022/05/Dermot-Kennedy-1024.jpg","details":"DERMOT KENNEDY\nDermot Kennedy has the best-selling debut album in his native Ireland of this millennium. Without Fear, Dermot’s impassioned debut, has sold over 1.5 million copies worldwide, making him a platinum-selling artist in over 12 countries. Notably, both of his singles, “Outnumbered” and the Meduza collaboration “Paradise,” were certified Gold in 2021, with “Paradise” streaming over 500 million times, while “Power Over Me” was also recently certified Gold.\nALEXANDER 23\nChicago native Alexander Glantz is the sole creative force behind Alexander 23: he writes, records and produces all of his music in a self-built studio in Los Angeles. In March 2019, he made his debut with “Dirty AF1s,” which climbed to #31 on Apple’s Pop chart. Later in the fall, he shared his debut, critically-acclaimed EP I’m Sorry I Love You and spent the rest of 2019 on tour with Alec Benjamin, Omar Apollo, and mxmtoon while making his Lollapalooza debut. He kicked off 2020 by selling out two headline shows at The Moroccan Lounge, and joined Chelsea Cutler on her US tour. Additionally, Alexander continued to release new music, including teaming up with Selena Gomez to remix her hit song, “Rare,” and sharing his latest hit track “IDK You Yet,” which made its way to Spotify’s Today’s Top Hits and #14 on Apple Pop Chart. “IDK You Yet” has been streamed over 190 million times on Spotify alone. Alexander 23 continues to work on his debut album and plans to tour the world in 2021."},{"date":"2022-09-17T00:00:00.000+00:00","title":"MAREN MORRIS, The Lone Bellow","url":"https://thegreekberkeley.com/events/maren-morris-220917","img":"https://thegreekberkeley.com/wp-content/uploads/2022/03/MarenMorris_1024.jpg","details":"MAREN MORRIS\n“Can I get a hallelujah, can I get an amen?” sings Texas-born, Nashville-dwelling Maren Morris on “My Church,” the lead single from her self-titled LP. Though “sing,” however, might not be the most appropriate verbiage – she belts, more like it, in her dynamic range that can growl soulfully one moment and twangily howl the next. It’s an honest performance from an artist and writer who stands out for the singular point of view, sheer creativity and fearless approach to music she’s developed since she began performing and writing as a young child. Using the boldest colors from across many genres as her palate and country as her canvas, Morris’ stories are vivid paintings that can be gleefully fun, tearfully heartbreaking and a perfect balance of modern and timeless.\nAt barely twenty, she moved to Nashville, leaving behind a resume that boasted three hits on the Texas Music Chart: and while many arrive in town with a dream of their name in lights, resting on the marquees of the biggest and brightest venues, Morris simply wanted to work on her songwriting craft. And it’s not that she didn’t have aspirations as a performer – Morris had actually already logged years doing just that. But being a celebrity wasn’t the goal – spending her days and nights in the writing room, working with as many cowriters as possible and composing hundreds of songs, was. And though she’d only play the occasional local gig at first, she still managed to build an audience based on her sheer talent, honest lyrics and a completely magnetic presence. Small shows led to big opening gigs: for Little Big Town, Sam Hunt, Loretta Lynn and Chris Stapleton.\nTHE LONE BELLOW"},{"date":"2022-09-18T00:00:00.000+00:00","title":"BONNIE RAITT, Mavis Staples","url":"https://thegreekberkeley.com/events/bonnie-raitt-220918","img":"https://thegreekberkeley.com/wp-content/uploads/2022/02/Bonnie-Raitt-1024.jpg","details":"BONNIE RAITT\nBonnie Raitt is a singer, songwriter and guitarist whose unique style blends blues, R\u0026B, rock, and pop. After 20 years as a cult favorite, she broke through to the top in the early 90s with her GRAMMY-award winning albums, ‘Nick of Time’ and ‘Luck of the Draw,’ which featured hits, “Something To Talk About” and “I Can’t Make You Love Me” among others. The ten-time Grammy winner was inducted into the Rock \u0026 Roll Hall of Fame in 2000 and Rolling Stone named the slide guitar ace one of the “100 Greatest Guitarists of All Time” and one of the “100 Greatest Singers of All Time.”\nRaitt’s widely-acclaimed 2012 independent release ‘Slipstream’ sold over a quarter-million copies, making it one of the top selling independent albums, and earned Raitt her 10th Grammy Award (Best Americana Album). In February 2016, Raitt released her highly-anticipated 20th album, ‘Dig In Deep’ (Redwing Records.) On tour for much of 2017-2019, Raitt and her band performed overseas in Australia, New Zealand as well as Canada before spending the summers touring as support for James Taylor in stadiums and arenas across the U.S., United Kingdom and Europe.\nAs known for her lifelong commitment to social activism as she is for her music, Raitt has long been involved with the environmental movement, performing concerts around oil, nuclear power, mining, water and forest protection since the mid 70’s.  She was a founding member of MUSE (Musicians United for Safe Energy) which produced the historic concerts, album and movie NO NUKES and continues to work on safe energy issues in addition to environmental protection, social justice and human rights, as well as creator’s rights and music education.\nMAVIS STAPLES\nHailed by NPR as “one of America’s defining voices of freedom and peace,” Staples is the kind of once-in-a-generation artist whose impact on music and culture would be difficult to overstate. She’s both a Blues and a Rock and Roll Hall of Famer; a civil rights icon; a GRAMMY Award-winner; a chart-topping soul/gospel/R\u0026B pioneer; a National Arts Awards Lifetime Achievement recipient; and a Kennedy Center honoree. She marched with Dr. Martin Luther King, Jr., performed at John F. Kennedy’s inauguration, and sang in Barack Obama’s White House. She’s collaborated with everyone from Prince and Bob Dylan to Arcade Fire and Hozier, blown away countless festivalgoers from Newport Folk and Glastonbury to Lollapalooza and Bonnaroo, performed with The Band at The Last Waltz, and graced the airwaves on Fallon, Colbert, Ellen, Austin City Limits, Jools Holland, the GRAMMYs, and more. At a time when most artists begin to wind down, Staples ramped things up, releasing a trio of critically acclaimed albums in her 70’s with Wilco’s Jeff Tweedy that prompted Pitchfork to rave that “her voice has only gained texture and power over the years” and People to proclaim that she “provides the comfort of a higher power.”"},{"date":"2022-09-28T00:00:00.000+00:00","title":"JACK JOHNSON, Ron Artis II Thunderstorm Artis","url":"https://thegreekberkeley.com/events/jack-johnson-220928","img":"https://thegreekberkeley.com/wp-content/uploads/2021/12/jackjohnson_22_1024.png","details":"JACK JOHNSON\nJack Johnson has released seven studio albums and two live albums that have sold over 25 million copies worldwide since 2001. His Brushfire Records label and touring crew have been leaders in the greening of the music industry and his All At Once social action network connects fans with local non-profits at each tour stop. Jack, with his wife Kim, founded the Kokua Hawaii Foundation to support environmental education in Hawaii’s schools and communities, as well as the Johnson Ohana Foundation to support environmental, art and music education worldwide. Proceeds from these albums and tour profits, along with Johnson’s personal charitable activities, have resulted in over $37 million donated to charity since 2001.\nRON ARTIS II\nRon Artis II is a multi-instrumentalist who grew up in Hawaii among an exceptionally musical family. The second oldest of 10 other siblings, Ron was surrounded by artists and musicians daily. In fact, growing up, Ron thought it was weird that everybody else didn’t have ten siblings running around with them every day. They even had an “Artis Family Band” and when they weren’t off painting, at the beach, they were learning their instruments.\nFull band, trio or solo, Ron has performed and collaborated with Mick Fleetwood (Fleetwood Mac), Jack Johnson, Jake Shimabukuro, Booker T Jones, Eric Krasno (Soulive, Lettuce) and G Love among others. If this wasn’t a rich line – up of names, go spend a few moments reading the lyrics to Ron’s songs.\nEachsongislacedwithintention,deepconviction,story,andaheartthathastrulybeenthere. It makes sense why Ron is oen heard talking [and singing] about “walking the walk.” “I really try to write music that can be helpful not only for our generation, but for life in general.”\nRon has been married to his beautiful wife Julia for 9 years and counting. They have 4 lovely [and musically inclined] daughters, with a fih on the way! If you’ve been to one of Ron’s shows, then you may have had the immense pleasure of seeing a daughter or two take to the stage with her father. In fact, being on the road is a family affair. Ron comments, “It’s so easy to lose touch with life and lose touch with the things that inspired you originally to write music and do things. I can walk off stage at a festival with tons of people having a great time, and then I go backstage and change my daughter’s diaper! It keeps life really in perspective of what’s important — I really enjoy this … They really keep me grounded and keep my heart full.”\nWith 4 studio albums, 60+ songs, 1000s of flights, 100,000s diapers, and 15 countries, Ron and his family [full band included] continue to live by preparation and faith. Holding each day and person they meet as with immense privilege, not to be taken for granted, they look forward to meeting and delighting audiences around the world.\nTHUNDERSTORM ARTIS"},{"date":"2022-09-29T00:00:00.000+00:00","title":"JACK JOHNSON, Ron Artis II Thunderstorm Artis","url":"https://thegreekberkeley.com/events/jack-johnson-220929","img":"https://thegreekberkeley.com/wp-content/uploads/2021/11/jack-johnson-press-photo-1.jpg","details":"JACK JOHNSON\nJack Johnson has released seven studio albums and two live albums that have sold over 25 million copies worldwide since 2001. His Brushfire Records label and touring crew have been leaders in the greening of the music industry and his All At Once social action network connects fans with local non-profits at each tour stop. Jack, with his wife Kim, founded the Kokua Hawaii Foundation to support environmental education in Hawaii’s schools and communities, as well as the Johnson Ohana Foundation to support environmental, art and music education worldwide. Proceeds from these albums and tour profits, along with Johnson’s personal charitable activities, have resulted in over $37 million donated to charity since 2001.\nRON ARTIS II\nRon Artis II is a multi-instrumentalist who grew up in Hawaii among an exceptionally musical family. The second oldest of 10 other siblings, Ron was surrounded by artists and musicians daily. In fact, growing up, Ron thought it was weird that everybody else didn’t have ten siblings running around with them every day. They even had an “Artis Family Band” and when they weren’t off painting, at the beach, they were learning their instruments.\nFull band, trio or solo, Ron has performed and collaborated with Mick Fleetwood (Fleetwood Mac), Jack Johnson, Jake Shimabukuro, Booker T Jones, Eric Krasno (Soulive, Lettuce) and G Love among others. If this wasn’t a rich line – up of names, go spend a few moments reading the lyrics to Ron’s songs.\nEachsongislacedwithintention,deepconviction,story,andaheartthathastrulybeenthere. It makes sense why Ron is oen heard talking [and singing] about “walking the walk.” “I really try to write music that can be helpful not only for our generation, but for life in general.”\nRon has been married to his beautiful wife Julia for 9 years and counting. They have 4 lovely [and musically inclined] daughters, with a fih on the way! If you’ve been to one of Ron’s shows, then you may have had the immense pleasure of seeing a daughter or two take to the stage with her father. In fact, being on the road is a family affair. Ron comments, “It’s so easy to lose touch with life and lose touch with the things that inspired you originally to write music and do things. I can walk off stage at a festival with tons of people having a great time, and then I go backstage and change my daughter’s diaper! It keeps life really in perspective of what’s important — I really enjoy this … They really keep me grounded and keep my heart full.”\nWith 4 studio albums, 60+ songs, 1000s of flights, 100,000s diapers, and 15 countries, Ron and his family [full band included] continue to live by preparation and faith. Holding each day and person they meet as with immense privilege, not to be taken for granted, they look forward to meeting and delighting audiences around the world.\nTHUNDERSTORM ARTIS"},{"date":"2022-10-01T00:00:00.000+00:00","title":"BOMBA ESTÉREO","url":"https://thegreekberkeley.com/events/bomba-estereo-221001","img":"https://thegreekberkeley.com/wp-content/uploads/2022/05/Bomba-Estero-1024-1.jpg","details":"BOMBA ESTÉREO\nBomba Estéreo was founded in Colombia in 2006 by musician Simón Mejía and singer Li Saumet. Together, they created a unique project that would become one of the most attractive music groups in the world. Throughout its career, Bomba Estéreo has toured all over the world, playing the stages of some of the most important music festivals, clubs and venues, and attracting millions of people to its eclectic avant-garde fusion of electronic and Caribbean sounds.\nBomba Estéreo has been nominated to The GRAMMYs three times with their albums ‘Amanecer’ and ‘Ayo’ and this year with “Deja”, and has also been nominated to six Latin GRAMMYs, where in 2015 the band performed ‘Fiesta’ at the ceremony’s main show with Hollywood star Will Smith. In 2017, Bomba Estéreo was invited to tour as support for Arcade Fire’s Everything Now World Tour doing 13 shows together across Europe, USA and Latin America. In 2018, Bomba Estéreo reached the worldwide Top 500 most listened on Spotify.\nOn 2021 the band has released their latest album “Deja”. The album inspired by nature was presented in four moments, represented by the elements “Agua” (Water), “Aire” (Air), “Tierra” (Earth), “Fuego”(Fire) and has been nominated as Best Latin Rock or Alternative Album at the 2022 Grammy Awards."},{"date":"2022-10-02T00:00:00.000+00:00","title":"KING GIZZARD AND THE LIZARD WIZARD, Leah Senior","url":"https://thegreekberkeley.com/events/king-gizzard-and-the-lizard-wizard","img":"https://thegreekberkeley.com/wp-content/uploads/2019/11/kinggizz_22_1024.png","details":"KING GIZZARD AND THE LIZARD WIZARD\nThe stats on King Gizzard’s colourful career are stacking up fast: 15 albums in 7 years (including five in 2017 alone), 10 of them charting in the Top 20 in Australia, where they are now arguably the country’s most innovative, important and productive rock band. International critical acclaim. Headline festival appearances. And perhaps most importantly, a fervent worldwide fanbase who share endless memes, mixes, videos, graphics, theories and discussions, all through which they explore and expand what they have termed ‘The Gizzverse’.\nLEAH SENIOR\nLeah Senior silences audiences with her soaring vocals and unique lyricism. Her music draws from various sources but is often classified as folk revival. The Melbourne-based artist creates fragile but effortlessly nimble melodies that call from another time and place. Her songs evoke the peculiar, poetic and the plain.\nA chance late night encounter with King Gizzard and The Lizard Wizard saw Leah Senior joining their independent label Flightless to release her first two albums.\nSenior’s distinctive voice also featured on King Gizzard’s apocalyptic album Murder of The Universe, as the omnipresent female narrator.\nLeah Senior is an amazing folk singer, very, very talented, and nothing like King Gizz’s music at all. her songs equally terrifying, joyous, sad and exciting. We get chills watching her perform.\n-King Gizzard and The Lizard Wizard.\nLeah Senior will be releasing her home spun third album “The Passing Scene” in March 2020.\nLeah Senior’s second album Pretty Faces was recorded and produced with Gizzard’s own Joey Walker and features Michael Cavanagh on drums.\nEnchanting..Recalling Joni Mitchell playfulness through cosy folk, minimalism\n-Rolling Stone Australia.\nSenior’s captivating live performances have seen her supporting artists including Jeff Tweedy, Calexico, Jessica Pratt, Julianna Barwick and Bedouine. When performing, Senior is often joined by her sister Andi and guitarist/pianist Jesse Williams creating a tapestry of ethereal harmonies and 60’s jangle.\nEarly 2019 saw Senior embark on her first European tour in support of her most recent single Graves."},{"date":"2022-10-20T00:00:00.000+00:00","title":"BONOBO, Tourist","url":"https://thegreekberkeley.com/events/bonobo-221020","img":"https://thegreekberkeley.com/wp-content/uploads/2022/05/Bonobo-1024.jpg","details":"BONOBO\nFragments is the most emotionally intense record that Bonobo – aka Simon Green – has ever had to make. It’s no surprise that it’s also his masterpiece. The album features Jamila Woods, Joji, Kadhja Bonet, Jordan Rakei, O’Flynn and Miguel Atwood-Ferguson. Born first out of fragments of ideas and experimentation, the album ultimately was fused together in a burst of creativity fueled by both collaboration and Green’s escape into the wild.\nFull of tension and release on both an intimate and an elemental scale, Fragments is truly a record for our times. But there were times when it felt it would never happen.  Where previously Green had always written on the move, this time he had to fight to get it out, in isolation, as the world changed around him.  He started to pull back into himself – and for the first time, crucially, he wasn’t writing new music as he travelled. He was also wrestling with feelings he found hard to express. But slowly, he found inspiration as he sought refuge in the great expanses of wild nature outside his adopted home of Los Angeles.  “Finding the places that were alien and unique and awe inspiring,” he says, even if that meant escaping on a solo voyage to Death Valley on what would turn out to be the hottest day in its history.  His dive into modular synthesis, and collaboration with a wide array of artists brought the album into much sharper focus, notably Jamila Woods’ contribution to “Tides,” which quickly became the album’s centerpiece.\nSo Fragments is the sound of both struggle and isolation – personally and collectively – and of a surging, joyous return: a gorgeous reminder of how out of struggle and disillusionment, creativity and hope can emerge at the most unexpected moments.\nOne of the biggest names in dance music, Green’s career includes 3 Grammy nominations and playing to 2 million people for the tour supporting his 2017 album Migration. Migration also reached #1 on Billboard’s Dance album chart and hit Top Ten positions in several countries. He is also a favorite mainstage performer at the world’s greatest music festivals and has worked with Erykah Badu, Ólafur Arnalds and Jon Hopkins, and remixed artists including Michael Kiwanuka, Gorillaz, George Fitzgerald and London Grammar.\nTOURIST\nA person who is always traveling or visiting a place for pleasure. That’s how William Phillips’ name defines his adventures as a musician. “It allows me to write whatever I want. My writing takes me to lots of places: electronica, garage, piano. I want to write anything, and the name Tourist lets me do that.”\nGrowing up with three sisters meant the young producer had to find his own entertainment as a child. He found his kicks in music, and more specifically the piano. “Those were my earliest musical memories” begins William, who is still in his early twenties, “I played the piano for a long time. I tried to have lessons, but I couldn’t stand the thought of some old fart talking me through D major scale”.\nThe internet arrived, home computers became MS-DOS beacons of endless opportunity and William started experimenting with music software. The combination of a fascination for piano and an affinity for technology soon saw him discover dance music, and with it came Pete Tong’s Radio 1 show, Ministry of Sound’s ‘The Annual’ compilations, and the acquisition of a midi keyboard. “I was an 11 year old listening to dance music. I couldn’t go and experience it, but I loved it through a child’s eyes. As a result, I still have a naive view of the communal culture of dance music. Even now, I see it as something I listen to in my bedroom.”\nThis inverted relationship with dance was evident on the early Tourist EPs. They championed an introspective and solitary brand of electronic music, full of melodic emotion and affected vocals. Placid Acid EP oozed glittering electronica; Tonight EP combined woozy r\u0026b with shadowy 2-step, but both had one thing in common: they had next to no intentions for the dance floor. There was no pounding kick drum, no build and drop, build and drop. “That’s the thing” explains William, “I write dance music for people who don’t dance. I love kick drums, I love snares, I love synthesisers, but I’m not very good at writing big bangers.” This very personal sound didn’t stop Tourist from permeating a wider audience, and tracks like ‘Placid Acid’ racked up almost half million listens across Soundcloud and Youtube.\nFast forward to his most recent release – Patterns EP – and there are some exciting changes in the Tourist sound. The dance floor is now in the cross hairs, and a few of the tracks are destined to detonate square upon it. “In the last year I’ve played a lot of live shows. I’ve been to a lot of clubs. I’ve played boiler room. This isn’t straight up underground house music, but it’s certainly made me more direct. It’s one of the most honest EPs I’ve written and I’m proud of it.” ‘Together’ – an emotive deep house track with pitch-shifted vocals and whispers of electro – pays testament to this approach. But that isn’t the only change. Within Tourist there has always lurked the potential for a massive pop track, and in choosing to work with vocalists on this EP, he’s birthed two potential hits. Lead track ‘Patterns’ opens with hints of italo and disco, as Lianne La Havas croons gently, before the current changes; with it comes clapping percussion and gospel backing vocals that eventually snowball into a huge, uplifting crescendo. Similarly, ‘I Can’t Keep Up’ is a stripped back club-pop track, with soaring vocals from Will Heard. “I view the process of choosing vocalists the same as I would a synth. I choose their voices not their names. It’s cheap to attach yourself to someone successful. That said, Lianne is very successful!”\nDeep house and club-pop aside, behind this polished and digitally produced sound, still lurks a true musical soul, that boy who played the piano. Throughout past EPs, William has had a keen interest in organic field recordings, and everyday sounds from his house are manipulated into rhythmic elements to provide the drums for ‘I Can’t Keep Up’. And his musical contributions often stretch further than Tourist with long time writing partner Jimmy Napes. Napes wrote UK top 20 hit ‘Latch’ for Disclosure and Sam Smith, and Tourist worked with him in writing another track for Smith’s forthcoming album.\nThe artwork for Patterns EP may be the least important thing to most avid listeners, but for Williams visuals play an important role. The image of bedsheets plays on a concept, “there are a lot of stories in bedsheets. You see patterns in bedsheets and it reveals a lot about the person.” This fascination with visual stimulation doesn’t stop there, and he intends for the live experience to be a feast for the eyes. “When you can spend a few quid on a show, you can start to make some really enamoring art. My live show is not about me. Visuals are as important as the sonics. We see as well as hear. The things we look at as we hear it, changes how we hear it. It’s so important to respect visuals and artwork and videos. I want to create a world for people.”"},{"date":"2022-10-28T00:00:00.000+00:00","title":"THE CHAINSMOKERS, Two Friends Ship Wrek","url":"https://thegreekberkeley.com/events/the-chainsmokers-221028","img":"https://thegreekberkeley.com/wp-content/uploads/2022/05/20210812_The_Chainsmokers_Comp_Duo_BW.jpeg","details":"THE CHAINSMOKERS\nGrammy® Award-winning and Billboard Chart topping artist/producer duo, The Chainsmokers, have evolved into a dominating musical force with a diverse repertoire of songs that have led them to become one of music’s hottest recording artists. Comprised of Alex Pall and Drew Taggart, their signature sound deftly reaches across indie, progressive and pop realms and has seen them develop some of the biggest breakthrough songs over the course of the last few years. In 2016, the group catapulted to worldwide stardom with 3 Multi-Platinum certified hits – “Roses,” featuring Rozes, “Don’t Let Me Down” featuring Daya and “Closer,” featuring Halsey, which went on to become the longest running #1 single of 2016 on the Billboard Hot 100 chart. In April of 2017, the group released their debut album via Disruptor/Columbia Records titled Memories…Do Not Open. The album, which has been certified Platinum, debuted at #1 in the U.S. on the Billboard 200 chart and produced Multi-Platinum certified smash hits “Paris” and “Something Just Like This” featuring Coldplay. In December 2018, The Chainsmokers released building album Sick Boy, which includes the Platinum certified single “This Feeling,” featuring Kelsea Ballerini and “Side Effects,” featuring longtime collaborator Emily Warren.\nIn December 2019, the duo released new music to comprise their latest building album, titled World War Joy, which includes the 2 Platinum certified singles “Who Do You Love” featuring 5 Seconds of Summer and “Call You Mine” featuring Bebe Rexha, and the 2 Gold certified songs “Takeaway” with ILLENIUM featuring Lennon Stella and “Hope” featuring Winona Oak. The duo was nominated for a 2019 MTV Video Music Award, multiple 2019 Teen Choice Awards and was honored with two wins at the 2019 Billboard Music Awards for Top Dance/Electronic Artist and Top Dance/Electronic Album for Sick Boy. The guys took their latest album on the road for the 2019 Fall headlining “WORLD WAR JOY” North American arena tour, while also maintaining their extended Wynn Nightlife Residency in Las Vegas. The brand new live show featured some next-level production elements never before done by The Chainsmokers, including a 60ft+ custom mega structure, levitating stages, and a 5,000 pound ‘Globe of Death.’\nFor the last few years, The Chainsmokers have been working on their next chapter of music for TCS4, kicking off with their first singles “High” in January and “iPad” in March 2022.\nTWO FRIENDS\nSHIP WREK"}]