[{"img":"https://i0.wp.com/grayarea.org/wp-content/uploads/2022/04/Banner-1-e1649738277816.jpg?fit=1440%2C810\u0026ssl=1","title":"Gray Area Incubator Artist Salon 2022.1","url":"https://grayarea.org/event/gray-area-incubator-artist-salon-2022-1/","date":"2022-05-04T18:00:00.000+00:00","details":"6:00 - 6:30 pm: Event registration\n6:30 - 8:00 pm: 10 Minute Talks\nOpen to the public sliding scale entry $0-$30\nFree for Gray Area Members\nAll Ages, 21+ Bar\nWe're so excited to welcome you back to Gray Area for the first in-person Gray Area Incubator Artist Salon in over two years! Select members of our 2022.1 Incubator cohort will share their projects in development and we invite you to contribute your feedback. Incubator artists will present their work in a TED-style talk with a question and answer period from the audience. Gray Area Incubator Artists\nAri Kalinowski\nHerson Guerrero Huh\nJacky Lu\nMarc Kate\nMichael Meisel\nLiliya Kvatsabaya\nRyan Smith\nStephanie Andrews\nStephen Standridge\nSteven Piasecki\nYasmin Mawaz-Khan Please note that we are currently accepting applications for our 2022.2 Incubator. Learn more and apply here.\nLearn more about our Incubator members here.\n"},{"img":"","title":"Grand Creative Resource Library\nSynth Sessions","url":"https://grayarea.org/event/gcrl-synth-sessions/","date":"2022-05-18T18:00:00.000+00:00","details":"May 18, 2022 6PM Mini Workshop\n7PM Group Jam Session\nFree RSVP\n(Limited capacity) Proof of vaccination is required. Read more.\nA monthly free-to-all electronic music mini-workshop and collaborative jam session held in the Gray Area lobby.\nGray Area, ZERO1, and Crowbar Corner host this 2hr session led by an instructor from the Crowbar Corner electronic music studios. Participants will expand their sonic horizons during a free hands-on workshop covering a different synthesis topic each session (drones, sequencing, sound design, etc.), then collaborate on a group jam that will propel the workshop sounds into the beyond! Participants are encouraged to bring their own electronic instrument or use one from the Grand Creative Resource Library (limited availability). Participants can also preview the instruments available from the Library and sign up to borrow one after the session. We have full modular systems, desktop synths and drum machines and a selection of Macbooks, iPads, midi controllers, and audio interfaces. The inaugural session on May 18th will be led by Ryan Smith, who in addition to teaching regular synthesis classes at Gray Area also plays in the band Caribou and makes techno music as Taraval. The workshop begins promptly at 6pm, followed by group jam time beginning at 7pm. There will be time at the end of the workshop for general questions and advice about synthesis. Please arrive in time to set up your instrument(s) before the jam begins.\nThe Grand Creative Resource Library is a lending library offering the tools needed to create electronic music and sound art. Paired with access to workshops, labs, incubators, and events produced by the contributing partners, this collective resource will eliminate barriers to creation at the forefront of art and technology.\n\nThe Grand Creative Resource Library is a collaboration between Crowbar Corner, ZERO1, and Gray Area."}]