[{"img":"","title":"Quantum Listening: Pauline Oliveros at 90","url":"https://grayarea.org/event/quantum-listening-pauline-oliveros-at-90/","date":"2022-05-30T11:00:00.000+00:00","details":"11am PT | 2pm ET | 6pm GMT\nWhat is the difference between hearing and listening? Does sound have consciousness? Can you imagine listening beyond the edge of your own imagination?\nJoin IONE, Morton Subotnick, Ramon Sender, Laurie Anderson, Aura Satz and members of the San Francisco Tape Music Center and Center for Contemporary Music to celebrate Pauline Oliveros' life and work, as well as the launch of her book Quantum Listening. IONE will lead a Sonic Meditation which will be followed by reflections and remembrances from friends of Pauline. This online event is hosted by Gray Area and Ignota Books. In response to the anti-war movements of the 1960s, pioneering musician and composer Pauline Oliveros began to expand the way she made music, experimenting with meditation, movement and activism in her compositions. Fascinated by the role that sound and consciousness play in our daily lives, Oliveros developed a series of Sonic Meditations that would eventually lead to the creation of Deep Listening. In Quantum Listening, Oliveros shows how Deep Listening is the foundation for a radically transformed social matrix: one in which compassion and peace form the basis for our actions in the world. \"Pauline has given inspiration and instructions through the depth of her listening. Her music is still resonating in quantum universes. We receive guidance from her books and essays, her keynote addresses and talks. Her graphic scores are our guiding maps. Pauline’s Quantum Listening is a clearly worded manifesto advocating for the practice of Deep Listening – the practice of practice. Accessing both the focal and the global at once makes us Futurists too, both creators and recipients of the newness, the peace and the health we long for. A champion of the underserved and underrepresented, Pauline dares us to embrace change, the unfamiliar and even the unknown. She wants us to be bold enough to imagine a benevolent society that can embrace technology to create a sublime music.\" —IONE, Quantum Listening We will be joined with remembrances by: IONE (Sonic Meditation)\nLaurie Anderson\nAura Satz\nDavid Bernstein\nAnne Bourne\nClaire Chase \u0026 Senem Pirler\nSenem Pirler \u0026 Monica Duncan\nRenko Dempster\nStuart Dempster\nAndrea Goodman\nAnne Hege\nAnne Hemenway\nBrenda Hutchinson\nRachel Koenig\nAnnea Lockwood\nNorman Lowrey\nAmy Reed\nRamon Sender (with Judy Levy-Sender)\nMorton Subotnick\nJennifer Wilsey\nPauline Oliveros (1932–2016) was a renowned American composer and performer known for conceiving a unique, meditative, improvisatory approach to music called ‘Deep Listening’®. A central figure in the development of post-war experimental and electronic music, Oliveros was the recipient of four Honorary Doctorates and many awards, including the William Schuman Award for Lifetime Achievement, Columbia University, NY; The Giga-Hertz Award for Lifetime Achievement in Electronic Music from ZKM, Center for Art and Media, Germany and The John Cage Award from from the Foundation of Contemporary Arts. During her lifetime, Oliveros was Distinguished Research Professor of Music at Rensselaer Polytechnic Institute, Troy, NY, and Darius Milhaud Artist-in-Residence at Mills College.\nThe Center for Contemporary Music originated as the the Tape Music Center, created in 1961 by Pauline Oliveros, Ramon Sender and Morton Subotnick, as a counter-cultural venue for experimental artists and musicians to perform and share ressources, equipment, and knowledge.\n"},{"img":"https://i0.wp.com/grayarea.org/wp-content/uploads/2022/04/Banner-copy.jpg?fit=1920%2C1080\u0026ssl=1","title":"Gray Area Incubator Artist Salon 2022.1","url":"https://grayarea.org/event/gray-area-incubator-artist-salon-2022-1/","date":"2022-06-15T18:00:00.000+00:00","details":"Date changed to June 15 This event was previously scheduled for May but now moved to June 15. If you RSVPed for the event in May, your tickets are still valid for this event!\n6:00 - 6:30 pm: Event registration\n6:30 - 8:00 pm: 10 Minute Talks\nOpen to the public sliding scale entry $0-$30\nFree for Gray Area Members\nAll Ages, 21+ Bar\nWe're so excited to welcome you back to Gray Area for the first in-person Gray Area Incubator Artist Salon in over two years! Select members of our 2022.1 Incubator cohort will share their projects in development and we invite you to contribute your feedback. Incubator artists will present their work in a TED-style talk with a question and answer period from the audience. Gray Area Incubator Artists\nAri Kalinowski\nHerson Guerrero Huh\nJacky Lu\nMarc Kate\nMichael Meisel\nLiliya Kvatsabaya\nRyan Smith\nStephanie Andrews\nStephen Standridge\nSteven Piasecki\nYasmin Mawaz-Khan Please note that we are currently accepting applications for our 2022.2 Incubator. Learn more and apply here.\nLearn more about our Incubator members here.\n"},{"img":"","title":"Morton Subotnick\nAs I Live \u0026 Breathe","url":"https://grayarea.org/event/morton-subotnick/","date":"2022-06-23T19:00:00.000+00:00","details":"June 23, 2022 7PM doors\n8PM performance\nSeated performance\nAll Ages Proof of vaccination is required for all attendees over 12 year of age. Learn more\nRecombinant Media Labs \u0026 Gray Area presents pioneering experimental composer and analog electronic musician Morton Subotnick in a special live performance of As I Live and Breathe, a duet of image and sound augmented with live visual animation. Subotnick has described the piece as “a fitting title as, at 88, it may be my last appearance on the road.” As I Live and Breathe combines analog recordings, electronic patches, and live performance on a hybrid Buchla 200e/Ableton “instrument” with live video animation. The work opens with the sounds of Subotnick himself breathing into a microphone: a single inhale, followed by silence, followed by an exhale. There is silence and darkness between each breath gesture, and both sound \u0026 image develop in long phrases, simply at first and gradually transforming. Morton Subotnick states, “'As I Live \u0026 Breathe' features live and sampled vocalizing along with some of my most advanced electronic performance techniques. At last, some Buchla modules are now digital plugins and Ableton Live has evolved into a form that will allow me to create a technological environment that I never expected, in my lifetime, to experience. It starts with my breath, moves through a vocalising cadenza of vocal gestures and ends with a tender and simple use of gentle rhythms and melodic fragments.\"\n"},{"img":"","title":"Grand Creative Resource Library\nSynth Sessions","url":"https://grayarea.org/event/gcrl-synth-sessions/","date":"2022-06-29T18:00:00.000+00:00","details":"June 29, 2022 6PM Mini Workshop\n7PM Group Jam Session\nFree RSVP\n(Limited capacity) Proof of vaccination is required. Read more.\nA monthly free-to-all electronic music mini-workshop and collaborative jam session held in the Gray Area lobby.\nGray Area, ZERO1, and Crowbar Corner host this 2hr session led by an instructor from the Crowbar Corner electronic music studios. Participants will expand their sonic horizons during a free hands-on workshop covering a different synthesis topic each session (drones, sequencing, sound design, etc.), then collaborate on a group jam that will propel the workshop sounds into the beyond! Participants are encouraged to bring their own electronic instrument or use one from the Grand Creative Resource Library (limited availability). Participants can also preview the instruments available from the Library and sign up to borrow one after the session. We have full modular systems, desktop synths and drum machines and a selection of Macbooks, iPads, midi controllers, and audio interfaces. The workshop begins promptly at 6pm, followed by group jam time beginning at 7pm. There will be time at the end of the workshop for general questions and advice about synthesis. Please arrive in time to set up your instrument(s) before the jam begins.\nThe Grand Creative Resource Library is a lending library offering the tools needed to create electronic music and sound art. Paired with access to workshops, labs, incubators, and events produced by the contributing partners, this collective resource will eliminate barriers to creation at the forefront of art and technology.\n\nThe Grand Creative Resource Library is a collaboration between Crowbar Corner, ZERO1, and Gray Area."},{"img":"https://i0.wp.com/grayarea.org/wp-content/uploads/2021/11/wide-banner-2.jpg?fit=2400%2C1200\u0026ssl=1","title":"DJ Dials and Gray Area presents\nTelefon Tel Aviv Live","url":"https://grayarea.org/event/telefon-tel-aviv-chasms/","date":"2022-07-30T21:00:00.000+00:00","details":"Out of concern for the health and safety of our local communities and employees, this event has been postponed to July 30, 2022.\nTelefon Tel Aviv\nChasms\nDJ Dials x Gray Area\nAll sales final\n21+ Proof of vaccination and masks required. Read more\nAfter the untimely cancellation of their performance last March, Telefon Tel Aviv returns to Gray Area to perform a new live audiovisual performance. Josh Eustis combines atmospheric soundscapes with visceral, ambient visuals touring on the album “Dreams Are Not Enough,” released in September 2019 on Ghostly International. The album and performance are seen through the lens of a dream, both in terms of its sound and its emotional content. Fears are processed and long-held desires are realized. The album and track titles refer to a recurring dream Eustis has, based on a \"murky incident during a family vacation to a remote Alabama coastline.\nTelefon Tel Aviv is an experimental electronic duo formed in 1999 by two New Orleans high-school friends, Joshua Eustis and Charles Cooper. Following years of playing in various local bands and learning the ropes of electronic music production, Eustis and Cooper wrote the demos for what would become Telefon Tel Aviv in 1999. After sending them to John Hughes III, who operated the Chicago-based Hefty Records, they were offered an album deal in January 2000. They spent the rest of that year writing their debut album, Fahrenheit Fair Enough, released in September 2001, as well as the soundtrack for the movie New Port South, written by Hughes’ brother James and released the same year.\n\n\nShaped by a diverse set of influences that included British electronic music (Autechre, Aphex Twin, Jega) and Black American music (house, techno, bounce rap), Telefon Tel Aviv were the latest in a growing lineup of American musicians that sought to carve their own lane and add something meaningful to a growing international conversation about what the meeting point between hip-hop, soul, and electronic music could be. But while Eustis and Cooper emerged within a specific context that provided their continuing work with a solid foundation, they spent the next decade taking risks and grappling with the idea of what an electronic duo could be.\nIn 2004, they released their second LP, Map Of What Is Effortless, a bold attempt at solidifying the romantic elements of their debut into a modern r\u0026b sound and featuring vocal contributions from Damon Aaron and Lindsay Anderson. Three years later, Hefty released a compilation of Telefon Tel Aviv remixes that included their take on Nine Inch Nails, Ammoncontact, Slicker, and Apparat among others. In 2009, ten years after they first began working together, the duo returned with Immolate Yourself, via Ellen Alien’s BPitch Control label. Darker and synth-driven, this third album took yet another dramatic left turn, this time towards a more unabashedly pop-minded sound. In between the German and U.S. release of Immolate, Charles Cooper passed away unexpectedly. Following Cooper’s death the Telefon Tel Aviv project went on hold. In 2014, Eustis released a solo album on Audraglint Recordings as Sons of Magdalene called Move To Pain. After years of self-doubt, Eustis decided to revive the Telefon Tel Aviv alias in 2016. This return coincides with a reissue of the debut album on Ghostly International and Eustis’ first live shows under the name, which began in the spring of 2016 with a North American tour alongside Moderat. New material under the Telefon Tel Aviv moniker is currently being written."},{"img":"","title":"Noise Pop and Yondr present\nTim Hecker","url":"https://grayarea.org/event/tim-hecker/","date":"2022-09-17T20:00:00.000+00:00","details":"September 17, 2022 8PM Doors\n9PM Show\nTBA Support 21+ Welcome This event is phone-free\nStanding performance ADA Seats available upon request. View our FAQ page for more info, or contact us at info@grayarea.org with your accommodation requests. Proof of vaccination is required for all attendees over 12 year of age. Learn more\nNoise Pop and Yondr present\nTim Hecker at Gray Area Tim Hecker is a Canadian composer and musician, born in Vancouver. During the past two decades, he has produced a wide collection of music for labels including Kranky \u0026 4AD. His works have been described as “structured ambient”, “tectonic color plates” and “cathedral electronic music”. More to the point, he has focused on exploring the intersection of noise, dissonance and melody in his work, fostering an approach to songcraft which is both physical and emotive. His repertoire spans ten albums including the seminal and critically acclaimed Ravedeath 1972, Harmony in Ultraviolet and Virgins. He is frequently commissioned for contemporary dance pieces, art installations and film scores \u0026 recently completed a 5 part series for the BBC entitled ‘The North Water’ directed by Andrew Haigh, as well as independent film ‘Lucifer’ by Austrian filmmaker Peter Brunner. He is currently working alongside traditional Japanese gagagku players in his current project with the Konoyo Ensemble.\nThis event will be a phone-free experience. Use of phones, smart watches and accessories, will not be permitted in the performance space. Upon arrival at the venue, all phones, smart watches and accessories will be secured in individual Yondr pouches that will be opened at the end of the event. Guests maintain possession of their devices at all times, and can access them throughout the event only in designated Phone Use Areas within the venue. All devices will be re-secured in Yondr pouches before returning to the performance space. All pouches and equipment will be sanitized prior to individual use. The Yondr staff is trained and required to follow safety guidelines and hygiene protocols to practice social distancing, minimal contact and wear required personal protective equipment. Anyone seen using a device (phone, smart watch or accessories) during the performance will be escorted out of the venue by security. We appreciate your cooperation in creating a phone-free experience."}]