[{"img":"https://i0.wp.com/grayarea.org/wp-content/uploads/2022/04/Banner-1-e1649738277816.jpg?fit=1440%2C810\u0026ssl=1","title":"Gray Area Incubator Artist Salon 2022.1","url":"https://grayarea.org/event/gray-area-incubator-artist-salon-2022-1/","date":"2022-05-04T18:00:00.000+00:00","details":"6:00 - 6:30 pm: Event registration\n6:30 - 8:00 pm: 10 Minute Talks\nOpen to the public sliding scale entry $0-$30\nFree for Gray Area Members\nAll Ages, 21+ Bar\nWe're so excited to welcome you back to Gray Area for the first in-person Gray Area Incubator Artist Salon in over two years! Select members of our 2022.1 Incubator cohort will share their projects in development and we invite you to contribute your feedback. Incubator artists will present their work in a TED-style talk with a question and answer period from the audience. Gray Area Incubator Artists\nAri Kalinowski\nHerson Guerrero Huh\nJacky Lu\nMarc Kate\nMichael Meisel\nLiliya Kvatsabaya\nRyan Smith\nStephanie Andrews\nStephen Standridge\nSteven Piasecki\nYasmin Mawaz-Khan Please note that we are currently accepting applications for our 2022.2 Incubator. Learn more and apply here.\nLearn more about our Incubator members here.\n"},{"img":"","title":"Grand Creative Resource Library\nSynth Sessions","url":"https://grayarea.org/event/gcrl-synth-sessions/","date":"2022-05-18T18:00:00.000+00:00","details":"May 18, 2022 6PM Mini Workshop\n7PM Group Jam Session\nFree RSVP\n(Limited capacity) Proof of vaccination is required. Read more.\nA monthly free-to-all electronic music mini-workshop and collaborative jam session held in the Gray Area lobby.\nGray Area, ZERO1, and Crowbar Corner host this 2hr session led by an instructor from the Crowbar Corner electronic music studios. Participants will expand their sonic horizons during a free hands-on workshop covering a different synthesis topic each session (drones, sequencing, sound design, etc.), then collaborate on a group jam that will propel the workshop sounds into the beyond! Participants are encouraged to bring their own electronic instrument or use one from the Grand Creative Resource Library (limited availability). Participants can also preview the instruments available from the Library and sign up to borrow one after the session. We have full modular systems, desktop synths and drum machines and a selection of Macbooks, iPads, midi controllers, and audio interfaces. The inaugural session on May 18th will be led by Ryan Smith, who in addition to teaching regular synthesis classes at Gray Area also plays in the band Caribou and makes techno music as Taraval. The workshop begins promptly at 6pm, followed by group jam time beginning at 7pm. There will be time at the end of the workshop for general questions and advice about synthesis. Please arrive in time to set up your instrument(s) before the jam begins.\nThe Grand Creative Resource Library is a lending library offering the tools needed to create electronic music and sound art. Paired with access to workshops, labs, incubators, and events produced by the contributing partners, this collective resource will eliminate barriers to creation at the forefront of art and technology.\n\nThe Grand Creative Resource Library is a collaboration between Crowbar Corner, ZERO1, and Gray Area."},{"img":"https://i0.wp.com/grayarea.org/wp-content/uploads/2022/04/P1020684-Vicki-GGB-Oslo2021-scaled.jpg?fit=2560%2C1922\u0026ssl=1","title":"Vicki Bennett (People Like Us)\nArtist talk \u0026 special screening of Gone, Gone Beyond","url":"https://grayarea.org/event/vicki-bennett/","date":"2022-05-25T18:30:00.000+00:00","details":"6:30PM Doors open\n7:00PM Presentation by Vicki Bennett\n8:00PM Screening of Gone, Gone Beyond\n$10 Presentation only\n$30 Presentation + screening Proof of vaccination is required for all attendees over the age of 12 years old. Read more.\nJoin us for this special showing of Gone, Gone Beyond and go behind the screen with creator Vicki Bennett (People Like Us), as she shares her creative process, expanding her aesthetics from 2D to 3D to create audiovisual content which breaks the rectangle.\nUsing collage as a compositional tool opens up endless opportunities to experience results that are more than the sum of the parts, opening doors (and windows) to let light in from outside of our own limited and sometimes repetitive ways of thinking. Since 2016 Vicki Bennett has been creating “Gone, Gone Beyond” for RML CineChamber, an immersive 360 surround cinema environment, is now an hour long. In this presentation Vicki tells us about her creative process, expanding her aesthetics from 2D to 3D to create audiovisual content which breaks the rectangle, smashing the thin screen into tiny fragments, looking beyond the frame, climbing through to see what’s behind. Under the name “People Like Us,” artist Vicki Bennett has been making work available via CD, DVD and vinyl releases, radio broadcasts, concert appearances, gallery exhibits and online streaming and distribution since 1992. Bennett has developed an immediately recognisable aesthetic repurposing pre-existing footage to craft audio and video collages with an equally dark and witty take on popular culture.\nShe sees sampling and collage as folk art sourced from the palette of contemporary media and technology, with all of the sharing and cross-referencing incumbent to a populist form. Embedded in her work is the premise that all is interconnected and that claiming ownership of an “original” or isolated concept is both preposterous and redundant. Most of the People Like Us back catalogue has been available for free online since 2002. For many artists, profit and publicity is more likely through free distribution (the gift economy) than independent publishers and distributors, which often struggle with limited resources. Online self-distribution allows an artist to keep their work available, resolving a tension between label production costs and the desire of an artist for work to be available. UbuWeb generously hosts the discography and filmography of People Like Us.\nGone, Gone Beyond\nThis special screening is part of a limited run showing of Gone, Gone Beyond, an immersive audio-visual spatial cinema work by People Like Us (aka Vicki Bennett). This is Gone, Gone, Beyond's US premiere, following its European debut tour last fall with screenings at nyMusikk in Oslo, the Barbican in London, and more.\nThe work's title and underlying concepts come from the Heart Sutra, a key Buddhist text, describing how all phenomena are empty in form yet ultimately interconnected. The last lines of the Heart Sutra say ‘gate gate pāragate pārasamgate bodhi svāhā’, which can be translated as “gone, gone beyond, gone beyond that a bit more, and then beyond that a bit further”. This reflects perfectly the action of going beyond the frame to where there are no edges to the narrative – just emptiness."},{"img":"","title":"Morton Subotnick\nAs I Live \u0026 Breathe","url":"https://grayarea.org/event/morton-subotnick/","date":"2022-06-23T19:00:00.000+00:00","details":"June 23, 2022 7PM doors\n8PM performance\nSeated performance\nAll Ages Proof of vaccination is required for all attendees over 12 year of age. Learn more\nRecombinant Media Labs \u0026 Gray Area presents pioneering experimental composer and analog electronic musician Morton Subotnick in a special live performance of As I Live and Breathe, a duet of image and sound augmented with live visual animation. Subotnick has described the piece as “a fitting title as, at 88, it may be my last appearance on the road.” As I Live and Breathe combines analog recordings, electronic patches, and live performance on a hybrid Buchla 200e/Ableton “instrument” with live video animation. The work opens with the sounds of Subotnick himself breathing into a microphone: a single inhale, followed by silence, followed by an exhale. There is silence and darkness between each breath gesture, and both sound \u0026 image develop in long phrases, simply at first and gradually transforming. Morton Subotnick states, “'As I Live \u0026 Breathe' features live and sampled vocalizing along with some of my most advanced electronic performance techniques. At last, some Buchla modules are now digital plugins and Ableton Live has evolved into a form that will allow me to create a technological environment that I never expected, in my lifetime, to experience. It starts with my breath, moves through a vocalising cadenza of vocal gestures and ends with a tender and simple use of gentle rhythms and melodic fragments.\"\n"},{"img":"https://i0.wp.com/grayarea.org/wp-content/uploads/2021/11/wide-banner-2.jpg?fit=2400%2C1200\u0026ssl=1","title":"DJ Dials and Gray Area presents\nTelefon Tel Aviv Live","url":"https://grayarea.org/event/telefon-tel-aviv-chasms/","date":"2022-07-30T21:00:00.000+00:00","details":"Out of concern for the health and safety of our local communities and employees, this event has been postponed to July 30, 2022.\nTelefon Tel Aviv\nChasms\nDJ Dials x Gray Area\nAll sales final\n21+ Proof of vaccination and masks required. Read more\nAfter the untimely cancellation of their performance last March, Telefon Tel Aviv returns to Gray Area to perform a new live audiovisual performance. Josh Eustis combines atmospheric soundscapes with visceral, ambient visuals touring on the album “Dreams Are Not Enough,” released in September 2019 on Ghostly International. The album and performance are seen through the lens of a dream, both in terms of its sound and its emotional content. Fears are processed and long-held desires are realized. The album and track titles refer to a recurring dream Eustis has, based on a \"murky incident during a family vacation to a remote Alabama coastline.\nTelefon Tel Aviv is an experimental electronic duo formed in 1999 by two New Orleans high-school friends, Joshua Eustis and Charles Cooper. Following years of playing in various local bands and learning the ropes of electronic music production, Eustis and Cooper wrote the demos for what would become Telefon Tel Aviv in 1999. After sending them to John Hughes III, who operated the Chicago-based Hefty Records, they were offered an album deal in January 2000. They spent the rest of that year writing their debut album, Fahrenheit Fair Enough, released in September 2001, as well as the soundtrack for the movie New Port South, written by Hughes’ brother James and released the same year.\n\n\nShaped by a diverse set of influences that included British electronic music (Autechre, Aphex Twin, Jega) and Black American music (house, techno, bounce rap), Telefon Tel Aviv were the latest in a growing lineup of American musicians that sought to carve their own lane and add something meaningful to a growing international conversation about what the meeting point between hip-hop, soul, and electronic music could be. But while Eustis and Cooper emerged within a specific context that provided their continuing work with a solid foundation, they spent the next decade taking risks and grappling with the idea of what an electronic duo could be.\nIn 2004, they released their second LP, Map Of What Is Effortless, a bold attempt at solidifying the romantic elements of their debut into a modern r\u0026b sound and featuring vocal contributions from Damon Aaron and Lindsay Anderson. Three years later, Hefty released a compilation of Telefon Tel Aviv remixes that included their take on Nine Inch Nails, Ammoncontact, Slicker, and Apparat among others. In 2009, ten years after they first began working together, the duo returned with Immolate Yourself, via Ellen Alien’s BPitch Control label. Darker and synth-driven, this third album took yet another dramatic left turn, this time towards a more unabashedly pop-minded sound. In between the German and U.S. release of Immolate, Charles Cooper passed away unexpectedly. Following Cooper’s death the Telefon Tel Aviv project went on hold. In 2014, Eustis released a solo album on Audraglint Recordings as Sons of Magdalene called Move To Pain. After years of self-doubt, Eustis decided to revive the Telefon Tel Aviv alias in 2016. This return coincides with a reissue of the debut album on Ghostly International and Eustis’ first live shows under the name, which began in the spring of 2016 with a North American tour alongside Moderat. New material under the Telefon Tel Aviv moniker is currently being written."}]