[{"date":"2022-06-01T19:00:00.000+00:00","img":"https://cdn.vor.us/event/477673/b5399204316b403ab243fd156d6b6aeb.image!jpeg.968800.jpg.060122flyer2.jpg","title":"THROWN-OUT BONES","url":"https://wl.seetickets.us/event/THROWN-OUT-BONES/477673?afflky=RickshawStop","details":"THROWN-OUT BONES\nBilly Wylder\nLOUIZA\n\n7pm\n$12 advance / $15 doors\nAll ages\n\n*All attendees must be fully vaccinated and be able to show proof (via card or QR code). Let's keep everyone safe and sound during this return to live music!*\n\nSan Francisco-based Thrown-Out Bones is a high-energy swanky rock group known for their experimental approach to genre and performance. With 10+ years of playing together, this power trio has developed a unique sound that blurs the lines between funk, jazz, classic rock, and even the occasional deep, contemplative jam. The shows themselves have gained a following for the creative ways the band breaks down the fourth wall with audience-inspired improvisation or even occasionally inviting fans onstage to sing lead.\n\nBilly Wylder’s music weaves together American folk and rock with sensibilities from the Sahara Desert, exploring new musical space akin to Devendra Banhart, Beck, and Tinariwen. Billy Wylder’s new recordings evoke musical evolutions built on grooves informed by ancient African rhythms, art-rock textures, expansive guitars, violins, synths, and drum machines. Salloway’s lyrics flow with inspiration from mythical songwriting hero Leonard Cohen, while threading together more abstract imagery reminiscent of Thom Yorke.\n\nCalifornia native LOUIZA is one of indie music’s best rising pop singer-songwriters. Acclaimed by top music tastemakers like Billboard, The Line of Best Fit, and The Deli SF, she’s at the forefront of music innovation and discovery. Her sound is best described as a charismatic blend of jazz and electro-pop with an underlining hint of alternative rock. Vocally, she’s inspired by legends like Joni Mitchell and Kurt Cobain, who she’s been highly compared to by fans and media. While she maintains a distinctly pop backbone, LOUIZA plays around with fresh concepts for each new project. Fans should check out her latest releases including her single “Anomie,” released on June 4th and her On, Off EP, out on all major streaming platforms as of June 26th 2021."},{"date":"2022-06-03T21:00:00.000+00:00","img":"https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F157137139%2F4528219194%2F1%2Foriginal.20210928-034923?w=50\u0026auto=format%2Ccompress\u0026q=75\u0026sharp=10\u0026rect=0%2C171%2C1968%2C984\u0026s=df0f628608960e182749b7a810241c63","title":"KID FRANCESCOLI + Kids Return Tickets, Fri, Jun 3, 2022 at 9:00 PM | Eventbrite","url":"https://www.eventbrite.com/e/kid-francescoli-kids-return-tickets-170168910793","details":""},{"date":"2022-06-04T20:00:00.000-07:00","img":"https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F259109889%2F4528219194%2F1%2Foriginal.20220401-213916?w=50\u0026auto=format%2Ccompress\u0026q=75\u0026sharp=10\u0026rect=0%2C187%2C300%2C150\u0026s=382b3de95b07a1101366bdd3dd7c86f9","title":"AMBAR LUCID Tickets, Sat, Jun 4, 2022 at 8:00 PM | Eventbrite","url":"https://www.eventbrite.com/e/ambar-lucid-tickets-312045976917","details":""},{"date":"2022-06-10T21:00:00.000+00:00","img":"https://cdn.vor.us/event/480663/6fc5d3561ad243f69f463d210a95c5f5.image!jpeg.297390.jpeg.061022fullerlineup.jpeg","title":"SACRED SKIN / AURAT / FEARING / FUTURE OF HORROR","url":"https://wl.seetickets.us/event/SACRED-SKIN-AURAT-FEARING-FUTURE-OF-HORROR/480663?afflky=RickshawStop","details":"Popscene presents\nSACRED SKIN\nAurat\nFearing\nFeaturing DJ Omar\n\n9pm\n$16 advance / $18 doors\n18+\n\n*All attendees must be fully vaccinated and be able to show proof (via card or QR code). Let's keep everyone safe and sound during this return to live music!*\n\nSacred Skin: https://sacredskin.bandcamp.com/\n\nAurat is a music group based in L.A. Embracing the Urdu language. With lead vocalist Azeka who is a Pakistani-American and Gil on bass/production. https://aurat.bandcamp.com\n\nFearing. https://fearing.bandcamp.com\n\nFuture of Horror: https://futureofhorror.bandcamp.com/releases"},{"date":"2022-06-11T20:30:00.000+00:00","img":"https://cdn.vor.us/event/478655/aac863ce33c74e2e94bac6825703fe61.image!png.2330144.png.FLYER.png","title":"EURO NIGHT PARTY","url":"https://wl.seetickets.us/event/EURO-NIGHT-PARTY/478655?afflky=RickshawStop","details":"EURO NIGHT PARTY\nwith live sets by\nSonamó\nDos Bandoleros\nRue '66\nplus DJ Nino MSK\n\n8:30 pm doors\nEARLY BIRD $15 (ends May 11) / advance $20 / Doors $25\nAll Ages\n*All attendees must be fully vaccinated and be able to show proof. Let's keep everyone safe and sound during this return to live music!*\nEuropeans and Europhiles! Join us for this one of a kind event featuring three live bands from Europe: Sonamó (ITALY), Rue'66 (FRANCE), Dos Bandoleros (SPAIN) and the eclectic DJ Nino MSK (bff.fm).\n\nSonamó (Italy) \nif Sting and Jamiroquai had a lovechild they would name it Sonamó. With a dynamic, passionate blend of melodic lines shot through with hefty doses of R\u0026B, funk, and acid jazz, Sonamó music is both danceable yet introspective, at once familiar yet exotic, intense yet energetic, romantic and yet somehow carefree. The high energy and intensity of Sonamó is well expressed in their memorable live performances.\n\nRue '66 (France)\nUnique, obscure, and truly authentic French yéyé music. Drawing inspiration from Serge Gainsbourg, France Gall, Jacques Dutronc, Françoise Hardy, Gillian Hills, Michel Polnareff and groups like The Zombies, Pussycat, The Searchers, etc., Rue '66 is sure to delight.\n\nDos Bandoleros (Spain) \nDos Bandoleros is the exciting project of Raúl Vargas from Makrú and Alberto Gutierrez from La Mandanga, two of the most creatives minds in the Bay Area. Both native from Madrid (Spain) and two regulars in the Latin music Bay’s scene. \n\nDJ Nino MSK (bff.fm)\nNino Msk, the Italian-born, SF-based producer behind Italic Disco is known for is work in the city with community and non-profit radio. He has created 200+ episodes of his weekly podcast, Espresso Sesh on BFF.fm (SFWeekly Best Radio Station 2013-19). Italic Disco was conceived as an outlet for Nino’s uptempo, electronic-driven, disco-inspired productions, in which he mostly uses analog drum machines, synthesizers, and samplers. Italic Disco has performed at Burning Man events in Black Rock City and SF, including Pre-compression and Decompression."},{"date":"2022-06-14T20:00:00.000-07:00","img":"https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F253099799%2F4528219194%2F1%2Foriginal.20220323-154947?w=50\u0026auto=format%2Ccompress\u0026q=75\u0026sharp=10\u0026rect=0%2C1084%2C3000%2C1500\u0026s=b71830f77358ea0cd2ac8d523e45671e","title":"RONE Tickets, Tue, Jun 14, 2022 at 8:00 PM | Eventbrite","url":"https://www.eventbrite.com/e/rone-tickets-259523851827","details":""},{"date":"2022-06-15T19:00:00.000+00:00","img":"https://cdn.vor.us/event/484413/544bfe12277343d8aabe9ef700834d01.image!png.613953.png.061522nerds.png","title":"Nerd Nite SF #126: Hey Girl! Bingo \u0026 DNA Sequencing!","url":"https://wl.seetickets.us/event/Nerd-Nite-SF-126-Hey-Girl-Bingo-and-DNA-Sequencing/484413?afflky=RickshawStop","details":"Nerd Nite SF #126: Hey Girl! Bingo \u0026 DNA Sequencing!\n7 pm doors\n$15 adv / $20 at the doors\nAll ages\n\n*All attendees must be fully vaccinated and be able to show proof (via card, phone, or QR code). Let's keep everyone safe and sound during this return to live entertainment!*\nJoin us for Nerd Nite SF, the Pride month party edition!\n\nWe’re very excited to announce that we’ll be partnering with the bearded bingo babe herself, Shelix, for Hey Girl! Bingo before the talks begin. Come early to kick off the evening with a drink and a bingo card! Nerdy prizes and drink tickets are up for grabs!\n\nThe evening will continue with another kind of helix, the DNA kind! Other talk topics TBA, but word on the street is that they pertain to private investigation and San Francisco drag history. Stay tuned, but in the meantime, the early nerd gets the worm! Or, the free bingo square.\n\nHow to Sequence a Genome with Jess McLaughlin\n\nEver wonder exactly how you get DNA from, say, a fruit fly, a lizard, your dog, or even yourself, and actually turn it into something we can read? Would you have guessed it includes weird chemistry, magnets, fluorescent colors, and some very fancy dish soap? Jess McLaughlin, an evolutionary biologist, will explain how DNA sequencing is basically tech-wizardry, turning molecules in your cells into light and then into computer bytes.\n\nJess is a postdoc at UC Berkeley, where they study the evolution of anole lizards in the Caribbean. They also research how new species of birds develop, and they have a passion for telling folks about just how weird biology can be.\n\nBe there, be square, and win a bingo prize!\n\n*\nNerd Nite SF is a monthly lecture-in-a-bar series where we invite interesting people - scientists, historians, game designers, mimes, etc. - to give short talks on their expertise to tipsy nerds. We strive to be playful, entertaining, sometimes a little inebriated or salacious, but always deeply educational. Join us!https://sf.nerdnite.com/"},{"date":"2022-06-16T20:00:00.000+00:00","img":"https://cdn.vor.us/event/464142/3819efe1c5714ad69cb1dc62729544e1.image!jpeg.5735477.jpg.JORDANAadmatwlogo061622.jpg","title":"JORDANA","url":"https://wl.seetickets.us/event/JORDANA/464142?afflky=RickshawStop","details":"Rickshaw Stop + Popscene co-present\n\nJORDANA\nHarry Teardrop\n8pm\n$15\nAll ages\n\n*All attendees must be fully vaccinated and be able to show proof (via card or QR code). Let's keep everyone safe and sound during this return to live music!*\n\nIt’s been quite the year for Jordana Nye. In March of 2020, Grand Jury reissued her sleeper debut Classical Notions of Happiness. Then the world abruptly fell apart. Using the time she would have spent touring in support of the album (seriously, there were 60 dates!), she quickly turned around a batch of new material that radically expanded on the homespun bedroom pop of her debut. The result is Something To Say To You, a monumental leap for the 20-year-old songwriter. The album, a compilation of two EPs she released in the second half of 2020, landed her on Best New Artist lists at Stereogum, Paste, NME, Pigeons \u0026 Planes, and more. Seemingly never content to slow down, Jordana recently relocated from her Kansas bedroom to a New York City apartment where she's hard at work on her third full length since 2019. https://open.spotify.com/artist/5Bw9kFNhy019e4IBCJZlzw?si=ual_Tz3ySa2oF90dwKw5Ww\n\nLike a flower blooming out of cracks in the pavement, twenty one year-old Harry Teardrop is a rising star. From his bedroom in New York City, Teardrop's self-produced spin on rock music marries dirty guitar riffs with dance \u0026 rap-inspired drums and sticky hooks, crafting a whole band on his laptop. His musical influences range from bands like Blur, The Strokes, and Blink-182 to jazz icons like Bill Evans, Nat King Cole, and Billie Holiday. https://harryteardrop.com/"},{"date":"2022-06-17T20:00:00.000+00:00","img":"https://cdn.vor.us/event/471505/04ea1a2c88ec4221b4d38bb64af5e67d.image!jpeg.2682506.JPG.061722ceramicflyer.JPG","title":"COOL GHOULS","url":"https://wl.seetickets.us/event/COOL-GHOULS/471505?afflky=RickshawStop","details":"COOL GHOULS\nChime School\nThe Smashing Times\nAlmond Joy\n\n8pm\n$15 advance / $18 doors\nAll ages\n\n*All attendees must be fully vaccinated and be able to show proof (via card or QR code). Let's keep everyone safe and sound during this return to live music!*\n\n\"Come witness rock'n'roll history! San Francisco's very own Cool Ghouls live in concert for the first time since 2019! They're a fantastic unit for playing rock'n'roll! Not to be missed! Truly a gem!\" https://coolghouls420.bandcamp.com\nChime School is the project of San Francisco musician Andy Pastalaniec. Endlessly charmed by 80s indie and its 60s forbearers (and any record with a 12-string guitar), Andy cut his teeth as a drummer with SLR labelmate Odd Hope in their early group Pink Films; later with shoegazers Cruel Summer, and currently with indiepop outfit Seablite. https://chimeschool.bandcamp.com/\nThe Smashing Times is Baltimore's finest jangle: \"This is perfectly obtuse late 80s jangle in the weirdest of traditions.... the finest examples of The Television Personalities perfect ‘warble, wistfully in the dark’ sound, among washed out strains of the tinny, stuttering jangled riffs, that was so omnipotent in the jangle sub-culture of yesteryear.\" -- janglepophub https://thesmashingtimes.bandcamp.com/\nAlmond Joy makes candy soul/rock: https://www.youtube.com/watch?v=QbuGBKKjQUo"},{"date":"2022-06-18T21:00:00.000+00:00","img":"https://cdn.vor.us/event/482227/0f20f90db1ae4593b559a6c3d85bd9d9.image!jpeg.139619.jpg.BootieMashupSF_06-2022_poster.jpg","title":"BOOTIE MASHUP - Future Chromatica: Dua x Gaga","url":"https://wl.seetickets.us/event/BOOTIE-MASHUP-Future-Chromatica-Dua-x-Gaga/482227?afflky=RickshawStop","details":"BOOTIE MASHUP - Future Chromatica: Dua vs Gaga\nwith Mashup DJs Adriana A, DJ Tyme, \u0026 Jupiter Gatling\nplus Dua Lipa \u0026 Lady Gaga drag tributes by The Monster Show\n\n9 pm doors\n$15 advance / $20 doors (+ $5 if under 21)\n18+\n\n*All attendees must be fully vaccinated and be able to show proof (via card or QR code). Let's keep everyone safe and sound during this return to live music!*\n\nThe last time we tried to throw this party, Miss Omicron shut us down, so we’re going Gaga for this Dua-Over! It’s the Pride Month collab we all want, so we’ll be mashing up these two pop divas all night!\n\n• Dua Lipa \u0026 Lady Gaga drag tribute performances \n• Go-go dancing \u0026 LED hula hooping by Aryana \u0026 Helena\n• Dress up in your Dua \u0026 Gaga-inspired lewks for our 12:30 stage showcase! \n• Video projections \u0026 decorations\n\nMashup DJs:\nDJ Tyme\nAirsun\nJupiter Gatling\n\n11:11 Show: Dua Lipa \u0026 Lady Gaga drag tributes by The Monster Show\n\nShowcasing the best mashups in the world ever, Bootie Mashup prides itself on throwing genre-fluid dance parties, shamelessly combining pop songs both throwback and current. With our fun, creative themes, our diverse team of pop pirates have won numerous nightlife awards in California and beyond. BootieMashup.com/sf"},{"date":"2022-06-19T19:00:00.000-07:00","img":"https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F234138319%2F4528219194%2F1%2Foriginal.20220222-002656?w=50\u0026auto=format%2Ccompress\u0026q=75\u0026sharp=10\u0026rect=0%2C60%2C1918%2C959\u0026s=f49257b42be68e5fbf44ef99fccb1edd","title":"EXES Tickets, Sun, Jun 19, 2022 at 7:00 PM | Eventbrite","url":"https://www.eventbrite.com/e/exes-tickets-204762027737","details":""},{"date":"2022-06-22T20:00:00.000+00:00","img":"https://cdn.vor.us/event/471500/89c1afb1e9a5480c97434f661502bdac.image!jpeg.478884.jpg.062222bayledgeswsupportflyer.jpg","title":"BAY LEDGES","url":"https://wl.seetickets.us/event/BAY-LEDGES/471500?afflky=RickshawStop","details":"Popscene + Rickshaw Stop co-present\n\nBAY LEDGES\n\nw/ Doublecamp\n8 pm\n\n$15 Advance / $18 Doors\n\nAll ages\n\n*All attendees must be fully vaccinated and be able to show proof (via card or QR code). Let's keep everyone safe and sound during this return to live music!*\n\nZach Hurd started Bay Ledges in his bedroom after moving to Los Angeles from a smalltown in coastal Maine in 2015. It began as an attempt to make fun, creative sounds withno expectation. Chopped up guitar lines, playful beats and manipulated vocals createdsoulful, glitchy songs with a feeling of nostalgia. The project took off when Hurd’s 2016single, “Safe,” jumped to the number three spot on Spotify’s Global Viral Chart.\nIn the years that followed, Bay Ledges toured all over the US and Canada, sharing thestage with such acts as Yoke Lore, Magic City Hippies and The Palms. In 2020 Hurdutilized time off the road to get back to the more personal process of making music -writing, producing and mixing his 2020 EP, New Daze. The result was a more intimateexploration and an evolution of the Bay Ledges sound. https://www.bayledges.com/"},{"date":"2022-06-23T20:00:00.000+00:00","img":"https://cdn.vor.us/event/465354/c976be22d29d4b94b14a37205597fd65.image!jpeg.931167.jpg.CRAWLERSadmatSQ062322.jpg","title":"CRAWLERS","url":"https://wl.seetickets.us/event/CRAWLERS/465354?afflky=RickshawStop","details":"Rickshaw Stop + Popscene co-present\n\nCRAWLERS\nsupport tba\n\n8pm\n$17 advance / $20 doors\nAll ages\n\n*All attendees must be fully vaccinated and be able to show proof (via card or QR code). Let's keep everyone safe and sound during this return to live music!*\n\nCRAWLERS: UK ALT ROCK BAND FROM LIVERPOOL! https://www.crawlersband.com/"},{"date":"2022-05-24T00:00:00.000+00:00","title":"FAKE and GAY Pride! Namasenda + SONIKKU more TBA at Rickshaw Stop, San Francisco/Oakland · Tickets","img":"https://rickshawstop.com/wp-content/uploads/2022/04/b5399204316b403ab243fd156d6b6aeb.imagejpeg.968800.060122flyer2-150x150.jpg","url":"https://ra.co/events/1535866","details":""},{"date":"2022-06-28T20:00:00.000-07:00","img":"https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F257005499%2F4528219194%2F1%2Foriginal.20220330-021619?w=50\u0026auto=format%2Ccompress\u0026q=75\u0026sharp=10\u0026rect=0%2C1453%2C3000%2C1500\u0026s=d1e8de9c2adf7dc33abd05971044b4a8","title":"HAIKU HANDS Tickets, Tue, Jun 28, 2022 at 8:00 PM | Eventbrite","url":"https://www.eventbrite.com/e/haiku-hands-tickets-305090352457","details":""},{"date":"2022-06-30T20:00:00.000+00:00","img":"https://cdn.vor.us/event/472692/378a9d4816cf4c2783addc95163d6168.image!jpeg.179458.jpeg.063022flyer.jpeg","title":"COLLECTIVITY","url":"https://wl.seetickets.us/event/COLLECTIVITY/472692?afflky=RickshawStop","details":"COLLECTIVITY\nSeal Party (album release)\nComforting Chaos\n\n8pm\n$12 advance / $15 doors\nAll ages\n\n*All attendees must be fully vaccinated and be able to show proof (via card or QR code). Let's keep everyone safe and sound during this return to live music!*\n\nCollectivity is a Bay Area powerhouse, jazz funk psychedelic dance party coming like a freight train for your mind and booty. These are seasoned vets of the music industry, banding together to give you a pumped-up, high-energy show of collective improvisation and expanding exploration. The Collectivity players have performed with world-renowned artists including CeeLo Green, Too $hort, Fantastic Negrito, Lyrics Born, Dumpstaphunk, Booker T \u0026 the MGs, and Pancho Sanchez. https://collectivitymusic.com/\n\nSeal Party is a new band led by Chris McGrew and Kevin Seal of the much-loved, now-defunct rock group Griddle. At the Rickshaw Stop on June 30, McGrew and Seal will release Seal Party’s debut album, MMXXII, a wild, ambitious song cycle featuring strings, horns, B3, piano, percussion, and luscious vocal harmonies. Seal Party’s unusual hybrid of alternative R\u0026B and art rock is built on thick, extended harmonies and propulsive syncopations. These two longtime session players have stepped to the foreground. To their experiment, they’ve invited some of the nation’s most exciting musicians. https://sealparty.bandcamp.com/\n\nSan Francisco-based Comforting Chaos is a creative collective of friends led by producers/composers Liam Berry and Liam Craddock and fronted by artists Xanubis and Vazh. These core members have worked together artistically for many years, and are excited to begin a new chapter in their collective work, bringing together their wide array of musical influences to create a fresh new sound and provide a unique, high-energy live experience. Featured guest Afterthought is another local artist who has been forging his own scene, playing killer shows regularly at the Chapel and other great Bay Area clubs. youtube.com/channel/UCNWbY-xBeOnP02NPe_TvKxA"},{"date":"2022-07-08T20:00:00.000+00:00","img":"https://cdn.vor.us/event/468593/35d6b3a8f8ab481d9f35e8dd8c153576.image!jpeg.753857.jpg.ColaTourAdMat2WSUPPORT070822.jpg","title":"COLA","url":"https://wl.seetickets.us/event/COLA/468593?afflky=RickshawStop","details":"Rickshaw Stop + Popscene co-present\n\nCOLA\nSour Widows\nAluminum\n+ Popscene DJs\n\n8 pm\n$15\nall ages\n\n*All attendees must be fully vaccinated and be able to show proof (via card or QR code). Let's keep everyone safe and sound during this return to live music!*\n\nCola is a new project from former Ought members Tim Darcy and Ben Stidworthy, formed with US Girls drummer Evan Cartwright. \"Blank Curtain\" provides an exciting hint of the way the new project picks up some of the threads of the pair's earlier work and weaves them into engaging new shapes, constructing a driving tangle of guitars around an arresting performance from Darcy. https://www.instagram.com/band_cola/\n\nWith Crossing Over, Sour Widows discover a new intensity by turning inward. The second EP from this Bay Area band dials back some of the volume that drove their self-titled 2020 debut to make space for themes of self-reflection and painful change that cut through with sharpened clarity. The luminous vocal harmonies, complex guitar interplay, and understated drumming that have been at the core of the band's sound remain foundational; but these four songs reach deeper, all the more stirring in their subtlety. https://sourwidows.bandcamp.com/\n\nAluminum is a four-piece outfit from the Bay Area. Rock/ Pop/ Experimental. https://aluminum.bandcamp.com/"},{"date":"2022-07-14T18:30:00.000+00:00","img":"https://cdn.vor.us/event/483246/bb58600c554649c089357f717f3ed12b.image!png.24384.png.bayareapunoff.png","title":"Bay Area Pun Off Returns!","url":"https://wl.seetickets.us/event/Bay-Area-Pun-Off-Returns/483246?afflky=RickshawStop","details":"Bay Area Pun Off Returns!\nDoors at 6:30pm\n$25\n\nThis summer, the Bay Area Pun-Off is back!\n\nNew puns, new faces, new venue ~\n\nIf you want to compete, go to https://worldwidepuns.com/ to register!"},{"date":"2022-07-15T20:00:00.000+00:00","img":"https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F247248659%2F4528219194%2F1%2Foriginal.20220314-174920?w=50\u0026auto=format%2Ccompress\u0026q=75\u0026sharp=10\u0026rect=0%2C341%2C2000%2C1000\u0026s=fa81e3696e07cb7dc366d994099fd1a1","title":"THE RARE OCCASIONS Tickets, Fri, Jul 15, 2022 at 8:00 PM | Eventbrite","url":"https://www.eventbrite.com/e/the-rare-occasions-tickets-297093172677","details":""}]