[{"date":"2022-05-25T19:00:00.000+00:00","img":"https://cdn.vor.us/event/482845/3f974052f5034cd0bc6734ab81769ccd.image!png.712794.png.052522nerdnite.png","title":"Nerd Nite SF #125: Explosions, Godzilla, and a 500 Mile Walk","url":"https://wl.seetickets.us/event/Nerd-Nite-SF-125-Explosions-Godzilla-and-a-500-Mile-Walk/482845?afflky=RickshawStop","details":"Nerd Nite SF #125: Explosions, Godzilla, and a 500 Mile Walk!7 pm doors\n$12 adv / $17 at the doors\nAll ages\n\n*All attendees must be fully vaccinated and be able to show proof (via card, phone, or QR code). Let's keep everyone safe and sound during this return to live entertainment!*\n\n\n------------------------------------------------------------------------------------------------------------------\nThe Explosive History of Exploding Wires with Glenn Carroll\n\nFor about 175 years prior to the Trinity test in 1945, exploding wires had been noted but neither understood nor much studied.  The success of implosion fission--reliant on exploding wire detonators--kicked off intense research on ex-wires in the US and abroad, as many parties around the world launched their own weapons development programs.In short, exploding wires made the bomb possible, while the success of the bomb drove decades-long efforts to understand exploding wires.  This peculiar symbiosis has continued ever since, with exploding wires making regular appearances in the historical record of nuclear weapons R\u0026D. This talk will give a very brief introduction to exploding wire phenomena, and survey the role ex-wires have played in nuclear\nweapons R\u0026D.\n\nGlenn Carroll is a former Machine Learning researcher with time in both academic and corporate environments. Post-retirement he has kept himself entertained with wide-ranging studies, electromagnetic experiments, and improving the shabby shop skills one might reasonably expect from an ML researcher.  Exploding wire experiments have been a favored pastime for close \nto a decade.\n\nGodzilla: History, Biology, and Behavior of Hyper-Evolved Theropod Kaijuwith Shyaporn Theerakulstit\nTsunami, earthquake, hurricane and typhoon all rolled in one, Godzilla, “King of the Monsters,” has both plagued and benefited humanity for over half a century. By examining the origins and zoology of this force of nature, people and nations will be better equipped to deal with the awesome destructive power of our radioactive visitor from the Cretaceous.\n\nShyaporn Theerakulstit is an actor, writer, YouTuber, cosplayer and general “nerd about town.” He has given talks at Nerd Nites in a half-dozen cities, as well as C2E2, TEDx and the Smithsonian. He has written and produced for Dark Horse Comics and is also the host of “Real/Fake Science” in NYC. His YouTube channel has been featured on Huffington Post and the Comedy Central blog (youtube.com/Shyaporn).\n\nEat. Sleep. Walk. Repeat with Dwight Asuncion\nFor over a millennium, pilgrims of all ages, genders, races, religions, and nations have walked the Way of St. James / Camino de Santiago (“the Camino”). The most common route is a 500 mile, 30 day journey starting in southern France and ending in northern Spain, in Santiago de Compostela. What is the Camino? Why has it appealed to religious and non-religious alike through the centuries? In recent years, why have so many people gone? (Since 2013, more than 200,000 pilgrims per year!). Why has it made such an imprint on the pilgrims who have walked it? (Paulo Coelho walked the Camino and named his protagonist in The Alchemist Santiago).\nCome learn about why you should consider doing the Camino from Dwight Asuncion, world traveler and travel writer. Dwight has traveled to all 7 continents and 25+ countries and considers his Camino experience the best / most important trip of his life\n\nNerd Nite SF is a monthly lecture-in-a-bar series where we invite interesting people - scientists, historians, game designers, mimes, etc. - to give short talks on their expertise to tipsy nerds. We strive to be playful, entertaining, sometimes a little inebriated or salacious, but always deeply educational. Join us!https://sf.nerdnite.com/"},{"date":"2022-05-26T20:00:00.000+00:00","img":"https://cdn.vor.us/event/468976/e4fd44abc1ec48eba3df068fc3c04639.image!png.790808.png.052622flyer2.png","title":"MICHAEL SEYER","url":"https://wl.seetickets.us/event/MICHAEL-SEYER/468976?afflky=RickshawStop","details":"Throwin' Bo's Presents\n\nMICHAEL SEYER\nWabie\nVida\n\n8pm\n$13 advance / $15 doors\nAll ages\n\n*All attendees must be fully vaccinated and be able to show proof (via card or QR code). Let's keep everyone safe and sound during this return to live music!*\n\nJapanese city pop, Brazilian boogie, and the songs his parents sang karaoke to, these influences help make Michael Seyer one of the most unique artists creating music in the indie-pop space today. On his new EP, Nostalgia, the 24-year-old songwriter, born in the Philippines but raised in Gardena, a suburb of Los Angeles, set out to create songs which were both fresh and timeless. https://www.michaelseyer.com/\n\nWABIE (pronounced Wah-Bee) hails from the small town of Palos Verdes, located in LA county. After his parents tried and failed to introduce him to every sport under the sun, Wabie found his true calling in playing the guitar. In highschool, he started a band with his friends that ended up selling out popular venues such as the school talent show, and the drummer’s garage. https://www.wabie.com/\n\nVida: https://www.instagram.com/trashmag1c"},{"date":"2022-05-27T21:00:00.000+00:00","img":"https://cdn.vor.us/event/455590/db74e0da6b5143a0b9f2052342a6a43f.image!jpeg.1171890.jpeg.052722bennettcoast.jpeg","title":"BENNETT COAST","url":"https://wl.seetickets.us/event/BENNETT-COAST/455590?afflky=RickshawStop","details":"Friday, May 27\nPopscene + Rickshaw Stop co-present\nBENNETT COAST \nplus DJ Chris Emond\n**DOORS ARE AT 9 pm NOW**\n$15\n18+\n\nThis is the make-up date for the Dec 23, 2021 show with Bennett Coast! All tickets purchased for the original date are still good for this one. If you'd like a refund, please let us know by April 23, 2022.\nBennett Coast: https://bennettcoast.com/"},{"date":"2022-05-28T21:00:00.000+00:00","img":"https://cdn.vor.us/event/481569/3f2f68f86c9f4d37bdd2868d73986e62.image!jpeg.133921.jpg.052822emonite.jpg","title":"EMO NITE at Rickshaw Stop presented by Emo Nite LA","url":"https://wl.seetickets.us/event/EMO-NITE-at-Rickshaw-Stop-presented-by-Emo-Nite-LA/481569?afflky=RickshawStop","details":"*All attendees must be fully vaccinated and be able to show proof (via card or QR code). Let's keep everyone safe and sound during this return to live music!*\n\nEMO NITE at Rickshaw Stop presented by Emo Nite LA\n9 pm\n$16 advance / $20 doors ($1 from every ticket sold will be donated to Living The Dream Foundation.)\n21+\nDon't feel embarrassed that you still love all the emo jams from late 90’s and early 2000’s, we’ll be your guide. Just live right now, be yourself, find a lover you don’t have to love, and join us for EMO NITE at RICKSHAW STOP presented by Emo Nite LA. http://emonite.com/"},{"date":"2022-06-01T19:00:00.000+00:00","img":"https://cdn.vor.us/event/477673/b5399204316b403ab243fd156d6b6aeb.image!jpeg.968800.jpg.060122flyer2.jpg","title":"THROWN-OUT BONES","url":"https://wl.seetickets.us/event/THROWN-OUT-BONES/477673?afflky=RickshawStop","details":"THROWN-OUT BONES\nBilly Wylder\nLOUIZA\n\n7pm\n$12 advance / $15 doors\nAll ages\n\n*All attendees must be fully vaccinated and be able to show proof (via card or QR code). Let's keep everyone safe and sound during this return to live music!*\n\nSan Francisco-based Thrown-Out Bones is a high-energy swanky rock group known for their experimental approach to genre and performance. With 10+ years of playing together, this power trio has developed a unique sound that blurs the lines between funk, jazz, classic rock, and even the occasional deep, contemplative jam. The shows themselves have gained a following for the creative ways the band breaks down the fourth wall with audience-inspired improvisation or even occasionally inviting fans onstage to sing lead.\n\nBilly Wylder’s music weaves together American folk and rock with sensibilities from the Sahara Desert, exploring new musical space akin to Devendra Banhart, Beck, and Tinariwen. Billy Wylder’s new recordings evoke musical evolutions built on grooves informed by ancient African rhythms, art-rock textures, expansive guitars, violins, synths, and drum machines. Salloway’s lyrics flow with inspiration from mythical songwriting hero Leonard Cohen, while threading together more abstract imagery reminiscent of Thom Yorke.\n\nCalifornia native LOUIZA is one of indie music’s best rising pop singer-songwriters. Acclaimed by top music tastemakers like Billboard, The Line of Best Fit, and The Deli SF, she’s at the forefront of music innovation and discovery. Her sound is best described as a charismatic blend of jazz and electro-pop with an underlining hint of alternative rock. Vocally, she’s inspired by legends like Joni Mitchell and Kurt Cobain, who she’s been highly compared to by fans and media. While she maintains a distinctly pop backbone, LOUIZA plays around with fresh concepts for each new project. Fans should check out her latest releases including her single “Anomie,” released on June 4th and her On, Off EP, out on all major streaming platforms as of June 26th 2021."},{"date":"2022-06-02T20:00:00.000+00:00","img":"https://cdn.vor.us/event/417774/f5cc01e02b164f4c949926b086502f66.image!jpeg.1181623.jpg.DarwinDeezadmatwsupport060222.jpg","title":"DARWIN DEEZ","url":"https://wl.seetickets.us/event/DARWIN-DEEZ/417774?afflky=RickshawStop","details":"DARWIN DEEZ\nw/ the Happys\n8 pm\n$18 adv / $20 at doors\nAll Ages\n\n*All attendees must be fully vaccinated and be able to show proof (via card or QR code). Let's keep everyone safe and sound during this return to live music!*\nDarwin Deez’s SF show originally scheduled for 5/11/20 and 4/4/21 has now been moved to June 2, 2022 due to COVID-19. Should you be unable to attend the new date or simply want a refund, please let us know by 7/1/21 and we'll take care of it.\nUpon its release in April 2010 DARWIN DEEZ’s wonderfully off-kilter debut album, which featured ‘hit’ singles ‘Constellations’ and “Radar Detector’, was met with universal praise from international radio and press. By turns joyous and heart tugging, winsome and wistful, glorious and gorgeous, buoyed aloft by Deez’s ear for a soaring chorus and a catchy tune, not to mention his knack for a killer couplet, Darwin self-proclaimed the album as being ‘happy songs for sad people’.\nNow, in order to celebrate the 11th anniversary of the release, Darwin and band are excited to be touring the album once more. The album will be performed in its entirety at each show, in addition to a number of select songs from Darwin’s other releases to-date.\nSingularly a brilliant, hilarious, complex, entertaining individual, Darwin Deez writes songs that will make you want to bust out your dancing shoes while also cutting to that raw, emotional nerve. Renowned for the most entertaining of live shows, with added choreographed dance routines, don’t miss your chance to witness a rare insight into everything a pop star should be, and yet so rarely is. https://www.youtube.com/channel/UC7Afs8hU0kRH-Xrq6SzQafw\nThe Happys: https://www.facebook.com/thehappysband\nThere's a 6 ticket limit per customer/account/household/email/credit card/address. Orders exceeding the 6 ticket limit subject to cancellation. Orders place for the sole purpose of resale will be cancelled."},{"date":"2022-06-03T21:00:00.000-07:00","img":"https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F157137139%2F4528219194%2F1%2Foriginal.20210928-034923?w=50\u0026auto=format%2Ccompress\u0026q=75\u0026sharp=10\u0026rect=0%2C171%2C1968%2C984\u0026s=df0f628608960e182749b7a810241c63","title":"KID FRANCESCOLI + Kids Return Tickets, Fri, Jun 3, 2022 at 9:00 PM | Eventbrite","url":"https://www.eventbrite.com/e/kid-francescoli-kids-return-tickets-170168910793","details":"Kid Francescoli Lovers\nPicture a tiny horseshoe-shaped port. A couple of boats rock gently at their moorings, as if waiting patiently for their next journey to sea. People of all genders, of all origins, sip their evening drinks under a hot sun that warms both bodies and hearts. It must be some faraway place, maybe a Greek island, but definitely not just minutes from the bustling center of France’s second largest city. Marseilles. Vallon des Auffes. Just a short distance from the Corniche Kennedy. This is where Kid Francescoli, a native of the area, has dreamed up Lovers, his fifth album.\nTwo years after the success of Play Me Again, which launched him on a whirlwind tour of the world’s stages, from Jakarta to Beirut, by way of London and of course Paris (where he played to a packed Trianon), Mathieu Hocine came back to Marseilles to regroup and come up with his next work, and it looks very much like the beginning of a new cycle.\nAfter devoting two albums (Play Me Again and With Julia) to the ups and downs of his relationship with the American singer Julia Minkin, and themes of love/separation/complicity, the Kid wants to surprise us and expand the scope of collaborations. He admits, with a laugh, \"We’re not going to talk about how we met in New York over the next five albums\". And this is the point where, single again, he happened to meet Samantha through a series of random Marseilles night scene connections. After a late-night scooter ride alongside the Mediterranean, they ended up at his studio and recorded the words of \"Eu Quero\" together. It would become an essential track, touched with the magic of the Franco-Brazilian singer’s fragile voice.\nIt’s the birth of a dreamy romance that also shines through \"These two\" and \"O Sol\". The beginning of a new era of radiant energy. And it has inspired Kid Francescoli to open the doors of his studio to other female voices that weave together the threads of Lovers, where love is obviously at the heart of the songs, rocking in a warm, swaying dance, where Mathieu seems serene and soothed. One thing is for sure: love is in the air!\nBut who are these new muses? The most famous one is Sarah Rebecca, previously heard with French 79 (\"Diamond Veins\"), who sets fire to \"Miss Mess\" and \"The Only One\". But there are also two surprises — you could even call them revelations. Nassee, the France-based, Madrid-born Italo-Moroccan, whose exotic warmth fits perfectly with the languor of Mathieu’s melodies on \"Alive\" and \"City Lights\". Finally,\nAlizée aka iOni, whose nervous sensuality bewitches on \"Cent Corps\" and the powerful electronica of \"So Over\".\nFour very different artists who sing in English, French, or Portuguese, but who nevertheless blend beautifully in the remarkable homogeneity of Lovers, creating a sentimental rollercoaster where life and love are one. Listening to this record is like feeling the sun’s heat on one’s skin…\nThe women may take center stage, but a man also plays a leading role. Simon Henner, aka French 79, studio companion, and ever the accomplice (we remember the Husbands project), adds his producer-arranger finishing touch to the end of the creative process, like those lunar harmonies on the sumptuous \"The Only One\". It establishes Mathieu in a new genre: pop with a touch of classical music.\nLovers owes a lot to the city where it was conceived, where a love story spurred a creative spark that was magnified by all of Mathieu’s journeys on tour. Because when he returns to Marseilles after these long trips, Mathieu feels both feet firmly on the ground — he is more confident in his choices. While an American mood had inspired him before, it’s this special Latin color that makes Lovers glow. This is the radiant album of a fulfilled man. Well, almost — he would truly be fulfilled if his favorite football club (which inspired his artistic namesake), Olympique de Marseille, recovered its past glory. But with such a beautiful soundtrack, anything is possible"},{"date":"2022-06-04T20:00:00.000-07:00","img":"https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F259109889%2F4528219194%2F1%2Foriginal.20220401-213916?w=50\u0026auto=format%2Ccompress\u0026q=75\u0026sharp=10\u0026rect=0%2C187%2C300%2C150\u0026s=382b3de95b07a1101366bdd3dd7c86f9","title":"AMBAR LUCID Tickets, Sat, Jun 4, 2022 at 8:00 PM | Eventbrite","url":"https://www.eventbrite.com/e/ambar-lucid-tickets-312045976917","details":"Born to a Dominican mother and Mexican father in New Jersey, Ambar Lucid is a 21 year old singer/songwriter leading the way for the new generation of Indie pop/Alternative Latinx music.\nInspired by a transformative trip to the desert, Ambar’s latest kaleidoscopic single, “Get Lost in the Music,” continues her journey into that prismatic world. With more new music on the way, including Ambar is on a mission to touch as many souls as she can through her inimitable sonic storytelling. Above all, she just wants to manifest a little radical self-love and empowerment with her music: “I'm healing our generational trauma.”"},{"date":"2022-06-10T21:00:00.000+00:00","img":"https://cdn.vor.us/event/480663/c5a7466539214ee1a56545c6e7d79f4d.image!jpeg.307814.jpg.061022flyerwfulllineup.jpg","title":"SACRED SKIN","url":"https://wl.seetickets.us/event/SACRED-SKIN/480663?afflky=RickshawStop","details":"Popscene presents\nSACRED SKIN\nAurat\nFearing\nFeaturing DJ Omar\n\n9pm\n$16 advance / $18 doors\n18+\n\n*All attendees must be fully vaccinated and be able to show proof (via card or QR code). Let's keep everyone safe and sound during this return to live music!*\n\nSacred Skin: https://sacredskin.bandcamp.com/\n\nAurat is a music group based in L.A. Embracing the Urdu language. With lead vocalist Azeka who is a Pakistani-American and Gil on bass/production. https://aurat.bandcamp.com\n\nFearing. https://fearing.bandcamp.com"},{"date":"2022-06-11T20:30:00.000+00:00","img":"https://cdn.vor.us/event/478655/aac863ce33c74e2e94bac6825703fe61.image!png.2330144.png.FLYER.png","title":"EURO NIGHT PARTY","url":"https://wl.seetickets.us/event/EURO-NIGHT-PARTY/478655?afflky=RickshawStop","details":"EURO NIGHT PARTY\nwith live sets by\nSonamó\nDos Bandoleros\nRue '66\nplus DJ Nino MSK\n\n8:30 pm doors\nEARLY BIRD $15 (ends May 11) / advance $20 / Doors $25\nAll Ages\n*All attendees must be fully vaccinated and be able to show proof. Let's keep everyone safe and sound during this return to live music!*\nEuropeans and Europhiles! Join us for this one of a kind event featuring three live bands from Europe: Sonamó (ITALY), Rue'66 (FRANCE), Dos Bandoleros (SPAIN) and the eclectic DJ Nino MSK (bff.fm).\n\nSonamó (Italy) \nif Sting and Jamiroquai had a lovechild they would name it Sonamó. With a dynamic, passionate blend of melodic lines shot through with hefty doses of R\u0026B, funk, and acid jazz, Sonamó music is both danceable yet introspective, at once familiar yet exotic, intense yet energetic, romantic and yet somehow carefree. The high energy and intensity of Sonamó is well expressed in their memorable live performances.\n\nRue '66 (France)\nUnique, obscure, and truly authentic French yéyé music. Drawing inspiration from Serge Gainsbourg, France Gall, Jacques Dutronc, Françoise Hardy, Gillian Hills, Michel Polnareff and groups like The Zombies, Pussycat, The Searchers, etc., Rue '66 is sure to delight.\n\nDos Bandoleros (Spain) \nDos Bandoleros is the exciting project of Raúl Vargas from Makrú and Alberto Gutierrez from La Mandanga, two of the most creatives minds in the Bay Area. Both native from Madrid (Spain) and two regulars in the Latin music Bay’s scene. \n\nDJ Nino MSK (bff.fm)\nNino Msk, the Italian-born, SF-based producer behind Italic Disco is known for is work in the city with community and non-profit radio. He has created 200+ episodes of his weekly podcast, Espresso Sesh on BFF.fm (SFWeekly Best Radio Station 2013-19). Italic Disco was conceived as an outlet for Nino’s uptempo, electronic-driven, disco-inspired productions, in which he mostly uses analog drum machines, synthesizers, and samplers. Italic Disco has performed at Burning Man events in Black Rock City and SF, including Pre-compression and Decompression."},{"date":"2022-06-14T20:00:00.000-07:00","img":"https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F253099799%2F4528219194%2F1%2Foriginal.20220323-154947?w=50\u0026auto=format%2Ccompress\u0026q=75\u0026sharp=10\u0026rect=0%2C1084%2C3000%2C1500\u0026s=b71830f77358ea0cd2ac8d523e45671e","title":"RONE Tickets, Tue, Jun 14, 2022 at 8:00 PM | Eventbrite","url":"https://www.eventbrite.com/e/rone-tickets-259523851827","details":"RONE\nIn a 12 year career, Erwan Castex aka RONE has established himself as a major talent on the French electronic music scene. With six studio albums on the Parisian label InFiné and numerous collaborations (Saul Williams, The National, John Stanier, Kazu Makino, Georgia, Jean-Michel Jarre, Jehnny Beth, Etienne Daho, Yael Naim, film director Michel Gondry, or science fiction writer Alain Damasio...), RONE has been able to constantly step out of his comfort zone by going beyond the boundaries of electronic music. At the beginning of 2017, he filled the Philharmonie de Paris for a unique and singular creation, which made him win the Prix des Indés (Indie Award) in the Live category. At the end of 2018, during the web \u0026 television series “Variations“, RONE surprised the audience by offering a rereading of works by the great British composer Benjamin Britten, accompanied on stage by the Maîtrise de Radio France and its choir director Sofi Jeannin. In 2019, RONE records “Motion“, a 12-minute electro-classical piece in which the dreamy arpeggios of his machines blend perfectly with the sound of the instruments of the 85 classical musicians of the orchestra Les Siècles conducted by François- Xavier Roth. Invited by the renowned Théâtre du Châtelet in Paris for a carte blanche in the spring of 2020, RONE and the collective (LA)HORDE present the music and dance piece “Room With A View“ with 20 dancers from the Ballet National de Marseille. This was followed by the release of “Room With A View“, his fifth entirely instrumental album. During the long weeks of lockdown and at the time of social distancing, RONE decides to launch the “Rone \u0026 Friends“ project, by inviting 14 artist friends to put their voices on his compositions. One month before the release of the album, RONE won the César for the best soundtrack for the film “La Nuit Venue“, which marked his entry into cinema. More recently, his soundtrack for Jacques Audiard’s film “Les Olympiades“ was selected for the César 2022. Follow Rone Website / Facebook / Instagram / Twitter / YouTube / Spotify / Apple"},{"date":"2022-06-15T19:00:00.000+00:00","img":"https://cdn.vor.us/event/484413/544bfe12277343d8aabe9ef700834d01.image!png.613953.png.061522nerds.png","title":"Nerd Nite SF #126: Hey Girl! Bingo \u0026 DNA Sequencing!","url":"https://wl.seetickets.us/event/Nerd-Nite-SF-126-Hey-Girl-Bingo-and-DNA-Sequencing/484413?afflky=RickshawStop","details":"Nerd Nite SF #126: Hey Girl! Bingo \u0026 DNA Sequencing!\n7 pm doors\n$15 adv / $20 at the doors\nAll ages\n\n*All attendees must be fully vaccinated and be able to show proof (via card, phone, or QR code). Let's keep everyone safe and sound during this return to live entertainment!*\nJoin us for Nerd Nite SF, the Pride month party edition!\n\nWe’re very excited to announce that we’ll be partnering with the bearded bingo babe herself, Shelix, for Hey Girl! Bingo before the talks begin. Come early to kick off the evening with a drink and a bingo card! Nerdy prizes and drink tickets are up for grabs!\n\nThe evening will continue with another kind of helix, the DNA kind! Other talk topics TBA, but word on the street is that they pertain to private investigation and San Francisco drag history. Stay tuned, but in the meantime, the early nerd gets the worm! Or, the free bingo square.\n\nHow to Sequence a Genome with Jess McLaughlin\n\nEver wonder exactly how you get DNA from, say, a fruit fly, a lizard, your dog, or even yourself, and actually turn it into something we can read? Would you have guessed it includes weird chemistry, magnets, fluorescent colors, and some very fancy dish soap? Jess McLaughlin, an evolutionary biologist, will explain how DNA sequencing is basically tech-wizardry, turning molecules in your cells into light and then into computer bytes.\n\nJess is a postdoc at UC Berkeley, where they study the evolution of anole lizards in the Caribbean. They also research how new species of birds develop, and they have a passion for telling folks about just how weird biology can be.\n\nBe there, be square, and win a bingo prize!\n\n*\nNerd Nite SF is a monthly lecture-in-a-bar series where we invite interesting people - scientists, historians, game designers, mimes, etc. - to give short talks on their expertise to tipsy nerds. We strive to be playful, entertaining, sometimes a little inebriated or salacious, but always deeply educational. Join us!https://sf.nerdnite.com/"},{"date":"2022-06-16T20:00:00.000+00:00","img":"https://cdn.vor.us/event/464142/3819efe1c5714ad69cb1dc62729544e1.image!jpeg.5735477.jpg.JORDANAadmatwlogo061622.jpg","title":"JORDANA","url":"https://wl.seetickets.us/event/JORDANA/464142?afflky=RickshawStop","details":"Rickshaw Stop + Popscene co-present\n\nJORDANA\nHarry Teardrop\n8pm\n$15\nAll ages\n\n*All attendees must be fully vaccinated and be able to show proof (via card or QR code). Let's keep everyone safe and sound during this return to live music!*\n\nIt’s been quite the year for Jordana Nye. In March of 2020, Grand Jury reissued her sleeper debut Classical Notions of Happiness. Then the world abruptly fell apart. Using the time she would have spent touring in support of the album (seriously, there were 60 dates!), she quickly turned around a batch of new material that radically expanded on the homespun bedroom pop of her debut. The result is Something To Say To You, a monumental leap for the 20-year-old songwriter. The album, a compilation of two EPs she released in the second half of 2020, landed her on Best New Artist lists at Stereogum, Paste, NME, Pigeons \u0026 Planes, and more. Seemingly never content to slow down, Jordana recently relocated from her Kansas bedroom to a New York City apartment where she's hard at work on her third full length since 2019. https://open.spotify.com/artist/5Bw9kFNhy019e4IBCJZlzw?si=ual_Tz3ySa2oF90dwKw5Ww\n\nLike a flower blooming out of cracks in the pavement, twenty one year-old Harry Teardrop is a rising star. From his bedroom in New York City, Teardrop's self-produced spin on rock music marries dirty guitar riffs with dance \u0026 rap-inspired drums and sticky hooks, crafting a whole band on his laptop. His musical influences range from bands like Blur, The Strokes, and Blink-182 to jazz icons like Bill Evans, Nat King Cole, and Billie Holiday. https://harryteardrop.com/"},{"date":"2022-06-17T20:00:00.000+00:00","img":"https://cdn.vor.us/event/471505/04ea1a2c88ec4221b4d38bb64af5e67d.image!jpeg.2682506.JPG.061722ceramicflyer.JPG","title":"COOL GHOULS","url":"https://wl.seetickets.us/event/COOL-GHOULS/471505?afflky=RickshawStop","details":"COOL GHOULS\nChime School\nThe Smashing Times\nAlmond Joy\n\n8pm\n$15 advance / $18 doors\nAll ages\n\n*All attendees must be fully vaccinated and be able to show proof (via card or QR code). Let's keep everyone safe and sound during this return to live music!*\n\n\"Come witness rock'n'roll history! San Francisco's very own Cool Ghouls live in concert for the first time since 2019! They're a fantastic unit for playing rock'n'roll! Not to be missed! Truly a gem!\" https://coolghouls420.bandcamp.com\nChime School is the project of San Francisco musician Andy Pastalaniec. Endlessly charmed by 80s indie and its 60s forbearers (and any record with a 12-string guitar), Andy cut his teeth as a drummer with SLR labelmate Odd Hope in their early group Pink Films; later with shoegazers Cruel Summer, and currently with indiepop outfit Seablite. https://chimeschool.bandcamp.com/\nThe Smashing Times is Baltimore's finest jangle: \"This is perfectly obtuse late 80s jangle in the weirdest of traditions.... the finest examples of The Television Personalities perfect ‘warble, wistfully in the dark’ sound, among washed out strains of the tinny, stuttering jangled riffs, that was so omnipotent in the jangle sub-culture of yesteryear.\" -- janglepophub https://thesmashingtimes.bandcamp.com/\nAlmond Joy makes candy soul/rock: https://www.youtube.com/watch?v=QbuGBKKjQUo"}]