[{"date":"2022-05-06T21:00:00.000+00:00","img":"https://cdn.vor.us/event/477242/c61becee0bde4546a71bf16230491b7e.image!jpeg.113820.jpg.BootieMashupSF_05-2022_poster.jpg","title":"BOOTIE MASHUP: Doja vs. Drake","url":"https://wl.seetickets.us/event/BOOTIE-MASHUP-Doja-vs-Drake/477242?afflky=RickshawStop","details":"BOOTIE MASHUP: Doja vs. Drake\nwith Mashup DJs DJ Tyme, Airsun, Jupiter Gatlingplus burlesque by Hubba Hubba Revue\n\n9 pm doors\n$15 advance / $20 doors (+ $5 if under 21)\n18+\n\n*All attendees must be fully vaccinated and be able to show proof (via card or QR code). Let's keep everyone safe and sound during this return to live music!*\n\nTonight we celebrate all things Doja Cat and Drake — mashed up, remixed, and reworked with anybody and everybody! At Bootie Mashup, we love to put together collabs that may not have happened in real life yet … but could and should! These two pop/rap icons will keep you on the dance floor all night!\n\n• Dress up to show off your lewks and moves for our 12:30 stage showcase!\n• Go-go dancing \u0026 LED hula hooping by Aryana \u0026 Helena\n• Doja Cat \u0026 Drake tribute burlesque \u0026 drag performances \n• Video projections \u0026 decorations\n\nMashup DJs:\nDJ Tyme\nAirsun\nJupiter Gatling\n\n11:11 Show: Doja Cat \u0026 Drake burlesque \u0026 drag by Hubba Hubba Revue\n\nShowcasing the best mashups in the world ever, Bootie Mashup prides itself on throwing genre-fluid dance parties, shamelessly combining pop songs both throwback and current. With our fun, creative themes, our diverse team of pop pirates have won numerous nightlife awards in California and beyond. BootieMashup.com/sf"},{"date":"2022-05-07T20:00:00.000+00:00","img":"https://cdn.vor.us/event/454057/b3273d579b914784ad281e27aed7abdd.image!jpeg.5577482.jpg.ADULT.Admat2050722.jpg","title":"ADULT.","url":"https://wl.seetickets.us/event/ADULT/454057?afflky=RickshawStop","details":"Popscene + Rickshaw Stop co-present\n\nADULT.\nKontravoid\nSpike Hellis\n+ Popscene DJs\n\n8pm\n$15 advance / $20 doors\nAll ages\n\n*All attendees must be fully vaccinated and be able to show proof (via card or QR code). Let's keep everyone safe and sound during this return to live music!*\n\nWith over 23 years working and a sprawling discography to show for that labor, Adam Lee Miller and Nicola Kuperus have spent their entire career as ADULT. obscuring any defined genre orstyle, writing and recording albums as art for life’s sake. On their latest album, the group are back at it with some discordant, doomdance sludge to mark their 9th studio album Becoming Undone. Written between November 2020 and April 2021, the album might be the bands most non-conformant yet. Sure there’s plenty of dance bangers, but ultimately the album is riddled with impermanence, loss and looping dissatisfactions. https://www.adultperiod.com/\nKontravoid: http://kontravoid.com/\nSpike Hellis is the LA-based brainchild of Cortland Gibson and Lainey, circa 10/31/2019. https://spikehellis.com/"},{"date":"2022-05-09T20:00:00.000+00:00","img":"https://cdn.vor.us/event/445538/4e133717ceb24213af4a6519f3e74891.image!jpeg.6203615.jpg.Toraadmat2wsupport050922.jpg","title":"TORA","url":"https://wl.seetickets.us/event/TORA/445538?afflky=RickshawStop","details":"Rickshaw Stop + Popscene co-present\n\nTORA\nWaterstrider\nplus Popscene DJs\n\n8pm doors\n\n$17 advance\n\nAll Ages\n\n\n*All attendees must be fully vaccinated and be able to show proof (via card or QR code). Let's keep everyone safe and sound during this return to live music!*\n\nThe adage that music is universal has never been truer in recent times. In times of darkness and disillusionment, music exists as an avenue of escape, healing and expression. And for the musicians making it, the opportunity to create is one that sits as both a treasure and responsibility. For Australian electronic act Tora, it’s a mantle they picked up confidently in 2020 as they began to create their third studio record, A Force Majeure. Eleven songs that capture the essence of a band who have found themselves a world away from the normalcy they were accustomed to. Eleven songs that shine bright with refreshed perspective and a deepened understanding of the group’s artistry and identity. http://www.toramusic.com.au/\nWaterstrider - captivating because of its apparent defiance of our world’s physical laws - is a fitting stage name for Nate Salman. Salman creates music as therapeutic self-exploration, seeking to find true self in spite of our world’s supposed rules and rigid constructs. On this new collection of songs, the Sublimate EP, Waterstrider turns loneliness, heartbreak, hope, and rebirth into thick and often psychedelic layers of sound. Inspired by musical auteurs like Björk, David Bowie, Kate Bush, Bat for Lashes, and Moses Sumney, Waterstrider moves fluidly through genres to find lush sonic landscapes. https://waterstridermusic.com/\nThere's a 6 ticket limit per customer/account/household/email/credit card/address. Orders exceeding the 6 ticket limit subject to cancellation. Orders place for the sole purpose of resale will be cancelled."},{"date":"2022-05-10T19:00:00.000-07:00","img":"https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F207287339%2F4528219194%2F1%2Foriginal.20220104-165928?w=50\u0026auto=format%2Ccompress\u0026q=75\u0026sharp=10\u0026rect=0%2C34%2C720%2C360\u0026s=8fa3ac2451416263d8ec1f852a9a0716","title":"Anson Seabra Presents: The Wonderland Tour w/ Em Beihold Tickets, Tue, May 10, 2022 at 7:00 PM | Eventbrite","url":"https://www.eventbrite.com/e/anson-seabra-presents-the-wonderland-tour-w-em-beihold-tickets-238457200907","details":"Like youthful memories and childhood fairytales, we carry music with us everywhere we go. It pipes out of our phones, computers, and the world at large. Its embrace reminds us of our potential. Anson Seabra extends this embrace in his music. The warmth of his voice comforts as the stark production uplifts. Attracting acclaim from OnesToWatch, American Songwriter, and more in addition to independently amassing nearly half-a-billion cumulative streams and views, the Kansas City-based singer, songwriter, producer, and multi-instrumentalist intimately opens up and universally connects on his 2021 EP.\n\"When I'm creating, I go off into my own head, write whatever I see, and try to translate it for everyone to understand in songs,\" he says. \"I know most people don't really feel seen for who they are. I hope my music can help them feel seen and, ultimately, like they're not alone.\"\nGrowing up in Blue Springs, MO, he unlocked the power of the piano first with classical training from first grade through eighth grade. Along the way, he also picked up the alto saxophone and joined the jazz band before landing a spot in his high school's marching band. Simultaneously, he honed his voice with prominent roles in school musicals such as Willy Wonka and Oklahoma. He also listened to a wide swath of artists, ranging from Regina Spektor, Mika, and Ben Folds to The All-American Rejects, Fall Out Boy, and Boys Like Girls. Majoring in Computer Science at Truman State University, he learned how to create apps and program, taking an internship at Boeing.\nHe started to produce on his MacBook, remixing tracks like Conor Maynard's cover of the Mike Posner hit \"I Took A Pill In Ibiza\" with a touch of tropical house. The latter posted up over 5 million streams on Soundcloud.\nWhile honing his craft and taking songwriting classes at Berklee College of Music online, he moved to Virginia for a job as a software engineer at Appian, but he needed more.\n\"I wasn't really having a great time,\" he admits. \"My life wasn't working well at the moment. I was pretty depressed and had really bad anxiety for a multitude of reasons. I had a quarter-life crisis, so I'd write and post songs in my free time.\"\n\"Welcome To Wonderland\" granted the escape he craved. Originally released in 2018, his debut single quietly gained momentum over the next two years as listeners latched on to the otherworldly whimsy of the lyrics and the nuanced melodies of his delivery. Galvanized by a major reaction on Tik Tok, it eventually eclipsed 85 million Spotify streams. The follow-up single \"Robin Hood\" eventually hit the same mark with 71 million Spotify streams as fans fell under Anson's spell. Highlighted by \"That's Us\" [60 million Spotify streams], \"Trying My Best\" [65 million Spotify streams], and \"Broken\" [47 million Spotify streams], 2020's Songs I Wrote In My Bedroom fortified this connection. He garnered support from all streaming platforms while OnesToWatch noted, \"Seabra melds soft, sweet melodies with powerful yet controlled vocals, birthing a sound that we can only describe as the lovechild of Ruth B's 'Lost Boy' and Lewis Capaldi's voice.\" Building up an audience of over 709K YouTube subscribers, he continued writing, recording, and producing everything out of his room at a prolific pace.\nClosing out 2020, the single \"Walked Through Hell\" marked a moment of progression. Produced by Sam de Jong [Lennon Stella, Noah Kahan] in Los Angeles, delicate acoustic guitar hugs a faint beat as his voice cackles with longing on the hook. He confesses, \"I would've walked through hell to find another way...I would've crossed the stars to keep you in my life, but now I'm falling hard without you here tonight.\"\nHe teased the initial idea on Tik Tok, building anticipation to the tune of 4 million views before even completing the full version.\nAnson recently made his television debut on The Ellen DeGeneres Show with a stripped-down performance of an alternative take of his hit single \"Walked Through Hell.\" The original version of the track has amassed 83 million global streams to date and was featured in Grey's Anatomy and took the Top TV Song for the week of March 14th. In addition to this, \"Walked Through Hell\" was No. 1 on Billboard's Top TV Songs chart. Anson has been featured in People Magazine's prestigious 'Artists To Watch,' list. Atwood Magazine examined that \"Seabra's short career has been nothing short of breathtaking in its steep rise and continued expansion,\" and OnesToWatch observed, \"In each of his songs, Seabra melds soft, sweet melodies with powerful yet controlled vocals.\"\nAnson continues to grow his fanbase with an impressive 4.9M listeners on Spotify and this year has proven to be a year like no other for Anson, who is expected to top off with the release of his 2021 EP.\n\"It's about feeling like you did everything you could for someone who just took you for granted,\" he explains. \"Even though you did everything you thought this person wanted, you still end up alone. It's sad, desperate, and emotional. There's something really beautiful about a sad song.\"\nThrough his music, Anson will be there whenever you need him.\n\"I hope what I'm doing makes you feel good,\" he leaves off. \"I'm just a guy who's trying to be honest with himself and wants to help other people. That's why I make music.\"\nBOILER\nKansas City-based singer, songwriter, producer, and multi-instrumentalist Anson Seabra unlocks an escape in his music. The warmth of his voice comforts as the stark production uplifts. Within the last year, Anson has generated 250M streams on Spotify independently via TuneCore. His 2020 single, \"Walked Through Hell\" charted in Hot AC Radio's Top 30 and Top 5 Most Added with 49M streams on Spotify. Along with this, his release \"Magazines\" was featured on Spotify's New Music Friday, New Music Daily, and Fresh \u0026 Chill playlists. Anson was featured on Ellen for his first TV performance debut of his latest single \"Dominoes.\" His music also appears on the Chill Hits, Everyday Favorites, Soft 10's best-of-the-decade playlist, sad hour, \"Life Sucks,\" Chill Pop, Next Gen Singer-Songwriter, and Today's Singer-Songwriters playlists.\nFollowing college and a short-lived stint behind a desk in corporate America, \"Welcome To Wonderland\" granted the escape he craved. Originally released in 2018, his debut single quietly gained momentum over the next two years as listeners latched on to the otherworldly whimsy of the lyrics and the nuanced melodies of his delivery. Galvanized by a major reaction on Tik Tok, it eventually eclipsed 85 million Spotify streams. The follow-up single \"Robin Hood\" eventually hit the same mark with 71 million Spotify streams as fans fell under Anson's spell. Highlighted by \"That's Us\" [60 million Spotify streams], \"Trying My Best\" [65 million Spotify streams], and \"Broken\" [47 million Spotify streams], 2020's Songs I Wrote In My Bedroom fortified this connection. He garnered support from all streaming platforms while OnesToWatch noted, \"Seabra melds soft, sweet melodies with powerful yet controlled vocals, birthing a sound that we can only describe as the lovechild of Ruth B's 'Lost Boy' and Lewis Capaldi's voice.\" Building up an audience of over 709K YouTube subscribers, he continued writing, recording, and producing everything out of his room at a prolific pace."},{"date":"2022-05-11T20:00:00.000+00:00","img":"https://cdn.vor.us/event/426019/45491c2bca414e2fb32700e65c47781e.image!jpeg.719177.jpg.french79admat051122.jpg","title":"FRENCH 79 - Joshua Tour - sold out!","url":"https://wl.seetickets.us/event/FRENCH-79-Joshua-Tour-sold-out/426019?afflky=RickshawStop","details":"Rickshaw Stop + Popscene co-present\nFRENCH 79\nwith DJ Aaron Axelsen\n8 pm\n$15 adv / $18 doors\nAll Ages\n*All attendees must be fully vaccinated and be able to show proof (via card or QR code). Let's keep everyone safe and sound during this return to live music!*\nTHIS IS THE MAKE UP SHOW FOR THE POSTPONED SHOWS ON MAY 7, 2020, AND JAN 21 AND SEP 18, 2021. TIX FOR THOSE DATES ARE GOOD FOR THIS DATE AS WELL.  IF YOU WANT A REFUND PLEASE LET US KNOW BY DEC 1, 2021.\nFrench 79 says:\n“Dear friends, the current public health situation between Europe and North America does not allow us to obtain the necessary authorizations to carry out this tour. It’s unfortunate, but we’ll be on the road very soon in May 2022. It will be grandiose and we’re hopeful to reunite with you very soon. Take care.”\nIn 2014, French79 appeared on a music scene limited to the French territory, or so he thought. Within just a few months it quickly became an international hub that elevated the artist's career. The single Between the Buttons, a contemplative, synth heavy gem enhanced by a beautiful arpeggiator, excepted from his first EP Angel, instantly placed him on the list of today's most important producers. This first successful attempt enriched the tracklist of the album Olympic, alongside another pop gem, \"Diamond Veins,\" a duet with North American diva Sarah Rebecca. The album was quickly met with a worldwide audience, paving the way for Simon Henner to acquire over 150 concerts around the Globe. This led him to becoming an ambassador for Marseille's electronic scene -- a territory he had already stepped into with the various projects of Husbands, Nasser and Kid Francescoli.\nJoshua is the follow-up album to Olympic. While the second album, typically, often shows what critics call \"maturity,\" here Simon has released instead an album of adolescence. The musician opened up his own memory box to contemplate his childhood souvenirs, and dust them off of all nostalgia. At that time, he would VHS-record movies from TV and tape record soundtracks directly from the TV speaker, so he could listen to them in his bedroom. This is when he \"discovered the power of music, the way it makes you enter another world, far from reality. I wanted to pay tribute to the era I shaped myself in -- the '80s and '90s.\" Tangerine Dream, Kraftwerk and Soft Machine. Logically, these are the sonic signatures that seem to haunt the album. The timeless pioneers of synthetic music constitute the sound references, without any established chronological timeline, that blend with the atmosphere of typically \"French Touch\" movie soundtracks -- long before the term was even coined. https://soundcloud.com/french79music"}]