[{"date":"2022-06-01T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/Oakadelic_81391653234963.jpeg","title":"OAKADELIC WEDNESDAYS: LIVE FUNK SOUL \u0026 R\u0026B IN THE CRYSTAL CAVERN","url":"https://starlinesocialclub.com/event/oakadelic-wednesdays-live-funk-soul-rb-in-the-crystal-cavern-12/","details":"Oakadelic Wednesdays\nWednesday nights in the Crystal Cavern\n10pm // No Cover\n—–\nOakadelic Wednesdays is a weekly live funk, soul, R\u0026B and hip hop jam session at the center of Oakland’s live music scene. As a staple of the east bay, it has brought community together for more than 10 years. With a rotating cast of players each week in the houseband, and with a jam session to follow, it keeps people dancing and communing every time."},{"date":"2022-06-02T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/Oakland_80271652314590.jpeg","title":"OAKLAND ART LIBRARY: JUNE EVENT NIGHT","url":"https://starlinesocialclub.com/event/oakland-art-library-june-event-night/","details":"Oakland Art Library: June Event Night\nThursday June 2nd 2022 6-11pm\nFREE – SLIDE THROUGH"},{"date":"2022-06-03T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/Queens_74211649851612.jpeg","title":"QUEENS OF THE UNDERGROUND VOL 3 FEAT. ALLY COCAINE \u0026 MORE","url":"https://starlinesocialclub.com/event/queens-of-the-underground-vol-3-feat-ally-cocaine-more/","details":"Starline Social Club Presents:\nQUEENS OF THE UNDERGROUND VOL 3\nstarring\nALLY COCAINE\nDAYDAY ROCKSTARTHUG\nVERSOUL\nTELICE (of PXSSYPOWERDANCE CREW)\nDJ STONEY CREATION\nHosted by SNOWY GEE\nFriday June 3 2022 – Doors @ 8pm\n$15 advance // $20 day of show\n18+\n——–\nAbout Queens of the Underground: \nQueens of the Underground is a quarterly all women, Hip Hop, concert series. Our mission is to provide equitable spaces for women-identified artists to shine in the male-dominated culture of Hip Hop. We promote the diversity of Women’s experiences, in contrast to the limited hyper-sexualized narrative that permeates the mainstream.\n\n\nAbout the Event: \nWe are representing Oakland for this upcoming June Showcase, for our special “Queens of the Underground: The Town Edition”.  We are excited to announce our Oakland native  headliner, Ally Cocaine. Supporting musical acts include DayDay Rockstarthug, Keidra, and Versoul, with turf dance performance by Telice of Pxssy Power Dance crew. The show will be hosted by Snowy Gee  with sounds by  DJ Stoney Creation. There will also be women-owned businesses vending throughout the night and a dance party at the end of the show.  For more information check out our website www.queensoftheunderground.com and follow us on Instagram @QueensOfTheUndergroundShow"},{"date":"2022-06-04T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/WOOSUNG_72981649059649.jpeg","title":"WOOSUNG PRESENTS: MOTH EP SHOWCASE","url":"https://starlinesocialclub.com/event/woosung-presents-moth-ep-showcase/","details":"Starline Social Club Presents\nWOOSUNG\nMoth EP Showcase\n**NOTE** – VIP Ticket holders can bring gifts to the show but sending to the address below would be preferred:\nWoo Sung Kim\n2106 W. Artesia Blvd #1008\nTorrance, CA 90504\nWoosung will not be able to accept gifts at the show. Thanks for the support!\nSat June 4, 2022 – Doors @ 7pm\n$25 adv // $30 dos // $200 meet \u0026 greet\nAll Ages\n——\nWOOSUNG is a Korean-American musician, singer, songwriter, and composer, best known for being the vocalist and electric guitarist of South Korean band The Rose. Debuting in 2017 with the soft-rock hit “Sorry,” The Rose was named one of the “New K-Pop Artists to Watch” by Billboard. They subsequently broke into the top 10 of Billboard’s “Next Big Sound,” “World Digital Song Sales” and “World Albums” charts with the EPs, Dawn and Void, the latter of which also hit #1 on the U.S. iTunes’ K-Pop Albums chart, solidifying the band’s dominance as one of the fastest accelerating artists across the internet. \nAs the frontman of The Rose, Woosung made his solo debut in 2019 with the EP, Wolf, and its title single, “Face,” quickly racking up nearly 20 million views on YouTube. In 2020, Woosung lent his vocals to the original soundtrack of award-winning K-drama series, Itaewon Class. A multifaceted performer, Woosung released his debut feature-length album, Genre, in December of 2021 and has an upcoming EP, Moth, set to be released this spring via Transparent Arts. He is currently on the North American tour as the opening act for the legendary South Korean hip hop group Epik High.\nHe currently resides in Los Angeles. \nInstagram: @iwoosung – 1.2M "},{"date":"2022-06-05T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/The_79451650891362.jpeg","title":"THE 5TH BEAT SESSIONS: LIVE JAZZ IN THE CRYSTAL CAVERN","url":"https://starlinesocialclub.com/event/the-5th-beat-sessions-live-jazz-in-the-crystal-cavern-6/","details":"Starline Social Club Presents:\nThe 5th Beat Sessions:\nLive Jazz in the Crystal Cavern\nHosted by Mike Quigg\nEvery Sunday 7-9pm – Doors @ 6pm\nNo Cover – 21+"}]