[{"date":"2022-06-01T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/Oakadelic_81391653234963.jpeg","title":"OAKADELIC WEDNESDAYS: LIVE FUNK SOUL \u0026 R\u0026B IN THE CRYSTAL CAVERN","url":"https://starlinesocialclub.com/event/oakadelic-wednesdays-live-funk-soul-rb-in-the-crystal-cavern-12/","details":"Oakadelic Wednesdays\nWednesday nights in the Crystal Cavern\n10pm // No Cover\n—–\nOakadelic Wednesdays is a weekly live funk, soul, R\u0026B and hip hop jam session at the center of Oakland’s live music scene. As a staple of the east bay, it has brought community together for more than 10 years. With a rotating cast of players each week in the houseband, and with a jam session to follow, it keeps people dancing and communing every time."},{"date":"2022-06-02T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/Oakland_80271652314590.jpeg","title":"OAKLAND ART LIBRARY: JUNE EVENT NIGHT","url":"https://starlinesocialclub.com/event/oakland-art-library-june-event-night/","details":"Oakland Art Library: June Event Night\nThursday June 2nd 2022 6-11pm\nFREE – SLIDE THROUGH"},{"date":"2022-06-03T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/Queens_74211649851612.jpeg","title":"QUEENS OF THE UNDERGROUND VOL 3 FEAT. ALLY COCAINE \u0026 MORE","url":"https://starlinesocialclub.com/event/queens-of-the-underground-vol-3-feat-ally-cocaine-more/","details":"Starline Social Club Presents:\nQUEENS OF THE UNDERGROUND VOL 3\nstarring\nALLY COCAINE\nDAYDAY ROCKSTARTHUG\nVERSOUL\nTELICE (of PXSSYPOWERDANCE CREW)\nDJ STONEY CREATION\nHosted by SNOWY GEE\nFriday June 3 2022 – Doors @ 8pm\n$15 advance // $20 day of show\n18+\n——–\nAbout Queens of the Underground: \nQueens of the Underground is a quarterly all women, Hip Hop, concert series. Our mission is to provide equitable spaces for women-identified artists to shine in the male-dominated culture of Hip Hop. We promote the diversity of Women’s experiences, in contrast to the limited hyper-sexualized narrative that permeates the mainstream.\n\n\nAbout the Event: \nWe are representing Oakland for this upcoming June Showcase, for our special “Queens of the Underground: The Town Edition”.  We are excited to announce our Oakland native  headliner, Ally Cocaine. Supporting musical acts include DayDay Rockstarthug, Keidra, and Versoul, with turf dance performance by Telice of Pxssy Power Dance crew. The show will be hosted by Snowy Gee  with sounds by  DJ Stoney Creation. There will also be women-owned businesses vending throughout the night and a dance party at the end of the show.  For more information check out our website www.queensoftheunderground.com and follow us on Instagram @QueensOfTheUndergroundShow"},{"date":"2022-06-04T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/WOOSUNG_72981649059649.jpeg","title":"WOOSUNG PRESENTS: MOTH EP SHOWCASE","url":"https://starlinesocialclub.com/event/woosung-presents-moth-ep-showcase/","details":"Starline Social Club Presents\nWOOSUNG\nMoth EP Showcase\n**NOTE** – VIP Ticket holders can bring gifts to the show but sending to the address below would be preferred:\nWoo Sung Kim\n2106 W. Artesia Blvd #1008\nTorrance, CA 90504\nWoosung will not be able to accept gifts at the show. Thanks for the support!\nSat June 4, 2022 – Doors @ 7pm\n$25 adv // $30 dos // $200 meet \u0026 greet\nAll Ages\n——\nWOOSUNG is a Korean-American musician, singer, songwriter, and composer, best known for being the vocalist and electric guitarist of South Korean band The Rose. Debuting in 2017 with the soft-rock hit “Sorry,” The Rose was named one of the “New K-Pop Artists to Watch” by Billboard. They subsequently broke into the top 10 of Billboard’s “Next Big Sound,” “World Digital Song Sales” and “World Albums” charts with the EPs, Dawn and Void, the latter of which also hit #1 on the U.S. iTunes’ K-Pop Albums chart, solidifying the band’s dominance as one of the fastest accelerating artists across the internet. \nAs the frontman of The Rose, Woosung made his solo debut in 2019 with the EP, Wolf, and its title single, “Face,” quickly racking up nearly 20 million views on YouTube. In 2020, Woosung lent his vocals to the original soundtrack of award-winning K-drama series, Itaewon Class. A multifaceted performer, Woosung released his debut feature-length album, Genre, in December of 2021 and has an upcoming EP, Moth, set to be released this spring via Transparent Arts. He is currently on the North American tour as the opening act for the legendary South Korean hip hop group Epik High.\nHe currently resides in Los Angeles. \nInstagram: @iwoosung – 1.2M "},{"date":"2022-06-05T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/The_79451650891362.jpeg","title":"THE 5TH BEAT SESSIONS: LIVE JAZZ IN THE CRYSTAL CAVERN","url":"https://starlinesocialclub.com/event/the-5th-beat-sessions-live-jazz-in-the-crystal-cavern-6/","details":"Starline Social Club Presents:\nThe 5th Beat Sessions:\nLive Jazz in the Crystal Cavern\nHosted by Mike Quigg\nEvery Sunday 7-9pm – Doors @ 6pm\nNo Cover – 21+"},{"date":"2022-06-08T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/Oakadelic_81421653234967.jpeg","title":"OAKADELIC WEDNESDAYS: LIVE FUNK SOUL \u0026 R\u0026B IN THE CRYSTAL CAVERN","url":"https://starlinesocialclub.com/event/oakadelic-wednesdays-live-funk-soul-rb-in-the-crystal-cavern-13/","details":"Oakadelic Wednesdays\nWednesday nights in the Crystal Cavern\n10pm // No Cover\n—–\nOakadelic Wednesdays is a weekly live funk, soul, R\u0026B and hip hop jam session at the center of Oakland’s live music scene. As a staple of the east bay, it has brought community together for more than 10 years. With a rotating cast of players each week in the houseband, and with a jam session to follow, it keeps people dancing and communing every time."},{"date":"2022-06-10T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/02/Emily_6911.jpeg","title":"EMILY WELLS W/ ARTHUR MOON","url":"https://starlinesocialclub.com/event/emily-wells-w-arthur-moon/","details":"Emily Wells\nFriday June 10, 2022 – Doors 8pm // Show 9pm\n$18 adv // $20 dos\n18+\n——–\nEmily Wells\n“Quietly transfixing” composer / producer Emily Wells is known for her varied use of classical and modern instrumentation, “a master of blending the worlds of classical and electronics” (NPR) and “dramatic, meticulous and gothic songs” (New York Times). On stage Wells’ builds a “new instrument” out of acoustic and electronic drums, synth, violin, and her evocative performances leave audiences equal parts dancing and grieving. Wells’ latest work, This World is Too _____ For You released in March has been hailed by NPR as “breathtaking” “mind-blowing” and “visionary”. The ten song album, arranged for chamber ensemble by composer Michi Wiancko, was commissioned by Saint Paul Chamber Orchestra’s Liquid Music Series and Metropolis Ensemble who performs on the album along with drummer / composer Shayna Dunkelman (Du Yun, Xiu Xiu).\n“The new songs are the rub between desire for, and desire to strip oneself of all wanting” Wells says of the new material, which clamors around all the edges, and sometimes into the center of our collective uncertainties.\n“I grew up with hymns and I often find myself drawn to a form that seeks redemption, even for transgressions unknown… they are an offering, an oath. As a queer kid raised in the south and the midwest by a music minister and a preacher’s daughter I am interested in the reclamation of themes and ideas that have often been used to constrain me.” Of Wells’ video work, which accompanies her performances, she says, “the video and the songs are mirrors of one another: grace, the body, movement, and the natural world, beating against our windows, drunk with the answer.”"},{"date":"2022-06-10T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/Treasvre_80831652894762.jpeg","title":"TREASVRE W/ PLEEAY \u0026 JAH’S TIN","url":"https://starlinesocialclub.com/event/treasvre-w-pleeay-jahs-tin/","details":"Starline Social Club Presents\nTREASVRE\nPLEEAY\nJAH’S TIN\nLive in the Crystal Cavern\nFriday June 10 2022 – Doors @ 8pm\n$12 adv // $15 dos\n18+\n————–"},{"date":"2022-06-11T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/Artemisia_74171649772758.jpeg","title":"ARTEMISIA (EP RELEASE) W/ ADRIENNE SHAMSZAD","url":"https://starlinesocialclub.com/event/artemisia-ep-release-w-adrienne-shamszad/","details":"Starline Social Club Presents\n**RESCHEDULED FROM 4/8/22**\nLive in the Crystal Cavern:\nArtemisia\nw/ support from Adrienne Shamszad\nSaturday Jan 29 2022 @ 7pm\n$16\n18+\n—–\nArtemisia\nThere is a haunting beauty to the music of Artemisia. Inspired by Appalachian folk harmonies, 80’s synth soundtracks, and ghosts, the trio features vocal harmonies that weave tightly together, shimmering above the polyrhythmic harp and soaring violin. A dreamy spaciousness fills their arrangements and wistful melodies linger long after the final note has faded.\nThe Oakland-based trio began as a duo when Selene Ross (vocals, ukulele, guitar, autoharp, dulcimer) and Alisa Rose (vocals, harp, guitar) met in the misty Berkeley Hills in 2018. They recorded a debut collection of songs in the Joshua Tree desert in early 2021, made possible by the gentle heart of Anthony Ferraro (Toro y Moi, Astronauts, etc.), and were joined in the summer of 2021 by Ariel Wang on violin.\nThis spring they celebrate the release of their debut EP.\nAdrienne Shamszad\nAn Oakland, California native of Iranian heritage, Adrienne Shamszad sings revolutionary anthems, prayerful power ballads, blues, lullabies, and love songs in English and in Farsi. Her strong and soulful voice, expressive guitar work and bold performance style have made her a popular West Coast performer for over a decade.  \nHer musical artistry is indeed something to behold. She is mystical, yet earthy. At one moment lofty, the next low-down. Adrienne’s poetry is intimate and genuine, inspired by the mystic Poets of Iran as much as the folk poet-songwriters of the 60s and 70s. She can transform a stage into a sacred place with the magic of her voice. Then, she sweeps you away on a musical journey through improvisation, folk melodies, Indian mantra, rock and roll, rhythm and blues, and Iranian classics."},{"date":"2022-06-11T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/02/Jerry_6913.jpeg","title":"JERRY PAPER W/ MAYLEE TODD","url":"https://starlinesocialclub.com/event/jerry-paper-w-maylee-todd/","details":"Saturday June 11 2022 @ 8pm\nJERRY PAPER\nMAYLEE TODD\n$16 adv // $18 dos\n18+\n—–\nJerry Paper is Lucas Nathan. Jerry Paper is instant coffee, bullshit jobs, weekly therapy sessions, crises of conscience, corporate mascots, 5meo-DMT trips, jokers down on their luck, surveillance, a jacked dad high on meth at a child’s party, apologies, trash cans, cacti, and the magic of words. From its initial days as a DIY solo synth project in the early 2010s to its current incarnation as a five-piece band, Jerry Paper has always been the earthly conduit for the wild and uncanny imagination of its creative mastermind.\nIn 2019, back from traveling the world for the I Am Begging You To Come To These Shows tour, Jerry Paper hung up their flowing dress and sandals, glided into the studio, and began giving material form to their new musical manifestation: Abracadabra.\nOver thirteen songs, they serve up a blend of jazzy instrumentation with soft-rock stylings and some seriously catchy earworms, forging a style that hints at the avant-pop of Scott Walker, the sweet enchantment of Paul McCartney, and the cryptic, smooth grooves of Steely Dan.\nLike all good stories, Abracadabra boasts unforgettable characters: someone with a victim complex (“Cholla”); an alien captive surveilled by a mysterious presence (“Puppeteer”), and a buff man whose life is thrown into shambles when he is caught smoking methamphetamine at his child’s birthday party (“Body Builder on the Shore”). Nathan’s interest in talk therapy led to “Spit It Out”, a song about the health-inducing qualities of improvised speech; “Memorial Highway” is about existence after death in other people’s memories, and “Apologist” and “All I Need” affirm the value — and occasional futility — of recognizing one’s wrongs. Building new realities out of words and sounds is no easy task, and on “Trash Can”, Nathan mourns the frustrations of the creative process.\nAbracadabra is many things at once: arch and sincere, bizarre and all too real, funny and melancholic — the work of an artist living in a world when despair so often tips over into ridiculousness, sometimes the only thing left to do is laugh.\nNathan worked with longtime visual collaborator Steve Smith and avant-comedian Alan Resnick to create the album art, which depicts an alien outsider spotting someone he recognizes. Who could it be? Don’t worry. Sit back, relax, and let Abracadabra cast its spell."},{"date":"2022-06-12T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/02/Holy_6963.jpeg","title":"HOLY FUCK W/ LINQUA FRANQA","url":"https://starlinesocialclub.com/event/holy-fuck-w-linqua-franqa/","details":"Holy Fuck\nLinqua Franqa\nCanadian electro-rock outfit Holy Fuck play dance music without modern electronic equipment, instead preferring to use standard rock instrumentation as well as unconventional devices and machines. The group have received much acclaim for their ecstatic performances as well as their recordings, which hone their junk-shop aesthetic into accessible dance-rock songs. After debuting with the sprawling, Krautrock-inspired jams of their self-titled 2005 full-length, the group’s sound became more accessible (and sometimes vocal-based) with subsequent releases such as 2016’s Congrats."},{"date":"2022-06-15T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/Oakadelic_81451653234971.jpeg","title":"OAKADELIC WEDNESDAYS: LIVE FUNK SOUL \u0026 R\u0026B IN THE CRYSTAL CAVERN","url":"https://starlinesocialclub.com/event/oakadelic-wednesdays-live-funk-soul-rb-in-the-crystal-cavern-14/","details":"Oakadelic Wednesdays\nWednesday nights in the Crystal Cavern\n10pm // No Cover\n—–\nOakadelic Wednesdays is a weekly live funk, soul, R\u0026B and hip hop jam session at the center of Oakland’s live music scene. As a staple of the east bay, it has brought community together for more than 10 years. With a rotating cast of players each week in the houseband, and with a jam session to follow, it keeps people dancing and communing every time."},{"date":"2022-06-16T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/QUASAR_74491649781367.jpeg","title":"QUASAR VIBES: AN INTERGALACTIC AFRO GRAVITATION","url":"https://starlinesocialclub.com/event/quasar-vibes-an-intergalactic-afro-gravitation-3/","details":"Join us as we float through Amapiano, House, and other Afro-futuristic vibes. Dance music by aebldee and friends in the Crystal Cavern. \n9p no cover! Slide early!"},{"date":"2022-06-17T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/The_74251652804861.jpeg","title":"THE RANGE W/ DEMOTAPES","url":"https://starlinesocialclub.com/event/the-range-w-demotapes/","details":"POPSCENE PRESENTS\nTHE RANGE\nDEMOTAPES\nFriday June 17 2022 – Doors @ 8pm\n$16 adv // $19 dos\nAll Ages\n———\nIn April of 2018 James Hinton relocated from Brooklyn to isolate himself in the Green Mountains of Vermont and continue to work on the tracks that would make up his rave and grime-influenced fourth LP as The Range. When naming the new album, he landed on a word that captured both the deep intensity of the songs and their multiplicity of meanings: Mercury. The mirror-like surface of liquid mercury made him think about the way his music reflected specific memories from his life. Mercury poisoning causes mad hatter’s disease, a neurological disorder characterized by behaviors including depression, apathy, and social anxiety, all moods that had taken hold of him during his time alone in Vermont. Hinton, who holds a degree in physics from Brown University, also thought of the planet Mercury and its fraught position as the closest planet to the sun. Eventually, as the sun expands into a red giant star, Mercury will be burnt up and consumed. Hinton had been verging on burnout in his creative process and liked the idea of Mercury continuing to exist despite its cataclysmic trajectory – as he puts it, “scorched but still in orbit.”\nHinton escaped the overstimulation of New York City thinking the lack of distraction would help him find the focus to complete the album. But he soon discovered the dark side of rural life and came to see it as “existentially scary.” He knew no one and would sometimes go for a month or more without seeing another person. “I think it’s starting to become a bit of a vogue to leave the city for the country but I might serve as a cautionary tale,” he says. “Yes, there is more and better quality time to work on your art, but it can become a prison of your own making. That level of isolation magnified some creeping depression that sent me into a really bad spiral for two years.”\nYet the narrative of Mercury is not one of defeat but of defiance. Hinton builds on the techniques he established on his critically acclaimed 2016 LP Potential, seeking to create human connection in the Internet age through sampling vocalists from the corners of YouTube, Instagram, and Periscope. “I feel like I can find ways to express myself in ways that I’m too shy or unable to do in the real world,” Hinton says of the process. Of early album track “Urethane,” he says, “The lyrics ‘last year man got left in the dark – ‘cause man didn’t really have nothing to say’ hit me hard as I was feeling left out and forgotten. I had a mutually agreed upon separation from the world. Those lyrics were defiant to me and a way of fighting back against that feeling.” Mercury both sprawls and soothes across its eleven tracks, following an arc that begins in a dark place but ends in brightness and hope. “I’ve elected to start the album in a period of questioning and tumult with ‘Bicameral’ – ‘When you – when you lied to me’,” says Hinton, quoting the song’s lyrics, “and finish in a period of optimism with ‘Violet’ – ‘For you – never thought I’d feel this way – for you.’”"},{"date":"2022-06-18T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/Los_80511652722030.jpeg","title":"LOS FANTASMAS DEL CARIBE","url":"https://starlinesocialclub.com/event/los-fantasmas-del-caribe/","details":"Jaffe Events and Earshot Entertainment Present:\nLos Fantasmas del Caribe\nSaturday June 18 2022 – Doors @ 8pm\nGA – $37.50\nVIP Tables (Includes GA, Groups of 4 only) – $250\nMeet \u0026 Greet – $80.00 (Includes GA)\n18+\n——————-"},{"date":"2022-06-21T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/KEVIN_80471652605563.jpeg","title":"KEVIN KAARL","url":"https://starlinesocialclub.com/event/kevin-kaarl/","details":"Starline Social Club and Live Nation Present\nKEVIN KAARL\nTuesday June 21 2022 – Doors @ 7pm\n$20 adv // $24 dos\n18+\n—————–\nKevin Kaarl originario de Meoqui, Chihuahua. Uno de los artistas mexicanos más\nqueridos del público, acumula salas de conciertos agotadas por donde se presente,\nsu show es una experiencia que apela los sentimientos más profundos.\n2022 es un año muy importante en su carrera, presentándose en los escenarios\nprincipales e icónicos de México y en festivales ante más de 20,000 personas.\nActualmente se encuentra preparando su gira mundial, que incluirá varios países de\nEuropa, Sudamérica, Centroamérica, Estados Unidos y Mexico. A la par, esta\nafinando detalles de su nuevo álbum, el cual será presentado a finales de verano.\nSu álbum “HASTA EL FIN DEL MUNDO” lleva 10 semanas dentro del top 5de los albumes mas escuchados en Spotify Mexico."},{"date":"2022-06-22T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/Oakadelic_81481653234975.jpeg","title":"OAKADELIC WEDNESDAYS: LIVE FUNK SOUL \u0026 R\u0026B IN THE CRYSTAL CAVERN","url":"https://starlinesocialclub.com/event/oakadelic-wednesdays-live-funk-soul-rb-in-the-crystal-cavern-15/","details":"Oakadelic Wednesdays\nWednesday nights in the Crystal Cavern\n10pm // No Cover\n—–\nOakadelic Wednesdays is a weekly live funk, soul, R\u0026B and hip hop jam session at the center of Oakland’s live music scene. As a staple of the east bay, it has brought community together for more than 10 years. With a rotating cast of players each week in the houseband, and with a jam session to follow, it keeps people dancing and communing every time."},{"date":"2022-06-23T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/STATUS_80131652271522.jpeg","title":"STATUS FEAT. MARCEL P BLACK, MAX BUNDLES, KAYATTA","url":"https://starlinesocialclub.com/event/status-feat-marcel-p-black-max-bundles-kayatta/","details":"DJ True Justice Presents:\nSTATUS\nfeat.\nMarcel P Black\nMax Bundles\nKayatta\nDJ Sets by:\nBlack\nSonido Baylando\nThursday June 23 2022 @ 9pm\n$11\n18+\n——————"},{"date":"2022-06-24T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/Small_81871653645583.jpeg","title":"SMALL CRUSH W/ SHUTUPS \u0026 ZZZAHARA","url":"https://starlinesocialclub.com/event/small-crush-w-shutups-zzzahara/","details":"Starline Social Club Presents\nSMALL CRUSH\nSHUTUPS\nZZZAHARA\nLive in the Crystal Cavern\nFriday June 24 2022 – Doors @ 8pm\n$12 adv // $15 dos\n18+\n————-"},{"date":"2022-06-25T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/Alex_81821653412035.jpeg","title":"ALEX SIEGEL W/ SATCHY","url":"https://starlinesocialclub.com/event/alex-siegel-w-satchy/","details":"Starline Social Club Presents\nALEX SIEGEL\nSATCHY\nLive in the Crystal Cavern\nSaturday June 25 2022 – Doors @ 8pm\n$13 adv // $15 dos\n18+\n—————–"},{"date":"2022-06-27T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/02/Windhand_6834.jpeg","title":"WINDHAND W/ UN","url":"https://starlinesocialclub.com/event/windhand-w-un/","details":"Starline Social Club Presents\nWindhand\nUn\nMonday June 27 2022 – Doors 7 / Show 8\n$21 adv // $26 dos\n18+\n——–\nFor a band who traffic in measured, unhurried riffage, Richmond’s WINDHAND have moved awfully quickly over the last few years. Founded in 2009, the VA quintet have been making waves since the release of their 2010 practice space demo, a two-track CD that garnered the band comparisons to artists like Electric Wizard, The Devil’s Blood, and Black Sabbath. That auspicious start was further realized in March 2012 when the band released their self-titled debut, which quickly became an underground hit and sold out of multiple vinyl presses in a matter of months.\nA year later, the band officially signed to Relapse Records. After a steady touring schedule, the band collaborated with Richmond brethren Cough on a split entitled Reflection of the Negative, which was released on Relapse in April 2013. Pitchfork deemed the split WINDHAND’s “best music to date,” and the record’s positive critical reception helped pave the way for WINDHAND to release the highly anticipated album Soma in September 2013. Stereogum, Spin, and the LA Weekly featured Soma prominently on their overall best-of lists. The album was heavily represented in countless metal publications including Revolver, Invisible Oranges, MetalSucks, and Metal Injection. Rolling Stone, NPR, and Pitchfork all took note of Soma as well; the former considered the album the third-best metal release of 2013.\nSoma was no flash-in-the-pan internet phenomenon. In 2013 and 2014, the band embarked on a series of support and headlining tours across North America, Europe, and Australia, sharing the stage with the likes of Sleep, High on Fire, Dead Meadow and Kvelertak. In addition, Windhand appeared at major festivals including Roadburn, SXSW, Scion Rock Fest, Day of the Shred and Maryland Deathfest. Windhand also took the time in October 2014 to follow up Soma with a brief two-track Halloween split alongside Swedish doomsters Salem’s Pot (released on Riding Easy Records). Noisey liked the record so much that they declared the band “must have definitely sold their souls for their new split.”\nWINDHAND returned in 2015 with their third full-length, Grief’s Infernal Flower, a multifaceted slab of thundering stoner doom that Noisey has called “doom metal’s most anticipated album of the year.” Produced by Jack Endino (Nirvana, High On Fire, Soundgarden, etc), Grief’s Infernal Flower is massive, heavy, and personal, a modern testament to the power of doom and stoner metal’s legacies. One sees the urgency the band have displayed over their career reflected in their music – long-canonized tropes are reimagined and reinvented, Windhand convey an irrepressible sense of motion even within the slowest of songs. Front woman Dorthia Cottrell firmly establishes herself as one of the best vocalists of the genre by perfectly balancing beauty with enormous power, and the twin-guitar attack of Garrett Morris and Asechiah Bogdan weaves together nine songs of perfect riffs and fuzzed-out bliss. That often-delicate splendor is all tempered by the colossal rhythmic mastery of bassist Parker Chandler and drummer Ryan Wolfe, whose lower-register expertise serves as the backbone of the new record. Though the first two WINDHAND albums were underground classics, Grief’s Infernal Flower stands to see WINDHAND cementing themselves as one of the premier metal bands of our time."},{"date":"2022-06-29T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/Oakadelic_81511653234979.jpeg","title":"OAKADELIC WEDNESDAYS: LIVE FUNK SOUL \u0026 R\u0026B IN THE CRYSTAL CAVERN","url":"https://starlinesocialclub.com/event/oakadelic-wednesdays-live-funk-soul-rb-in-the-crystal-cavern-16/","details":"Oakadelic Wednesdays\nWednesday nights in the Crystal Cavern\n10pm // No Cover\n—–\nOakadelic Wednesdays is a weekly live funk, soul, R\u0026B and hip hop jam session at the center of Oakland’s live music scene. As a staple of the east bay, it has brought community together for more than 10 years. With a rotating cast of players each week in the houseband, and with a jam session to follow, it keeps people dancing and communing every time."},{"date":"2022-06-30T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/The_82021653991077.jpeg","title":"THE FRESH YARD TOUR FEAT. PLANET ASIA, FASHAWN, MITCHY SLICK, SIR VETERANO, FLII STYLZ","url":"https://starlinesocialclub.com/event/the-fresh-yard-tour-feat-planet-asia-fashawn-mitchy-slick-sir-veterano-flii-stylz/","details":"Starline Social Club Presents\nTHE FRESH YARD TOUR\nfeat.\nPlanet Asia\nFashawn\nMitchy Slick\nSir Veretano\nFlii Stylz\nLive in the Ballroom\nThursday June 30 2022 – Doors @ 7pm\n$16 adv // $26 dos\n18+\n—————–"},{"date":"2022-07-06T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/Oakadelic_81541653234983.jpeg","title":"OAKADELIC WEDNESDAYS: LIVE FUNK SOUL \u0026 R\u0026B IN THE CRYSTAL CAVERN","url":"https://starlinesocialclub.com/event/oakadelic-wednesdays-live-funk-soul-rb-in-the-crystal-cavern-17/","details":"Oakadelic Wednesdays\nWednesday nights in the Crystal Cavern\n10pm // No Cover\n—–\nOakadelic Wednesdays is a weekly live funk, soul, R\u0026B and hip hop jam session at the center of Oakland’s live music scene. As a staple of the east bay, it has brought community together for more than 10 years. With a rotating cast of players each week in the houseband, and with a jam session to follow, it keeps people dancing and communing every time."},{"date":"2022-07-07T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/02/Primitive_6915.jpeg","title":"PRIMITIVE MAN","url":"https://starlinesocialclub.com/event/primitive-man/","details":"PRIMITIVE MAN\nJarhead Fertilizer\nBody Void\nElizabeth Colour Wheel\nSpirit Possession\nThursday July 7, 2022 @ 7pm\n$16 adv // $21 dos\n18+"},{"date":"2022-07-07T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/STATUS_80191652299563.jpeg","title":"STATUS FEAT. FOREIGN LEGION, JUSTIN’S CASE, VOCAB SLICK, RMLLW2LLZ \u0026 MOON MAGIC","url":"https://starlinesocialclub.com/event/status-feat-foreign-legion-justins-case-vocab-slick-rmllw2llz-moon-magic/","details":"DJ True Justice Presents\nSTATUS\nfeat.\nForeign Legion\nJustin’s Case\nVocab Slick\nRMLLW2LLZ\nMoon Magic\nHosted by Z-Man\nDJs:\nDS\nTrue Justice"},{"date":"2022-07-11T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/Covey_80591652866707.jpeg","title":"COVEY \u0026 SINCERE ENGINEER – SOLO ACOUSTIC TOUR","url":"https://starlinesocialclub.com/event/covey-sincere-engineer-solo-acoustic-tour/","details":"Starline Social Club Presents\nCOVEY \u0026 SINCERE ENGINEER\nSolo Acoustic Tour\nMonday July 11, 2022 – Doors @ 7pm\n$13.50 adv // $17 dos\n16+\n————"},{"date":"2022-07-15T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/Forrest_81311653223006.jpeg","title":"FORREST DAY","url":"https://starlinesocialclub.com/event/forrest-day/","details":"Starline Social Club Presents\nFORREST DAY\nLive in the Ballroom\nFriday July 15 – Doors @ 8pm\n$21 adv // $26 dos\n18+\n————–\nBased out of Oakland, Forrest Day is a 5 piece band that’s been performing concerts around the country for over a decade. Known for intense and fun shows, the band has built a very dedicated following and needs to be experienced live to understand. Lots of new music being released this year."},{"date":"2022-07-15T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/Serpentfoot_81761653322591.jpeg","title":"SERPENTFOOT W/ CRUZ AND SLUMPED","url":"https://starlinesocialclub.com/event/serpentfoot-w-cruz-and-slumped/","details":"Starline Social Club Presents\nSERPENTFOOT\nCRUZ\nSLUMPED\nLive in the Crystal Cavern\nSaturday July 15, 2022 – Doors @ 8pm\n$15 adv // $17 dos\n18+\n————-\nBOY HOWDY\nFUN \u0026 ROWDY\nSTONEY LOUDY\nSWEATY CROWDY\nSerpentfoot is a psychedelic garage rock group based in Tacoma; The gritty heart of Washington. From the beginning the rowdy three piece has pumped out everything from jangly surf punk bops to soaring psychedelic compositions. No sound is sacred and no ears are safe. Sonically Serpentfoot bumps shoulders with acts like Osees, Slift, and King Gizzard while simultaneously stirring a dose of occult madness into the brew. The pure electricity and party atmosphere of the live experience is the real centerpiece.\nLead guitarist and vocalist Jordan Twiggs gives off an energetic aura of controlled chaos and tickles the ear with relatable, yet refreshingly creative guitar work and a wide range of unique vocal stylings. Bassist and songwriter Philip Shellabarger has an untameable live energy and a similarly unique playing style, merging surf and punk with fuzzed out stoner riffs. Ryan Schilawski smashes away at the drums like an unstoppable train engine. Constant and sustained energy with bursts of mind-bending complexity buries the group solidly into the shadowed realm of heaviness. "},{"date":"2022-07-16T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/Quelle_81911653576384.jpeg","title":"QUELLE CHRIS","url":"https://starlinesocialclub.com/event/quelle-chris/","details":"Starline Social Club Presents\nQUELLE CHRIS\nLive in the Ballroom\nSaturday July 16 2022 – Doors @ 8pm\n$18 adv // $20 dos\n18+\n——————"},{"date":"2022-07-19T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/02/S._6917.jpeg","title":"S. CAREY W/ COURTNEY HARTMAN","url":"https://starlinesocialclub.com/event/s-carey-w-courtney-hartman/","details":"Starline Social Club Presents\nAbout this event\nS. Carey\nCourtney Hartman\nTuesday July 19 2022 @ 7pm\n$20\n18+"},{"date":"2022-07-24T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/Dakota_80871653062950.jpeg","title":"DAKOTA THEIM \u0026 SAINT SOLITUDE","url":"https://starlinesocialclub.com/event/dakota-theim-saint-solitude/","details":"Starline Social Club Presents:\nDAKOTA THEIM\nSAINT SOLITUDE\nLive in the Crystal Cavern\nSunday July 24 2022 – Doors at 6pm\n$11 adv // $13 dos\n18+\n——————\nHow do you create a dialogue with only one voice?\nEven before forming his shapeshifter musical outfit Saint Solitude in 2006, multi-instrumentalist Dup Crosson was always driven by a desire to sound bigger than he actually was. His brand of sonic alchemy — what he calls “bittersweet fuzz” — might reveal a solitary angst at its core, but has always been a communal call to action for better times.\n“Resist this slow momentum,” he sang on the early track “And After,” years before that verb was typical news hour jargon. And then later, in far less vague terms, “I want out from within!” \nThe guitar hero dramatics of his beloved Smashing Pumpkins and Oasis may not be wholly evident at first listen, but the gamut between delicacy and ferocity is there to discover with repeated listens. And when you add as many layers as Crosson does, repeated listens are a must. \nHis debut album Journal of Retreat captured pop hooks in all manners of landscapes, grabbing retro surf beats and anthemic piano melodies as often as it melted into more experimental Radiohead mosaics. If this was the product of a sole bedroom producer, not many could tell.  \nFast-forward seven years to Soul Song Paralytic, an unapologetic musical-visual exploration of grief with the multimedia artist Dara Lorenzo, which was made after a close friend’s death. Crosson and Lorenzo hosted free events to showcase the conceptual work in the Oakland area and build community. Gone were the days of simple, self-contained aspirations. \nSomewhere between these heavily contrasted albums is a map to Saint Solitude’s ambitious scope and optimistic ennui. Over the years, Crosson has molded the project to fit his geographic and creative whims, touring coast to coast as a one-man loop show for years before staging fully-realized trio and quartet arrangements of his studio blueprints. \nExpression reigns supreme in Crosson’s home studio, and with good reason – his unexpected instrumental record Flux Camoufleurs, Vol. I garnered licensing spots on Viceland, CMT, and Telemundo networks worldwide, and the Paralytic live show was featured in San Francisco’s inaugural Reimagine: End of Life event series in 2018.\nWith a sixth album, Twilight Reduction, out November 2021, and Crosson recently launching EDBL Music Collective – a production music house he co-founded and composes for – plans in the post-pandemic world are looking toward brighter shores. For a child of the 90s, that’s no small feat."},{"date":"2022-07-30T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/Death_81721653301598.jpeg","title":"DEATH BELLS W/ NIIS \u0026 PENDANT","url":"https://starlinesocialclub.com/event/death-bells-w-niis-pendant/","details":"Starline Social Club Presents:\nDEATH BELLS\nNIIS\nPENDANT\nLive in the Ballroom\nSaturday July 30, 2022 – Doors @ 8pm\n$15 adv // $17 dos\n18+\n———————–\nAdopting a collaborative approach for the recording of their third album, Death Bells have returned Between Here \u0026 Everywhere, an effort that captures the cross-section of Southern California’s shadowy hidden interzones, outside of the lights and luxury. \n  The record features nine new songs that represent Will Canning and Remy Veselis’ continual growth, as well as accompaniment by an experienced cast of contributors on keys, strings, piano, and operatic backup vocals. Recorded with Colin Knight at Paradise Studios, and mixed by Mike Kriebel at Golden Beat, Between Here \u0026 Everywhere bristles with immediacy and emotion, with every element tactile, balanced, and elevated."},{"date":"2022-08-09T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/02/Steve_7063.jpeg","title":"STEVE VON TILL W/ HELEN MONEY","url":"https://starlinesocialclub.com/event/steve-von-till-w-helen-money/","details":"Starline Social Club Presents\nSteve von Till\nHelen Money\nTuesday August 9 2022 – Doors @ 8pm\n$20\n—————————–\nSteve Von Till has made a life’s work out of seeking the elemental. With a solo discography that stretches back more than two decades, he has toiled in a shadow realm, peeling back layers of reality in a never-ending search for true meaning and raw emotion. A Deep Voiceless Wilderness strips back the veil even further. An achingly beautiful ambient work with neo-classical leanings, the album is a hallucinatory and elegant rumination on our disconnect from the natural world, each other, and ultimately ourselves.\nFor some listeners, the album may recall the work of modern composers like Jóhann Jóhannsson, Brian Eno or Gavin Bryars. For Von Till, it’s about surrendering to the spirit of place—and to the original intent behind his 2020 solo album, No Wilderness Deep Enough. That album marked a significant first for Von Till: It was his first solo record without a guitar in hand. Instead, Von Till intoned powerful and thought-provoking lyrics over piano, cello, mellotron and analog synthesizers. A Deep Voiceless Wilderness is that same album without Von Till’s words.\n“This is how I originally heard this piece of music,” he says. “Without the voice as an anchor or earthbound narrative, these pieces have a broader wingspan. They become something else entirely and unfold in a more expansive way. The depth of the synths, juxtaposed with the strings and French horn, have space to develop and allow the listener to imagine their own story.”\nAlso a first for Von Till was Harvestman: 23 Untitled Poems and Collected Lyrics, his first book of poetry.  Published by the University of South Dakota’s Astrophil Press, the book established Von Till as a formidable and thoughtful author of verse—a fact that Neurosis fans knew all along, but the wider world was only just becoming aware of. \n“There is a depth of hope, acceptance and loss that permeates these poems,” Joseph Haeger said in his review for The Inlander. “Like any great piece of art, Harvestman contains multitudes, and that’s exactly what I was hoping for when I cracked it open. Von Till has already established himself as a great musician, and he’s about to put his stake into the ground proving himself to be a damn good writer.”"},{"date":"2022-08-11T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/STATUS_80221652299569.jpeg","title":"STATUS FEAT. THE N8VS (KR8VN8V RECORDS SHOWCASE), GR8 \u0026 THE GREATHOUSE OF DANCE (SAC)","url":"https://starlinesocialclub.com/event/status-feat-the-n8vs-kr8vn8v-records-showcase-gr8-the-greathouse-of-dance-sac/","details":"DJ True Justice Presents\nSTATUS\nfeat.\nThe N8VS (Kr8vN8v Records Showcase)\nGr8 \u0026 The Greathouse of Dance (Sac)\nDJs:\nDS\nMiss Powers (Austin)\nFREE SHOW"},{"date":"2022-08-15T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/Church_79731651527985.jpeg","title":"CHURCH OF THE COSMIC SKULL W/ BLACK BOX REVELATION, LORD BUFFALO, PSYCHLONA","url":"https://starlinesocialclub.com/event/church-of-the-cosmic-skull-w-black-box-revelation-lord-buffalo-psychlona/","details":"Ennis Booking Presents\nCHURCH OF THE COSMIC SKULL\nBLACK BOX REVELATION\nLORD BUFFALO\nPSYCHLONA\nLive in the Ballroom\nMonday August 15 2022 – Doors @ 7pm\n$16adv // $20 dos\n18+\n—————"},{"date":"2022-08-22T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/Tim_79591651153574.jpeg","title":"TIM KINSELLA \u0026 JENNY PULSE W/ RANDY RANDALL (NO AGE)","url":"https://starlinesocialclub.com/event/tim-kinsella-jenny-pulse-w-randy-randall-no-age/","details":"Starline Social Club Presents:\nTim Kinsella \u0026 Jenny Pulse\nRandy Randall (of No Age)\nMonday Aug 22, 2022 – Doors @ 7pm\nLive in the Crystal Cavern\n$11 adv // $13 dos\n18+\n————-"},{"date":"2022-08-25T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/02/Loving_6919.jpeg","title":"LOVING","url":"https://starlinesocialclub.com/event/loving/","details":"**RESCHEDULED FROM 2/4/22**\nLoving:\nLoving is the musical collaboration of David Parry, Lucas Henderson and Jesse Henderson. The band formed by way of a long-distance recording project (Victoria – Toronto) that resulted in the creation of their debut self-titled EP. After the unexpected embrace of this work, the band reconvened in Victoria, BC to begin playing live shows and work on new material.\n "},{"date":"2022-08-26T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/03/ELDER_72591648484758.jpeg","title":"ELDER W/ BELZEBONG \u0026 DREADNOUGHT","url":"https://starlinesocialclub.com/event/elder-w-belzebong-dreadnought/","details":"Ennis Booking Presents:\nELDER\nBELZEBONG\nDREADNOUGHT\nFriday Aug 26 2022 – Doors 7 // Show 7:30\n$21 adv // $26 dos\n18+\n——\nElder is a genre-pushing rock band that melds heavy psychedelic sounds with progressive elements and evocative soundscapes. Formed in a small coastal town in Massachusetts in the mid aughts, the band has reinvented their sound over the course of five albums to grow from a stalwart of the stoner/doom scene into one of the most unique voices in the rock underground. Their long-scale compositions unfold as journeys, running the gamut of styles from the 70’s to the present within a single song with a penchant for “sheer gatefold-era grandeur” (Rolling Stone).\n\nBy continuing to incorporate new elements to their sound, Elder’s output has repeatedly set benchmarks for their peers. Beginning with 2008’s Elder and 2010’s Dead Roots Stirring, Elder made ripples in the stoner rock scene with their uniquely melodic approach to the genre. In 2015 they surprised again with Lore, a watershed moment in the band’s career (recently crowned “Album of the Decade” by The Obelisk) which brought in elements of post-, prog- and space rock into the Elder sound. Despite several years of heavy touring surrounding the album, Reflections of a Floating World was released just two years later, earning a spot at the top of many best-of lists including Rolling Stone (#5, 20 Best Metal Albums Of 2017), Stereogum and others. \nIn 2019, a tour pitstop in Berlin, Germany yielded the experimental EP The Gold \u0026 Silver Sessions. Recorded live based off ideas largely crafted while on the road, the release showcased Elder’s softer side; motorik beats, lush keyboards and sparse compositions replaced the usual colossal riffs and dense structure. Almost a decade and a half after the first sludgy riffs were recorded and the first demo pressed, the door for Elder stylistically remained wide open. \nElder’s new album Omens answers any speculation about new directions with affirmation: evolution or extinction. Lush, intricately interwoven melodies grow and dissolve into spaced-out jams; massive riffs thunder down into a churning sea of psychedelic sounds and unpredictable grooves carry away the listener. Elder paint pictures with their music, and Omens shows the band experimenting with an even more colorful palette – with good reason. After thirteen years, this is the first full-length recorded with a new lineup including guitarist Michael Risberg and new drummer Georg Edert, along with guest performances by Fabio Cuomo on Rhodes piano and synthesizers. "},{"date":"2022-09-11T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/03/Sick_71791647279370.jpeg","title":"SICK OF IT ALL \u0026 AGNOSTIC FRONT","url":"https://starlinesocialclub.com/event/sick-of-it-all-agnostic-front/","details":"Cris Powerhouse Presents:\nSICK OF IT ALL\nAGNOSTIC FRONT\nSunday Sept 11 2022 – Doors @ 7pm\n$28.50 adv // $31 dos\n18+\n——–"},{"date":"2022-09-17T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/03/Mclusky1648723057_72771648723057.jpeg","title":"MCLUSKY","url":"https://starlinesocialclub.com/event/mclusky/","details":"Starline Social Club Presents\nMCLUSKY\nSaturday Sept 17 2022 – Doors @ 8pm\n$25 adv // $30 dos\n18+\n——–"},{"date":"2022-09-20T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/Full_79651651424781.jpeg","title":"FULL OF HELL \u0026 BLOOD INCANTATION W/ VERMIN WOMB, MORTUOUS, GOD IS WAR","url":"https://starlinesocialclub.com/event/full-of-hell-blood-incantation-w-vermin-womb-mortuous-god-is-war/","details":"Ennis Booking Presents:\nFULL OF HELL\nBLOOD INCANTATION\nVERMIN WOMB\nMORTUOUS\nGOD IS WAR\nTuesday Sept 20 2022 – Doors @ 6pm\n$21 adv // $26 dos\n18+\n———–"},{"date":"2022-09-22T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/Addison_79691651482446.jpeg","title":"ADDISON GRACE W/ SYDNEY ROSE \u0026 LEANNA FIRESTONE","url":"https://starlinesocialclub.com/event/addison-grace-w-sydney-rose-leanna-firestone/","details":"Starline Social Club Presents\nADDISON GRACE\nSYDNEY ROSE\nLEANNA FIRESTONE\nThursday Sept 22 2022 – Doors @ 7pm\n$18 adv // $22 dos\nAll Ages\n——–\nCreativity radiates from every fiber of Addison Grace’s being. Whether she’s writing her next indie-pop heartbreaker, decorating her bright yellow car with flowers and vines, experimenting with her bubbly, androgynous fashion sense or making goofy jokes about being young and queer, Grace is eager to share the contents of her heart with the world.\nThe 20-year-old, Utah-based singer/songwriter (who is non-binary and uses all pronouns) was always singing throughout her childhood, and she later learned to play the ukulele after some inspiration from YouTube musicians like Dodie, Conan Gray, Tessa Violet, Cavetown and Chloe Moriondo. In her mid-teens, Grace began covering these artists and writing her own songs, and she shared clips of each on Instagram and YouTube, quickly gaining a loyal following. A few years later, she started a TikTok account, initially just to watch videos and entertain herself, but soon after, she began creating her own content, showcasing many facets of her sunny personality. To her surprise, her TikTok audience exploded, quickly ballooning to over 3.5 million followers, all eager to watch her play a snippet of music, make self-deprecating jokes about her feelings or simply dance freely in her outfit of the day.\nGrace was drawn to the music of Dodie and other YouTubers because she also saw herself as a shy, artsy teen, and like many of them, she grappled with questions about her sexuality. After realizing that she was bisexual, Grace found catharsis in sharing her experiences online, as well as in her music. Her first single “Sugar Rush” was about her attraction to a girl who only saw her as a friend, and it explored her fear of being outcast for her sexuality. Another song “Honeysuckle” is a celebration of her self-love journey, which she cleverly shrouded in a third-person narrative. Recent single “Party Killer” is her most visceral and playful track yet, displaying her feelings of inadequacy, while also depicting herself as the murderer at an innocent get-together gone horribly wrong.\nGrace’s sound is rooted in sweetly-sung indie-pop, though her sonic palette changes just as often as her clothes, hair and makeup do. With subtle hints of folk, rock and R\u0026B, her songs have a light flutter to them, enlivened by tuneful strums, diary-like lyrics and a youthful, expressive glow. Grace has worked with producers like Robin Skinner (Cavetown, mxmtoon, Chloe Moriondo), Elie Jay Rizk (Mazie, Spill Tab) and Jake Aron (Solange, Grizzly Bear), and she was joined by Pete Robertson (Beabadoobee, Clairo) on her newest single “Manic Pixie Dream Girl” (out on May 7). The upbeat, dynamic song is a repudiation of the common character trope that demotes whimsical, interesting women to mere sidekicks of their boring male partners.\nThough Grace creates art as a coping mechanism and a mode of free expression, she also hopes her content helps people understand themselves more intimately, much like other young creatives did for her. No matter if she’s filming herself styling her curled pixie cut or breaking into an angsty acoustic cover of one of her favorite songs, she wants people to feel a moment of comfort or if nothing more, simply take a breath and smile."},{"date":"2022-10-06T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/02/Blood_6921.jpeg","title":"BLOOD RED SHOES","url":"https://starlinesocialclub.com/event/blood-red-shoes/","details":"Blood Red Shoes\nThursday Oct 6 2022 @ 7pm\n$20 adv // $25 dos\n18+"},{"date":"2022-10-07T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/Airbourne_72941648980358.jpeg","title":"AIRBOURNE W/ THE NATIVE HOWL","url":"https://starlinesocialclub.com/event/airbourne-w-the-native-howl/","details":"Starline Social Club Presents:\nAIRBOURNE\nTHE NATIVE HOWL\nFriday October 7 2022 – Doors @ 8pm\n$20 adv // $25 dos\n18+\n——\nSome buildings have a soul. They breathe and sweat and pulsate, holding memories and stories and songs and laughter in their walls. RCA Studio A in Nashville, Tennessee, is such a place… \nThe photos on the walls of the ‘Music City’ recording facility testify to its illustrious history, with Elvis Presley and Roy Orbison and Willie Nelson and Waylon Jennings, architects of rock‘n’roll and country music, smiling down upon visitors. Elvis and The Beach Boys recorded here, as did B.B. King and The Monkees, and Joe Cocker and Tony Bennett. In 1973, Dolly Parton recorded ‘Jolene’ and ‘I Will Always Love You’ in the 5,000-square-foot studio in a single day.\nFor Airbourne to bowl up to 30 Music Square West in April of this year with no songs cast in stone, just a pocketful of riffs and a burning desire to make the truest rock‘n’roll record of their 16 year career, took a certain chutzpah, then, and a lot of balls. But history shows Airbourne never have backed down from a challenge…\nIn the early days, in their native Australia, Joel \u0026 Ryan O’Keeffe’s band would load their guitars and amps and drums into a station wagon and drive for 24 hours to play in the sort of bars where the patrons had prison tattoos, more fingers than teeth, and a dangerous lack of interest in having their drinking time spoilt by strangers. The boys would inevitably be met at the venue doors by a man whose only records were criminal ones…\n“We’d be told, ‘If you guys are gonna make a heap of noise I better fucking like it!’” Joel once recalled. “These were the kind of people who wanted a good Saturday night, and if they didn’t get it, there was gonna be trouble.”\nIt was a tough apprenticeship, but it instilled a fearlessness and a focus in the O’Keeffe brothers. Their dream of escaping their hometown of Warrnambool, Victoria, was underpinned by one simple motto: Rock‘n’Roll For Life."}]