[{"date":"2022-05-04T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/02/Widowspeak_6897.jpeg","title":"WIDOWSPEAK W/ SYLVIE \u0026 SURE THING","url":"https://starlinesocialclub.com/event/widowspeak-w-sylvie-sure-thing/","details":"Starline Social Club Presents\nWidowspeak\nSylvie\nSure Thing\nWed May 4 2022 – Doors 7 // Show 8\n$16\n18+"},{"date":"2022-05-04T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/Oakadelic_73421649329564.jpeg","title":"OAKADELIC WEDNESDAYS: LIVE FUNK SOUL \u0026 R\u0026B IN THE CRYSTAL CAVERN","url":"https://starlinesocialclub.com/event/oakadelic-wednesdays-live-funk-soul-rb-in-the-crystal-cavern-8/","details":"Oakadelic Wednesdays\nWednesday nights in the Crystal Cavern\n10pm // No Cover\n—–\nOakadelic Wednesdays is a weekly live funk, soul, R\u0026B and hip hop jam session at the center of Oakland’s live music scene. As a staple of the east bay, it has brought community together for more than 10 years. With a rotating cast of players each week in the houseband, and with a jam session to follow, it keeps people dancing and communing every time."},{"date":"2022-05-05T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/STATUS_78551651160902.jpeg","title":"STATUS FT. ACEYALONE, LIL FLOWER NASTI, WATUSI CULTLEADER, SINCERE GOD MAGNETIC","url":"https://starlinesocialclub.com/event/status-ft-aceyalone-lil-flower-nasti-watusi-cultleader-sincere-god-magnetic/","details":"DJ True Justice Presents:\nSTATUS\nfeat.\nACEYALONE (Freestyle Fellowship)\nLil Flower Nasti (SF)\nWatusi Cultleader\nSincere God Magnetic\nDJs:\nMarc Stretch\nKnow Expressions (Salsa set)\nThursday May 5 2022 – Doors/Show @ 9pm\n$11 adv // $15 dos\n21+\n—————–\nAs a founding member of Freestyle Fellowship, Aceyalone played an important role in the evolution of left-field hip-hop on the West Coast during an era when hardcore gangsta rap reigned. Following the dissolution of Freestyle Fellowship, Aceyalone embarked on a solo career that never resulted in enormous success but did allow him to maintain his revered status within the West Coast underground hip-hop scene. He debuted solo on All Balls Don’t Bounce (1995) and followed-up with A Book of Human Language (1998). After a three-year absence from the hip-hop scene, he returned in 2001 with Accepted Eclectic, an album released by the Ground Control label, which also re-released his debut album. A new label, Project Blowed, issued Hip Hop and the World We Live In (2002) and Love \u0026 Hate (2003), the latter featuring collaborations with El-P and Antipop Consortium. In 2004 Project Blowed secured the rights to All Balls Don’t Bounce from Capitol and reissued it with a bonus disc, bringing not only extra music but reviving the album after many years out of print. In 2006, Aceyalone released Magnificent City, a collaboration with underground producer RJD2, as well as Grand Imperial, a limited-edition collection of remixes and other exclusive tracks. His 2007 album, Lightning Strikes, was inspired by reggae and dancehall music. It was produced by Bionik, who was also behind the boards for 2009’s The Lonely Ones, an album influenced by Motown, soul, and doo wop. Bionik returned for 2013’s Leanin’ on Slick, another retro-minded album with Cee Lo Green as special guest.\nTry as you might, but you can’t put Lil Flower Nasti in a box. This sultry songstress loves dipping her toe in every musical genre giving her music such a rare and refreshing quality. The Blooming EP is just the introduction of this character: a conceptual story of her first night out. Paired with the nostalgic golden-age production of UnLearn The World, the singer’s natural neo-soul tendencies wrote what you might call a hip-hop chapter. The next pages of her artistic journey showcase her ability to sing funk and soul, with two singles, “Beautiful Goodbye” and “How”, with smooth, stylistic production by multi-instrumentalist Vagabond Lover. Her audience eagerly awaits the release of her upcoming Motown record produced by Bay Area Native and prolific producer Genesee. Lil Flower Nasti’s ability to effortlessly capture the essence of so many different musical genres keeps her audience engaged and waiting with anticipation for her next drop.\nSincere God Magnetic is a Portland, OR based artist, producer \u0026 multi instrumentalist infused with hip hop and punk rock energy and powered by knowledge of self and supreme mathematics. Musically versatile with a solid sense of fashion, creative lyrics and dope beat production ranging from trap slaps to underground boom bap.\nWatusi Cultleader entered the music scene in the early 90s, known as “The Golden Era” of the Hip-Hop cultural movement. This was a pivotal time for anyone who understood the culture born from this atmosphere needed to germinate. He upholds the truths and origins of the genre. This is his top priority in his music. He continues to use this as a staple in his unique style and dynamic ambiance when performing. He is strictly underground, which is a term used for all independent musicians that have not signed to a mainstream label. With current technologies, the underground scene is again on the rise."},{"date":"2022-05-06T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/Caitlin_74871650308854.jpeg","title":"CAITLIN COBB-VIALET W/ GROOBLEN, VIRGOGABRIELLE, CARDIO STAR","url":"https://starlinesocialclub.com/event/caitlin-cobb-vialet-w-grooblen-virgogabrielle-cardio-star/","details":"Starline Social Club Presents:\nCAITLIN COBB-VIALET\nGROOBLEN\nVIRGOGABRIELLE\nCARDIO STAR\nFriday May 6 2022 – Doors @ 7pm\n$13 adv // $16 dos\n18+\n———————"},{"date":"2022-05-06T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/03/Dua_71201646730385.jpeg","title":"DUA SALEH W/ SAM AUSTINS, AROMA, JENSET (DJ)","url":"https://starlinesocialclub.com/event/dua-saleh-w-sam-austins-aroma-jenset-dj/","details":"Starline Social Club and DJ Dials Present:\nDUA SALEH\nSAM AUSTINS\nAROMA\nJENSET\nFriday May 6 2022 – Doors @ 8pm\nEarly $20 // Advance $25 // Day of Show $30\n18+\n———————–\nIt’s tempting to describe Dua Saleh as a natural. An artist who only began recording music two years ago isn’t supposed to sing with such infectious bravado and haunting gloom. Yet to say Dua, who identifies as gender non-binary and goes by they/them pronouns, has arrived fully-formed on their first ever EP project titled Nūr - (pronounced “noor” – meaning “the light” in Arabic). They may have just decided to try songwriting, but they’ve spent their life working across divisions: borders, mediums, identities, and protest lines.\nDua Saleh grew up in St. Paul, Minnesota’s Rondo neighborhood. It was there, in a black cultural center of the Midwest with a once-thriving soul and jazz scene, where Dua became obsessed with music. From the sounds of their home country of Sudan streaming from a satellite specialty channel, to the jazz-scat singers of the 1940s, to R\u0026B and hip-hop of the early 2000s, to dancehall and afro-beat, everything was fair game for Dua. Writing poetry provided an escape from a rigid home life as open mic nights became a refuge to build community and a sense of self. During college Dua received recognition for their poetry, started to build confidence in their voice and became more comfortable on stage. By graduation, their poems started to sound more like lyrics.\nWhen Dua Saleh posted their first musical attempt on the internet, it was a fun experiment to show friends. Almost immediately, the Twin Cities scene took notice. One of them was the producer Psymun (Future, Young Thug, Juice WRLD, Corbin fka Spooky Black), whom Saleh was a fan of but didn’t know shared the same hometown. The pair struck up a chemistry, which led to Psymun executive producing Nūr. The EP includes “Kickflip”, a playful bop that Saleh wrote gazing out their window after waking up restless at three in the morning with a melody that had to get out. “Albany” is more impressionistic, flipping a dark memory of loneliness and heartache into cathartic vocal harmonies that take on a hymnal quality as they build layer upon layer.\nIt’s Dua Saleh’s fluidity – of sound, of form, of self-presentation – that makes them so enlivening. Their vocal range is elastic, floating from an elegant purr into an unvarnished, guttural growl, and then back again at a moment’s notice. Their writing can be dreamy, but more often plumbs the soul, pricking deep with a poet’s precision and showing the scars that remain. With a life that’s been charted across continent and conflict and an early adulthood spent pushing back against myopia and dogma, Saleh doesn’t resist traditional classifications as much as they transcend them. Their music is in conversation with their African ancestry and the future possibilities of the diaspora in a way that collapses the distinctions between global, local, personal and political. To listen to Dua Saleh is to hear, in real time, someone fight for the right to define themselves for themselves."}]