[{"date":"2022-05-06T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/Caitlin_74871650308854.jpeg","title":"CAITLIN COBB-VIALET W/ GROOBLEN, VIRGOGABRIELLE, CARDIO STAR","url":"https://starlinesocialclub.com/event/caitlin-cobb-vialet-w-grooblen-virgogabrielle-cardio-star/","details":"Starline Social Club Presents:\nCAITLIN COBB-VIALET\nGROOBLEN\nVIRGOGABRIELLE\nCARDIO STAR\nFriday May 6 2022 – Doors @ 7pm\n$13 adv // $16 dos\n18+\n———————"},{"date":"2022-05-06T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/03/Dua_71201646730385.jpeg","title":"DUA SALEH W/ SAM AUSTINS, AROMA, JENSET (DJ)","url":"https://starlinesocialclub.com/event/dua-saleh-w-sam-austins-aroma-jenset-dj/","details":"Starline Social Club and DJ Dials Present:\nDUA SALEH\nSAM AUSTINS\nAROMA\nJENSET\nFriday May 6 2022 – Doors @ 8pm\nEarly $20 // Advance $25 // Day of Show $30\n18+\n———————–\nIt’s tempting to describe Dua Saleh as a natural. An artist who only began recording music two years ago isn’t supposed to sing with such infectious bravado and haunting gloom. Yet to say Dua, who identifies as gender non-binary and goes by they/them pronouns, has arrived fully-formed on their first ever EP project titled Nūr - (pronounced “noor” – meaning “the light” in Arabic). They may have just decided to try songwriting, but they’ve spent their life working across divisions: borders, mediums, identities, and protest lines.\nDua Saleh grew up in St. Paul, Minnesota’s Rondo neighborhood. It was there, in a black cultural center of the Midwest with a once-thriving soul and jazz scene, where Dua became obsessed with music. From the sounds of their home country of Sudan streaming from a satellite specialty channel, to the jazz-scat singers of the 1940s, to R\u0026B and hip-hop of the early 2000s, to dancehall and afro-beat, everything was fair game for Dua. Writing poetry provided an escape from a rigid home life as open mic nights became a refuge to build community and a sense of self. During college Dua received recognition for their poetry, started to build confidence in their voice and became more comfortable on stage. By graduation, their poems started to sound more like lyrics.\nWhen Dua Saleh posted their first musical attempt on the internet, it was a fun experiment to show friends. Almost immediately, the Twin Cities scene took notice. One of them was the producer Psymun (Future, Young Thug, Juice WRLD, Corbin fka Spooky Black), whom Saleh was a fan of but didn’t know shared the same hometown. The pair struck up a chemistry, which led to Psymun executive producing Nūr. The EP includes “Kickflip”, a playful bop that Saleh wrote gazing out their window after waking up restless at three in the morning with a melody that had to get out. “Albany” is more impressionistic, flipping a dark memory of loneliness and heartache into cathartic vocal harmonies that take on a hymnal quality as they build layer upon layer.\nIt’s Dua Saleh’s fluidity – of sound, of form, of self-presentation – that makes them so enlivening. Their vocal range is elastic, floating from an elegant purr into an unvarnished, guttural growl, and then back again at a moment’s notice. Their writing can be dreamy, but more often plumbs the soul, pricking deep with a poet’s precision and showing the scars that remain. With a life that’s been charted across continent and conflict and an early adulthood spent pushing back against myopia and dogma, Saleh doesn’t resist traditional classifications as much as they transcend them. Their music is in conversation with their African ancestry and the future possibilities of the diaspora in a way that collapses the distinctions between global, local, personal and political. To listen to Dua Saleh is to hear, in real time, someone fight for the right to define themselves for themselves."},{"date":"2022-05-07T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/02/PinkPantheress_6899.jpeg","title":"PINKPANTHERESS WITH BUNS","url":"https://starlinesocialclub.com/event/pinkpantheress/","details":"PinkPantheress\nMay 7 2022 @ 8pm\n$25 adv // $30 dos\nvisuals by Mad Alchemy\nAll Ages"},{"date":"2022-05-08T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/The_79271650890788.jpeg","title":"THE 5TH BEAT SESSIONS: LIVE JAZZ IN THE CRYSTAL CAVERN","url":"https://starlinesocialclub.com/event/the-5th-beat-sessions-live-jazz-in-the-crystal-cavern-2/","details":"Starline Social Club Presents:\nThe 5th Beat Sessions:\nLive Jazz in the Crystal Cavern\nHosted by Mike Quigg\nEvery Sunday 7-9pm – Doors @ 6pm\nNo Cover – 21+"},{"date":"2022-05-09T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/03/Combo_71831647335161.jpeg","title":"COMBO CHIMBITA W/ ALMAS FRONTERIZAS \u0026 MARE E FRESH (OF CHULITA VINYL CLUB)","url":"https://starlinesocialclub.com/event/combo-chimbita-w-almas-fronterizas-mare-e-fresh-of-chulita-vinyl-club/","details":"Starline Social Club Presents\nCombo Chimbita\nAlmas Fronterizas\nMare E Fresh (of Chulita Vinyl Club)\nMonday May 9 2022 – Doors @ 7pm\n$22 adv // $25 dos\n18+\n——–\nDescribed by NPR’s Alt.Latino as an “otherworldly presence,” Combo Chimbita is the creative unity of Carolina Oliveros (vocals, guacharaca), Niño Lento es Fuego (guitar), Prince of Queens (bass, synthesizers) and Dilemastronauta (drums), who together transcend common concepts of time and nationality.\nAfro-Caribbean transcendance, bewildering chants, booming drums and psychedelic distortion lay the rhythmic foundation for IRÉ; a testament to the ever expanding scope of Combo Chimbita’s sonic palette and their modes of resistance in realms both spiritual and terrestrial.\n“Within the saga of Combo Chimbita,” reflects Niño Lento es Fuego about each of the band’s releases, “El Corredor del Jaguar (2016) finds this eternal being lost outside their realm and returning to Abya Yala (2017) in order to heal and restore peace to the continent. Ahomale (2019) appears as a guiding energy of resistance and now IRÉ (2022) represents those chosen to lead the revolution and materialize the good fortunes foretold in their divinations.” Like the jaguar before them, Combo Chimbita carries on; delicate, resilient and roaring."},{"date":"2022-05-10T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/Tuesday_74731649859421.jpeg","title":"TUESDAY NIGHT COMEDY AT STARLINE SOCIAL CLUB: LIVE IN THE CRYSTAL CAVERN","url":"https://starlinesocialclub.com/event/tuesday-night-comedy-at-starline-social-club-live-in-the-crystal-cavern-8/","details":"See the Bay’s best comedians every Tuesday night at the legendary Starline Social Club in Uptown Oakland. Featuring local favorites and rising stars from Netflix, late night TV, Comedy Central, SF Sketchfest and more, live in the Crystal Cavern!\nDoors at 6:30, show at 7:00 PM.\nProduced by DOPE SHOW Comedy. Featured in SF Weekly, East Bay Express, Yelp Bay Area, and more! Check out DopeShowComedy.com for more shows across San Francisco and Oakland. Follow us on Instagram @DopeShowBayArea!\n24-hour notice required for cancellations. Seating is first come, first serve. Parties later than 30-40 minutes may have their tickets sold at the door."},{"date":"2022-05-10T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/02/Juan_6901.jpeg","title":"JUAN WAUTERS W/ HEAVEN’S CLUB \u0026 STEPHEN STEINBRINK","url":"https://starlinesocialclub.com/event/juan-wauters-w-heavens-club-stephen-steinbrink/","details":"Starline Social Club Presents\nJuan Wauters\nHeaven’s Club\nStephen Steinbrink\nLive in the Ballroom\nTues May 10 2022 – Doors @ 7pm\n$15adv // $20dos\n18+\nJuan Wauters\nThere’s an almost mythological quality to the world of Juan Pablo Wauters. The Uruguayan-born, Jackson Heights, NY-dwelling musician is best known not for a specific musical style, but instead for the crystalline sincerity that underpins everything he does: from the heartfelt earnestness of his lyricism to the playful rituals of his live shows (singalongs, covers, races). To be a fan of his music is to be invited into the ever-expanding cast of characters that animate his work – Wauters has a knack for fostering community wherever he goes.\nA founding member of Queens garage act The Beets, Wauters began releasing music under his own name in 2014 with N.A.P. North American Poetry. Released on Captured Tracks, his solo debut had the same candid charm and DIY sound as his work with the Beets, but with a folk-inspired, introspective glaze that would become his signature. 2015’s Who, Me? honed in on those qualities, full of clever ruminations on the pace of day-to-day life sung in both English and his native Spanish.\nAfter the release of Who, Me? Wauters spent several years touring and travelling the world, including a long stint in Latin America — from Argentina, Uruguay, Peru, and Chile to Mexico and Puerto Rico — where he began working on his next project. Inviting local musicians to contribute to the songs he was working on, Wauters emerged with a collection steeped in the musical traditions of each country he’d visited. As a result, 2018’s La Onda De Juan Pablo and its follow-up, Introducing Juan Pablo, became his most expansive and sonically diverse records to date, tracing both his Uruguayan roots and his travellers’ spirit. Elements he’d flirted with in the past – singing in Spanish, traditional instruments like bongo drums and marimba, the collaborative spirit of his live shows – came to the forefront on these releases.\nWauters’ chameleonic songwriting has continued to evolve in recent years: on his latest effort, Real Life Situations, he’s delved deeper into collaboration, teaming up with Mac DeMarco, Peter Sagar (AKA Homeshake), Nick Hakim, Cola Boyy, El David Aguilar, and more for experiments in hip-hop, lo-fi R\u0026B, and deft indie folk. With some of his recording plans hampered by the COVID-19 pandemic, he mined older songs, phone notes, new material, and snippets from TV and YouTube to craft an aural document of the year through his eyes. Under his care, these small moments become coordinates for the peaks and valleys of human experience, coloring the album with Wauters’ unique shade of realism.\nPerhaps this realism is what makes Wauters such an inimitable artist. His music has always sprung from the interplay between genre-hopping eclecticism and earnest, plain-spoken observation. Themes of loneliness, personal growth, patience, and companionship arise again and again in his work, just as they do in life. Each time though, he manages to breathe new life into them – to listen to his music is to navigate a rapidly-changing world with him in real time. His unique ability to produce that feeling – via his music, his live show, even his social media presence – ensures that no matter where his travels take him, he’ll be welcomed with open arms."},{"date":"2022-05-11T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/Oakadelic_73451649329568.jpeg","title":"OAKADELIC WEDNESDAYS: LIVE FUNK SOUL \u0026 R\u0026B IN THE CRYSTAL CAVERN","url":"https://starlinesocialclub.com/event/oakadelic-wednesdays-live-funk-soul-rb-in-the-crystal-cavern-9/","details":"Oakadelic Wednesdays\nWednesday nights in the Crystal Cavern\n10pm // No Cover\n—–\nOakadelic Wednesdays is a weekly live funk, soul, R\u0026B and hip hop jam session at the center of Oakland’s live music scene. As a staple of the east bay, it has brought community together for more than 10 years. With a rotating cast of players each week in the houseband, and with a jam session to follow, it keeps people dancing and communing every time."},{"date":"2022-05-12T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/02/Gatecreeper_7069.jpeg","title":"GATECREEPER W/ NARROW HEAD, 200 STAB WOUNDS \u0026 FEARING","url":"https://starlinesocialclub.com/event/gatecreeper-w-narrow-head-200-stab-wounds-fearing/","details":"Starline Social Club Presents\nGATECREEPER\nNARROW HEAD\n200 STAB WOUNDS\nFEARING\nThurs May 13 2022 – Doors @ 6:30pm\n$20 adv // $25 dos\n18+\n—————\nGatecreeper was formed in September of 2013 with members originating from both Tucson and Phoenix, Arizona. After a debut 4-song EP a series of splits, the band signed to Relapse Records which resulted in the release of their debut full-length Sonoran Depravation on October 7th 2016. The band has since toured with Nails, Pallbearer, Code Orange, Skeletonwitch and more. Gatecreeper play crusty, doom-soaked death metal at its most infectious and uncompromising, with a massive sound that calls to mind the classic Swedish buzz-saw attack of Dismember and Grave mixed with the impeccable groove of Obituary and Bolt Thrower."},{"date":"2022-05-13T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/ONE_74291650122239.jpeg","title":"ONE NIGHT IN RIO FEAT. SF SAMBA, AQUARELA SAMBA DANCERS \u0026 DJ ABEL","url":"https://starlinesocialclub.com/event/one-night-in-rio-feat-sf-samba-aquarela-samba-dancers-dj-abel/","details":"Tuka Events Presents\nONE NIGHT IN RIO\nLive at Starline Social Club\n2236 MLK Jr Way\nOakland, CA 94612\nfeat.\nSF SAMBA \nAQUARELA SAMBA DANCERS\nDJ ABEL\nFriday May 13 2022 @ 9pm\n$20 adv // $25 dos\n21+\n———"},{"date":"2022-05-13T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/A_77231650197181.jpeg","title":"A POSITIVE MUSIC LISTENING EXPERIENCE FEAT. FEEFAWFUM, RELMS, AND THE EDOMITES VS LINCHPYN","url":"https://starlinesocialclub.com/event/a-positive-music-listening-experience-feat-feefawfum-relms-and-the-edomites-vs-linchpyn/","details":"Starline Social Club Presents:\nA Positive Music Listening Experience Vol 2\nFeat.\nFEEFAWFUM\nRELMS\nTHE EDOMITES VS LINCHPYN\nDJ MIKE BOO\nVisuals by Dr Rek\nFriday May 13 2022 – Doors @ 8pm\n$15\n18+\n———————–"},{"date":"2022-05-14T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/PIG_74101649701567.jpeg","title":"PIG DESTROYER W/ MORTUOUS \u0026 CARRION BLOOM","url":"https://starlinesocialclub.com/event/pig-destroyer-w-mortuous-carrion-bloom/","details":"Ennis Booking Presents:\nPIG DESTROYER\nMORTUOUS\nCARRION BLOOM\nSaturday May 14 2022 – Doors @ 8pm\n$26 // 18+\n———"},{"date":"2022-05-15T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/The_79301650890793.jpeg","title":"THE 5TH BEAT SESSIONS: LIVE JAZZ IN THE CRYSTAL CAVERN","url":"https://starlinesocialclub.com/event/the-5th-beat-sessions-live-jazz-in-the-crystal-cavern-3/","details":"Starline Social Club Presents:\nThe 5th Beat Sessions:\nLive Jazz in the Crystal Cavern\nHosted by Mike Quigg\nEvery Sunday 7-9pm – Doors @ 6pm\nNo Cover – 21+"},{"date":"2022-05-17T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/Tuesday_74351649780181.jpeg","title":"TUESDAY NIGHT COMEDY AT STARLINE SOCIAL CLUB: LIVE IN THE CRYSTAL CAVERN","url":"https://starlinesocialclub.com/event/tuesday-night-comedy-at-starline-social-club-live-in-the-crystal-cavern-9/","details":"See the Bay’s best comedians every Tuesday night at the legendary Starline Social Club in Uptown Oakland. Featuring local favorites and rising stars from Netflix, late night TV, Comedy Central, SF Sketchfest and more, live in the Crystal Cavern!\nDoors at 6:30, show at 7:00 PM.\nProduced by DOPE SHOW Comedy. Featured in SF Weekly, East Bay Express, Yelp Bay Area, and more! Check out DopeShowComedy.com for more shows across San Francisco and Oakland. Follow us on Instagram @DopeShowBayArea!\n24-hour notice required for cancellations. Seating is first come, first serve. Parties later than 30-40 minutes may have their tickets sold at the door."},{"date":"2022-05-18T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/Oakadelic_73481649329572.jpeg","title":"OAKADELIC WEDNESDAYS: LIVE FUNK SOUL \u0026 R\u0026B IN THE CRYSTAL CAVERN","url":"https://starlinesocialclub.com/event/oakadelic-wednesdays-live-funk-soul-rb-in-the-crystal-cavern-10/","details":"Oakadelic Wednesdays\nWednesday nights in the Crystal Cavern\n10pm // No Cover\n—–\nOakadelic Wednesdays is a weekly live funk, soul, R\u0026B and hip hop jam session at the center of Oakland’s live music scene. As a staple of the east bay, it has brought community together for more than 10 years. With a rotating cast of players each week in the houseband, and with a jam session to follow, it keeps people dancing and communing every time."},{"date":"2022-05-19T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/QUASAR_74461649781361.jpeg","title":"QUASAR VIBES: AN INTERGALACTIC AFRO GRAVITATION","url":"https://starlinesocialclub.com/event/quasar-vibes-an-intergalactic-afro-gravitation-2/","details":"Join us as we float through Amapiano, House, and other Afro-futuristic vibes. Dance music by aebldee and friends in the Crystal Cavern. \n9p no cover! Slide early!"},{"date":"2022-05-20T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/02/A_6903.jpeg","title":"A PLACE TO BURY STRANGERS W/ GLOVE","url":"https://starlinesocialclub.com/event/a-place-to-bury-strangers-w-glove/","details":"A Place To Bury Strangers\nGlove\nFriday May 20, 2022 @ 8pm\n$21 adv // $23 dos\n18+\n—-\nFans all over the globe know: Oliver Ackermann always brings surprises. The singer and guitarist of New York City’s A Place To Bury Strangers has been delighting and astonishing his audience for close to two decades, combining post-punk, noise-rock, shoegaze, psychedelia, and avant-garde music in startling and unexpected ways. As the founder of Death By Audio, creator of signal-scrambling stomp boxes and visionary instrument effects, he’s exported that excitement and invention to other artists who plug into his gear and blow minds. In concert, A Place To Bury Strangers is nothing short of astounding — a shamanistic experience that bathes listeners in glorious sound, crazed left turns, transcendent vibrations, real-time experiments, brilliant breakthroughs.\nAnd just as many of his peers in the New York City underground seem to be slowing down and settling in, Ackermann’s creativity is accelerating. He’s launched a label of his own: Dedstrange, dedicated to advancing the work of sonic renegades worldwide. He’s also refreshed the group’s lineup, adding bassist John Fedowitz and drummer Sandra Fedowitz, and the band has never sounded more current, or more courageous, or more accessibly melodic. The Hologram EP is the first release from the new lineup — and the first on Dedstrange — and it’s no overstatement to say that the reaction has been ecstatic. Ghettoblaster wrote that the band’s racket outpaced everything to emerge from New York City in the past decade. Brooklyn Vegan praised Ackermann’s “terrific, emotive” singing, and lauded the group’s recent commitment to foregrounding its melodies and lyrics. Pitchfork, Flood, AllMusic: they’ve all lined up to call Hologram an example of the best work of a tireless band with a deep discography and an unquenchable drive to create challenging, unprecedented music.  A Place To bury Strangers released their highly anticipated sixth album See Through You  February 4, 2022 to on their newly formed label Dedstrange to critical acclaim."},{"date":"2022-05-21T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/02/Strand_7040.jpeg","title":"STRAND OF OAKS W/ PAT FINNERTY","url":"https://starlinesocialclub.com/event/strand-of-oaks-w-pat-finnerty/","details":"Starline Social Club Presents\nStrand of Oaks\nPat Finnerty\nSaturday May 21 2022 – Doors at 7pm\n$18 adv // $22 dos\n18+\n——\nTo say In Heaven is about conquering grief would be oversimplifying everything Tim Showalter has achieved on the eighth studio album from Strand of Oaks. A stunning, hopeful reflection on love, loss, and enlightenment, In Heaven is a triumph in music making, and a preeminent addition to the Strand of Oaks discography. \nIn late 2018, Showalter’s wife, Sue, lost her mother in a car accident. Soon after, Stan, the cat they both adored, was diagnosed with terminal cancer. Showalter quit drinking so he could take better care of his wife and help rebuild the life they shared. And within months, they decided to pack up and move across the country from Philadelphia to Austin, Texas. It was an irrational decision made at the height of a terrible time, but it’s one that shaped so much of what In Heaven is about.\nIn Heaven was recorded in October 2020 with Kevin Ratterman at Invisible Creature in Los Angeles. Carl Broemel (My Morning Jacket) is featured on guitar throughout the record, while James Iha (The Smashing Pumpkins) contributed vocals and guitar for “Easter.” Bo Koster (MMJ, Roger Waters) provided keyboards, Cedric LeMoyne (Alanis Morrissette, Remy Zero) bass, Scott Moore violin, and Ratterman monstrous drums. Showalter also played a lot of synth on this record, which he hasn’t done since 2014’s HEAL. With clean sounds, Jeff Lynne-esque acoustics, and sophisticated songwriting, he approached In Heaven in a more poised and pop-leaning way than his past releases.\n“I wanted to strive for something greater than what I thought I was capable of.”"},{"date":"2022-05-21T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/The_79831651778269.jpeg","title":"THE CUPCAKIN LOUNGE FEAT RED CORVETTE, EMELLE, DAGHE","url":"https://starlinesocialclub.com/event/the-cupcakin-lounge-feat-red-corvette-emelle-daghe/","details":"The Cupcakin’ Lounge\nfeat.\nRed Corvette\nEmelle\nDaghe\nStarline Social Club – Crystal Cavern\nSaturday May 21 2022 @ 10pm\n$10\n21+\n————"},{"date":"2022-05-22T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/The_79331650890799.jpeg","title":"THE 5TH BEAT SESSIONS: LIVE JAZZ IN THE CRYSTAL CAVERN","url":"https://starlinesocialclub.com/event/the-5th-beat-sessions-live-jazz-in-the-crystal-cavern-4/","details":"Starline Social Club Presents:\nThe 5th Beat Sessions:\nLive Jazz in the Crystal Cavern\nHosted by Mike Quigg\nEvery Sunday 7-9pm – Doors @ 6pm\nNo Cover – 21+"}]