[{"date":"2022-05-20T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/02/A_6903.jpeg","title":"A PLACE TO BURY STRANGERS W/ GLOVE","url":"https://starlinesocialclub.com/event/a-place-to-bury-strangers-w-glove/","details":"A Place To Bury Strangers\nGlove\nFriday May 20, 2022 @ 8pm\n$21 adv // $23 dos\n18+\n—-\nFans all over the globe know: Oliver Ackermann always brings surprises. The singer and guitarist of New York City’s A Place To Bury Strangers has been delighting and astonishing his audience for close to two decades, combining post-punk, noise-rock, shoegaze, psychedelia, and avant-garde music in startling and unexpected ways. As the founder of Death By Audio, creator of signal-scrambling stomp boxes and visionary instrument effects, he’s exported that excitement and invention to other artists who plug into his gear and blow minds. In concert, A Place To Bury Strangers is nothing short of astounding — a shamanistic experience that bathes listeners in glorious sound, crazed left turns, transcendent vibrations, real-time experiments, brilliant breakthroughs.\nAnd just as many of his peers in the New York City underground seem to be slowing down and settling in, Ackermann’s creativity is accelerating. He’s launched a label of his own: Dedstrange, dedicated to advancing the work of sonic renegades worldwide. He’s also refreshed the group’s lineup, adding bassist John Fedowitz and drummer Sandra Fedowitz, and the band has never sounded more current, or more courageous, or more accessibly melodic. The Hologram EP is the first release from the new lineup — and the first on Dedstrange — and it’s no overstatement to say that the reaction has been ecstatic. Ghettoblaster wrote that the band’s racket outpaced everything to emerge from New York City in the past decade. Brooklyn Vegan praised Ackermann’s “terrific, emotive” singing, and lauded the group’s recent commitment to foregrounding its melodies and lyrics. Pitchfork, Flood, AllMusic: they’ve all lined up to call Hologram an example of the best work of a tireless band with a deep discography and an unquenchable drive to create challenging, unprecedented music.  A Place To bury Strangers released their highly anticipated sixth album See Through You  February 4, 2022 to on their newly formed label Dedstrange to critical acclaim."},{"date":"2022-05-21T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/02/Strand_7040.jpeg","title":"STRAND OF OAKS W/ PAT FINNERTY","url":"https://starlinesocialclub.com/event/strand-of-oaks-w-pat-finnerty/","details":"Starline Social Club Presents\nStrand of Oaks\nPat Finnerty\nSaturday May 21 2022 – Doors at 7pm\n$18 adv // $22 dos\n18+\n——\nTo say In Heaven is about conquering grief would be oversimplifying everything Tim Showalter has achieved on the eighth studio album from Strand of Oaks. A stunning, hopeful reflection on love, loss, and enlightenment, In Heaven is a triumph in music making, and a preeminent addition to the Strand of Oaks discography. \nIn late 2018, Showalter’s wife, Sue, lost her mother in a car accident. Soon after, Stan, the cat they both adored, was diagnosed with terminal cancer. Showalter quit drinking so he could take better care of his wife and help rebuild the life they shared. And within months, they decided to pack up and move across the country from Philadelphia to Austin, Texas. It was an irrational decision made at the height of a terrible time, but it’s one that shaped so much of what In Heaven is about.\nIn Heaven was recorded in October 2020 with Kevin Ratterman at Invisible Creature in Los Angeles. Carl Broemel (My Morning Jacket) is featured on guitar throughout the record, while James Iha (The Smashing Pumpkins) contributed vocals and guitar for “Easter.” Bo Koster (MMJ, Roger Waters) provided keyboards, Cedric LeMoyne (Alanis Morrissette, Remy Zero) bass, Scott Moore violin, and Ratterman monstrous drums. Showalter also played a lot of synth on this record, which he hasn’t done since 2014’s HEAL. With clean sounds, Jeff Lynne-esque acoustics, and sophisticated songwriting, he approached In Heaven in a more poised and pop-leaning way than his past releases.\n“I wanted to strive for something greater than what I thought I was capable of.”"},{"date":"2022-05-21T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/The_79831652037575.jpeg","title":"THE CUPCAKIN LOUNGE FEAT RED CORVETTE, EMELLE, DAGHE","url":"https://starlinesocialclub.com/event/the-cupcakin-lounge-feat-red-corvette-emelle-daghe/","details":"The Cupcakin’ Lounge\nfeat.\nRed Corvette\nEmelle\nDaghe\nStarline Social Club – Crystal Cavern\nSaturday May 21 2022 @ 10pm\n$10\n21+\n————"},{"date":"2022-05-22T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/The_79331650890799.jpeg","title":"THE 5TH BEAT SESSIONS: LIVE JAZZ IN THE CRYSTAL CAVERN","url":"https://starlinesocialclub.com/event/the-5th-beat-sessions-live-jazz-in-the-crystal-cavern-4/","details":"Starline Social Club Presents:\nThe 5th Beat Sessions:\nLive Jazz in the Crystal Cavern\nHosted by Mike Quigg\nEvery Sunday 7-9pm – Doors @ 6pm\nNo Cover – 21+"},{"date":"2022-05-22T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/02/An_6905.jpeg","title":"AN EVENING WITH ROBYN HITCHCOCK","url":"https://starlinesocialclub.com/event/an-evening-with-robyn-hitchcock/","details":"An evening with Robyn Hitchcock\nSunday May 22 2022 @ 7pm\n$30 adv // $34 dos\n18+\n—\nRobyn Hitchcock is one of England’s most enduring contemporary singer/songwriters and live performers. A surrealist poet, talented guitarist, cult artist and musician’s musician, Hitchcock is among alternative rock’s father figures and is the closest thing the genre has to a Bob Dylan (not coincidentally his biggest musical inspiration).\nSince founding the art-rock band The Soft Boys in 1976, Robyn has recorded more than 20 albums as well as starred in ‘Storefront Hitchcock’ an in concert film recorded in New York and directed by Jonathan Demme.\nBlending folk and psychedelia with a wry British nihilism, Robyn describes his songs as ‘paintings you can listen to’. His most recent album is self-titled and marks his 21st release as a solo artist. Out on April 21 2017, the album is produced by Brendan Benson (The Raconteurs). Hitchcock describes it as a “ecstatic work of negativity with nary a dreary groove.”\nIt has received rave reviews from UNCUT, Rolling Stone, Paste, Tidal and more.\n“A gifted melodist, Hitchcock nests engaging lyrics in some of the most bracing, rainbow-hued pop this side of Revolver. He wrests inspiration not from ordinary life but from extraordinary imaginings…” – Rolling Stone\n“These 10 gems slither, rock, roll, glide and shapeshift, coalescing around Hitchcock’s typically anxious, strained but striking and immediately identifiable vocals.” – American Songwriter\n“Beloved of everyone from Led Zeppelin to REM, Hitchcock has only enhanced his status with this wonderful outing.” – Hot Press\n“Witty, moving and seriously catchy, Robyn Hitchcock is a glorious return for a man who wasn’t really gone in the first place.” – Paste Magazine"},{"date":"2022-05-24T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/02/Jenny_6907.jpeg","title":"JENNY HVAL W/ DISCOVERY ZONE","url":"https://starlinesocialclub.com/event/jenny-hval-w-discovery-zone/","details":"Jenny Hval\nDoors: 7pm\nShow: 8pm"},{"date":"2022-05-25T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/Oakadelic_73511649329576.jpeg","title":"OAKADELIC WEDNESDAYS: LIVE FUNK SOUL \u0026 R\u0026B IN THE CRYSTAL CAVERN","url":"https://starlinesocialclub.com/event/oakadelic-wednesdays-live-funk-soul-rb-in-the-crystal-cavern-11/","details":"Oakadelic Wednesdays\nWednesday nights in the Crystal Cavern\n10pm // No Cover\n—–\nOakadelic Wednesdays is a weekly live funk, soul, R\u0026B and hip hop jam session at the center of Oakland’s live music scene. As a staple of the east bay, it has brought community together for more than 10 years. With a rotating cast of players each week in the houseband, and with a jam session to follow, it keeps people dancing and communing every time."},{"date":"2022-05-26T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/02/Jeromes_7006.jpeg","title":"JEROMES DREAM W/ FLORAL, STATE FAULTS, HAWAK","url":"https://starlinesocialclub.com/event/jeromes-dream-w-floral-state-faults-hawak/","details":"Starline Social Club and The Hard Times Shows Present:\nJEROMES DREAM\nFLORAL\nSTATE FAULTS\nHAWAK\nThursday May 26 2022 – Doors 7pm\n$20 adv // $25 dos\n18+\n——–\nJeromes Dream formed during the burgeoning post-hardcore and emo era of the mid-90s, when a surge of new genres and subgenres spread like wildfire and would become the foundation of an entirely new music scene. Created in the basements of Connecticut in 1997, Jeromes Dream began as a result of personal uncertainty, instability, loss, and rage. Jeff Smith (bass, vocals) Nick Antonopoulos (guitar), and Erik Ratensperger (drums) created an aural violence in their dynamic and unpredictable songs. At that time, bands like Orchid, Reversal of Man, and pageninetynine were making similarly polemic music. But Jeromes Dream carved its own path and helped to define the subgenre that would come to be known as emo-violence.\nIn 2001, Jeromes Dream recorded and released their final record “Presents” before disbanding that same year. “Presents” was a deliberate departure from anything the band did previously, which included a more refined and technical sound and new vocal stylings from singer Jeff Smith. On “Presents” Jeromes Dream felt that they were creatively in uncharted territory, and embraced it throughout the writing process. It was a liberating time for the band, and they did not adhere to rules or preconceived notions as to how the album “should” sound. “Presents” was simultaneously cynical and personal, and yet still drew from the depths of their collective creative expression. Jeromes Dream development of “Presents” culminated in early 2001 when they worked with Converge guitarist Kurt Ballou at God City Studios, bringing the record to life before being released. “Presents” remains an important installation of Jeromes Dream, and a work that they remain proud of.\nIn 2018, Jeromes Dream announced that they would reunite and begin writing a new record together as a band. The response was overwhelming, with fans from all over the world hailing the reunion. In March 2019 the band entered the studio and created a 12-song untitled LP, which they released on their own label, Microspy. Shortly after the LP release, Jeromes Dream became a fully active band again and spent the better part of the following year on tour with the likes of Loma Prieta, Gouge Away, Soul Glo, Touché Amoré, and Daughters. Before everything halted with the pandemic.\nFast forward to 2022 and JD is finishing up a new record, and will be announcing more shows as the year progresses."},{"date":"2022-05-27T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/03/The_7074.jpeg","title":"THE SUFFERS W/ THE GREASETRAPS","url":"https://starlinesocialclub.com/event/the-suffers-w-the-greasetraps/","details":"Starline Social Club and Bottlerock Present\nThe Suffers\nThe Greasetraps\nFriday May 27 2022 – Doors @ 8pm\n$20 adv // $25 dos\n18+\n———-\nThere is a contagious and combustible energy every time the eight-piece band The Suffers steps on the scene. NPR’s Bob Boilen attributes the band’s allure to their “Soul, straight from horn to heart.” He adds, “This band is on fire when it’s in front of an audience…but the intensity of their shows are also captured in the studio.” Following The Suffers’ electrifying late night TV debut on Letterman in 2015, David Letterman exclaimed, “If you can’t do this, get out of the business!” There is something undeniable about The Suffers (whose name is a reference to the 1978 Jamaican film Rockers starring Leroy “Horsemouth” Wallace, Jacob Miller and Burning Spear, among others), that instantly hits home with their audiences. “We make music for all people,” says lead vocalist Kam Franklin. “At this point, we’ve played all over the world and one thing is certain – if the music is good, the people will enjoy it.” Since 2011, the H-Town heroes have been on a steady grind and have no plans of stopping.\nThe Suffers exploded onto the scene in 2015 with their dazzling EP Make Some Room, which was followed by their critically heralded self-titled debut in 2016. The Suffers’ released their latest record Everything Here on Shanachie Records July 13, 2018. Everything Here is the band’s most bold statement yet.  Lead Singer Kam Franklin states, “Our hope is that our fans walk away feeling empowered, resilient, and inspired to live a better life.”\nGuitarist Kevin Bernier says, “Everything Here, as a whole, explores the many aspects of who we are as people through songs. We’ve had crushes on people, we’ve had our hearts broken, and we’ve moved through all the difficult times so that we can experience the joyful moments.” The Suffers have got everything you need and there’s no need to look further – a heaping dose of soul, a dash of reggae, a splash of jazz, a pinch of salsa, a hint of rock ‘n’ roll and a dollop of hip hop and funk – and that is just a few ingredients simmering inside their magical Gulf Coast soul. \n “Houston has played a huge part in making me who I am and introducing our music to the masses, and for that, we are forever grateful.” The Suffers have played sold out shows in Japan and Latin America, turned out audiences at the Newport Folk Festival and Afropunk Festival and made believers of just about anyone who has experienced their live shows. “We’re a testament to teamwork and camaraderie resulting in things working out even when the odds are against a positive outcome,” says drummer Nick Zamora. “The wonderful thing about music is that it is ultimate universal communication,” reflects trumpeter Jon Durbin.\nThe band is working on their highly anticipated follow up to Everything Here, and will release new music in the Fall of 2021."},{"date":"2022-05-28T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/Erin_80551652636210.jpeg","title":"ERIN DURANT W/ SHELLEY BURGON \u0026 HECTORINE","url":"https://starlinesocialclub.com/event/erin-durant-w-shelley-burgon-hectorine/","details":"Starline Social Club Presents\nERIN DURANT\nSHELLEY BURGON\nHECTORINE\nSaturday May 28 2022 – Doors @ 6pm\n$16\n18+\n————"},{"date":"2022-05-28T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/03/Kinky_72641648590383.jpeg","title":"KINKY W/ KAVARZEE","url":"https://starlinesocialclub.com/event/kinky-w-kavarzee/","details":"Starline Social Club and Bottlerock Present:\nKINKY\nKAVARZEE\nSaturday May 28, 2022 – Doors @ 8pm\n$35 adv // $40 dos\n18+\n——–"},{"date":"2022-05-29T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/The_79361650890804.jpeg","title":"THE 5TH BEAT SESSIONS: LIVE JAZZ IN THE CRYSTAL CAVERN","url":"https://starlinesocialclub.com/event/the-5th-beat-sessions-live-jazz-in-the-crystal-cavern-5/","details":"Starline Social Club Presents:\nThe 5th Beat Sessions:\nLive Jazz in the Crystal Cavern\nHosted by Mike Quigg\nEvery Sunday 7-9pm – Doors @ 6pm\nNo Cover – 21+"},{"date":"2022-05-29T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/02/VINCINT_6909.jpeg","title":"VINCINT W/ MARIO JOSE","url":"https://starlinesocialclub.com/event/vincint-w-mario-jose/","details":"VINCINT\nMario Jose\nDoors: 7pm\nShow: 8pm"},{"date":"2022-06-02T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/Oakland_80271652314590.jpeg","title":"OAKLAND ART LIBRARY: JUNE EVENT NIGHT","url":"https://starlinesocialclub.com/event/oakland-art-library-june-event-night/","details":"Oakland Art Library: June Event Night\nThursday June 2nd 2022 6-11pm\nFREE – SLIDE THROUGH"},{"date":"2022-06-03T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/Queens_74211649851612.jpeg","title":"QUEENS OF THE UNDERGROUND VOL 3 FEAT. ALLY COCAINE \u0026 MORE","url":"https://starlinesocialclub.com/event/queens-of-the-underground-vol-3-feat-ally-cocaine-more/","details":"Starline Social Club Presents:\nQUEENS OF THE UNDERGROUND VOL 3\nstarring\nALLY COCAINE\nDAYDAY ROCKSTARTHUG\nVERSOUL\nTELICE (of PXSSYPOWERDANCE CREW)\nDJ STONEY CREATION\nHosted by SNOWY GEE\nFriday June 3 2022 – Doors @ 8pm\n$15 advance // $20 day of show\n18+\n——–\nAbout Queens of the Underground: \nQueens of the Underground is a quarterly all women, Hip Hop, concert series. Our mission is to provide equitable spaces for women-identified artists to shine in the male-dominated culture of Hip Hop. We promote the diversity of Women’s experiences, in contrast to the limited hyper-sexualized narrative that permeates the mainstream.\n\n\nAbout the Event: \nWe are representing Oakland for this upcoming June Showcase, for our special “Queens of the Underground: The Town Edition”.  We are excited to announce our Oakland native  headliner, Ally Cocaine. Supporting musical acts include DayDay Rockstarthug, Keidra, and Versoul, with turf dance performance by Telice of Pxssy Power Dance crew. The show will be hosted by Snowy Gee  with sounds by  DJ Stoney Creation. There will also be women-owned businesses vending throughout the night and a dance party at the end of the show.  For more information check out our website www.queensoftheunderground.com and follow us on Instagram @QueensOfTheUndergroundShow"}]