[{"date":"2022-06-01T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/Oakadelic_81391653234963.jpeg","title":"OAKADELIC WEDNESDAYS: LIVE FUNK SOUL \u0026 R\u0026B IN THE CRYSTAL CAVERN","url":"https://starlinesocialclub.com/event/oakadelic-wednesdays-live-funk-soul-rb-in-the-crystal-cavern-12/","details":"Oakadelic Wednesdays\nWednesday nights in the Crystal Cavern\n10pm // No Cover\n—–\nOakadelic Wednesdays is a weekly live funk, soul, R\u0026B and hip hop jam session at the center of Oakland’s live music scene. As a staple of the east bay, it has brought community together for more than 10 years. With a rotating cast of players each week in the houseband, and with a jam session to follow, it keeps people dancing and communing every time."},{"date":"2022-06-02T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/Oakland_80271652314590.jpeg","title":"OAKLAND ART LIBRARY: JUNE EVENT NIGHT","url":"https://starlinesocialclub.com/event/oakland-art-library-june-event-night/","details":"Oakland Art Library: June Event Night\nThursday June 2nd 2022 6-11pm\nFREE – SLIDE THROUGH"},{"date":"2022-06-03T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/Queens_74211649851612.jpeg","title":"QUEENS OF THE UNDERGROUND VOL 3 FEAT. ALLY COCAINE \u0026 MORE","url":"https://starlinesocialclub.com/event/queens-of-the-underground-vol-3-feat-ally-cocaine-more/","details":"Starline Social Club Presents:\nQUEENS OF THE UNDERGROUND VOL 3\nstarring\nALLY COCAINE\nDAYDAY ROCKSTARTHUG\nVERSOUL\nTELICE (of PXSSYPOWERDANCE CREW)\nDJ STONEY CREATION\nHosted by SNOWY GEE\nFriday June 3 2022 – Doors @ 8pm\n$15 advance // $20 day of show\n18+\n——–\nAbout Queens of the Underground: \nQueens of the Underground is a quarterly all women, Hip Hop, concert series. Our mission is to provide equitable spaces for women-identified artists to shine in the male-dominated culture of Hip Hop. We promote the diversity of Women’s experiences, in contrast to the limited hyper-sexualized narrative that permeates the mainstream.\n\n\nAbout the Event: \nWe are representing Oakland for this upcoming June Showcase, for our special “Queens of the Underground: The Town Edition”.  We are excited to announce our Oakland native  headliner, Ally Cocaine. Supporting musical acts include DayDay Rockstarthug, Keidra, and Versoul, with turf dance performance by Telice of Pxssy Power Dance crew. The show will be hosted by Snowy Gee  with sounds by  DJ Stoney Creation. There will also be women-owned businesses vending throughout the night and a dance party at the end of the show.  For more information check out our website www.queensoftheunderground.com and follow us on Instagram @QueensOfTheUndergroundShow"},{"date":"2022-06-04T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/WOOSUNG_72981649059649.jpeg","title":"WOOSUNG PRESENTS: MOTH EP SHOWCASE","url":"https://starlinesocialclub.com/event/woosung-presents-moth-ep-showcase/","details":"Starline Social Club Presents\nWOOSUNG\nMoth EP Showcase\n**NOTE** – VIP Ticket holders can bring gifts to the show but sending to the address below would be preferred:\nWoo Sung Kim\n2106 W. Artesia Blvd #1008\nTorrance, CA 90504\nWoosung will not be able to accept gifts at the show. Thanks for the support!\nSat June 4, 2022 – Doors @ 7pm\n$25 adv // $30 dos // $200 meet \u0026 greet\nAll Ages\n——\nWOOSUNG is a Korean-American musician, singer, songwriter, and composer, best known for being the vocalist and electric guitarist of South Korean band The Rose. Debuting in 2017 with the soft-rock hit “Sorry,” The Rose was named one of the “New K-Pop Artists to Watch” by Billboard. They subsequently broke into the top 10 of Billboard’s “Next Big Sound,” “World Digital Song Sales” and “World Albums” charts with the EPs, Dawn and Void, the latter of which also hit #1 on the U.S. iTunes’ K-Pop Albums chart, solidifying the band’s dominance as one of the fastest accelerating artists across the internet. \nAs the frontman of The Rose, Woosung made his solo debut in 2019 with the EP, Wolf, and its title single, “Face,” quickly racking up nearly 20 million views on YouTube. In 2020, Woosung lent his vocals to the original soundtrack of award-winning K-drama series, Itaewon Class. A multifaceted performer, Woosung released his debut feature-length album, Genre, in December of 2021 and has an upcoming EP, Moth, set to be released this spring via Transparent Arts. He is currently on the North American tour as the opening act for the legendary South Korean hip hop group Epik High.\nHe currently resides in Los Angeles. \nInstagram: @iwoosung – 1.2M "},{"date":"2022-06-05T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/The_79451650891362.jpeg","title":"THE 5TH BEAT SESSIONS: LIVE JAZZ IN THE CRYSTAL CAVERN","url":"https://starlinesocialclub.com/event/the-5th-beat-sessions-live-jazz-in-the-crystal-cavern-6/","details":"Starline Social Club Presents:\nThe 5th Beat Sessions:\nLive Jazz in the Crystal Cavern\nHosted by Mike Quigg\nEvery Sunday 7-9pm – Doors @ 6pm\nNo Cover – 21+"},{"date":"2022-06-08T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/Oakadelic_81421653234967.jpeg","title":"OAKADELIC WEDNESDAYS: LIVE FUNK SOUL \u0026 R\u0026B IN THE CRYSTAL CAVERN","url":"https://starlinesocialclub.com/event/oakadelic-wednesdays-live-funk-soul-rb-in-the-crystal-cavern-13/","details":"Oakadelic Wednesdays\nWednesday nights in the Crystal Cavern\n10pm // No Cover\n—–\nOakadelic Wednesdays is a weekly live funk, soul, R\u0026B and hip hop jam session at the center of Oakland’s live music scene. As a staple of the east bay, it has brought community together for more than 10 years. With a rotating cast of players each week in the houseband, and with a jam session to follow, it keeps people dancing and communing every time."},{"date":"2022-06-10T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/02/Emily_6911.jpeg","title":"EMILY WELLS W/ ARTHUR MOON","url":"https://starlinesocialclub.com/event/emily-wells-w-arthur-moon/","details":"Emily Wells\nFriday June 10, 2022 – Doors 8pm // Show 9pm\n$18 adv // $20 dos\n18+\n——–\nEmily Wells\n“Quietly transfixing” composer / producer Emily Wells is known for her varied use of classical and modern instrumentation, “a master of blending the worlds of classical and electronics” (NPR) and “dramatic, meticulous and gothic songs” (New York Times). On stage Wells’ builds a “new instrument” out of acoustic and electronic drums, synth, violin, and her evocative performances leave audiences equal parts dancing and grieving. Wells’ latest work, This World is Too _____ For You released in March has been hailed by NPR as “breathtaking” “mind-blowing” and “visionary”. The ten song album, arranged for chamber ensemble by composer Michi Wiancko, was commissioned by Saint Paul Chamber Orchestra’s Liquid Music Series and Metropolis Ensemble who performs on the album along with drummer / composer Shayna Dunkelman (Du Yun, Xiu Xiu).\n“The new songs are the rub between desire for, and desire to strip oneself of all wanting” Wells says of the new material, which clamors around all the edges, and sometimes into the center of our collective uncertainties.\n“I grew up with hymns and I often find myself drawn to a form that seeks redemption, even for transgressions unknown… they are an offering, an oath. As a queer kid raised in the south and the midwest by a music minister and a preacher’s daughter I am interested in the reclamation of themes and ideas that have often been used to constrain me.” Of Wells’ video work, which accompanies her performances, she says, “the video and the songs are mirrors of one another: grace, the body, movement, and the natural world, beating against our windows, drunk with the answer.”"},{"date":"2022-06-10T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/05/Treasvre_80831652894762.jpeg","title":"TREASVRE W/ PLEEAY \u0026 JAH’S TIN","url":"https://starlinesocialclub.com/event/treasvre-w-pleeay-jahs-tin/","details":"Starline Social Club Presents\nTREASVRE\nPLEEAY\nJAH’S TIN\nLive in the Crystal Cavern\nFriday June 10 2022 – Doors @ 8pm\n$12 adv // $15 dos\n18+\n————–"},{"date":"2022-06-11T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/04/Artemisia_74171649772758.jpeg","title":"ARTEMISIA (EP RELEASE) W/ ADRIENNE SHAMSZAD","url":"https://starlinesocialclub.com/event/artemisia-ep-release-w-adrienne-shamszad/","details":"Starline Social Club Presents\n**RESCHEDULED FROM 4/8/22**\nLive in the Crystal Cavern:\nArtemisia\nw/ support from Adrienne Shamszad\nSaturday Jan 29 2022 @ 7pm\n$16\n18+\n—–\nArtemisia\nThere is a haunting beauty to the music of Artemisia. Inspired by Appalachian folk harmonies, 80’s synth soundtracks, and ghosts, the trio features vocal harmonies that weave tightly together, shimmering above the polyrhythmic harp and soaring violin. A dreamy spaciousness fills their arrangements and wistful melodies linger long after the final note has faded.\nThe Oakland-based trio began as a duo when Selene Ross (vocals, ukulele, guitar, autoharp, dulcimer) and Alisa Rose (vocals, harp, guitar) met in the misty Berkeley Hills in 2018. They recorded a debut collection of songs in the Joshua Tree desert in early 2021, made possible by the gentle heart of Anthony Ferraro (Toro y Moi, Astronauts, etc.), and were joined in the summer of 2021 by Ariel Wang on violin.\nThis spring they celebrate the release of their debut EP.\nAdrienne Shamszad\nAn Oakland, California native of Iranian heritage, Adrienne Shamszad sings revolutionary anthems, prayerful power ballads, blues, lullabies, and love songs in English and in Farsi. Her strong and soulful voice, expressive guitar work and bold performance style have made her a popular West Coast performer for over a decade.  \nHer musical artistry is indeed something to behold. She is mystical, yet earthy. At one moment lofty, the next low-down. Adrienne’s poetry is intimate and genuine, inspired by the mystic Poets of Iran as much as the folk poet-songwriters of the 60s and 70s. She can transform a stage into a sacred place with the magic of her voice. Then, she sweeps you away on a musical journey through improvisation, folk melodies, Indian mantra, rock and roll, rhythm and blues, and Iranian classics."},{"date":"2022-06-11T00:00:00.000+00:00","img":"https://starlinesocialclub.com/wp-content/uploads/2022/02/Jerry_6913.jpeg","title":"JERRY PAPER W/ MAYLEE TODD","url":"https://starlinesocialclub.com/event/jerry-paper-w-maylee-todd/","details":"Saturday June 11 2022 @ 8pm\nJERRY PAPER\nMAYLEE TODD\n$16 adv // $18 dos\n18+\n—–\nJerry Paper is Lucas Nathan. Jerry Paper is instant coffee, bullshit jobs, weekly therapy sessions, crises of conscience, corporate mascots, 5meo-DMT trips, jokers down on their luck, surveillance, a jacked dad high on meth at a child’s party, apologies, trash cans, cacti, and the magic of words. From its initial days as a DIY solo synth project in the early 2010s to its current incarnation as a five-piece band, Jerry Paper has always been the earthly conduit for the wild and uncanny imagination of its creative mastermind.\nIn 2019, back from traveling the world for the I Am Begging You To Come To These Shows tour, Jerry Paper hung up their flowing dress and sandals, glided into the studio, and began giving material form to their new musical manifestation: Abracadabra.\nOver thirteen songs, they serve up a blend of jazzy instrumentation with soft-rock stylings and some seriously catchy earworms, forging a style that hints at the avant-pop of Scott Walker, the sweet enchantment of Paul McCartney, and the cryptic, smooth grooves of Steely Dan.\nLike all good stories, Abracadabra boasts unforgettable characters: someone with a victim complex (“Cholla”); an alien captive surveilled by a mysterious presence (“Puppeteer”), and a buff man whose life is thrown into shambles when he is caught smoking methamphetamine at his child’s birthday party (“Body Builder on the Shore”). Nathan’s interest in talk therapy led to “Spit It Out”, a song about the health-inducing qualities of improvised speech; “Memorial Highway” is about existence after death in other people’s memories, and “Apologist” and “All I Need” affirm the value — and occasional futility — of recognizing one’s wrongs. Building new realities out of words and sounds is no easy task, and on “Trash Can”, Nathan mourns the frustrations of the creative process.\nAbracadabra is many things at once: arch and sincere, bizarre and all too real, funny and melancholic — the work of an artist living in a world when despair so often tips over into ridiculousness, sometimes the only thing left to do is laugh.\nNathan worked with longtime visual collaborator Steve Smith and avant-comedian Alan Resnick to create the album art, which depicts an alien outsider spotting someone he recognizes. Who could it be? Don’t worry. Sit back, relax, and let Abracadabra cast its spell."}]