[{"date":"2022-05-30T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiZTU1YzMxMGYtYjMyYy00OTRiLTk0ZDktZjhkYjFkZWM4OTIwIiwiZWRpdHMiOnt9fQ==","title":"Ana Tijoux","url":"https://wl.seetickets.us/event/Ana-Tijoux/474381?afflky=TheChapel","details":"$30 advance and $33 day of show \nFor information on our current COVID policy, please click here. \n\nAna Tijoux\nOne of the most respected MCs in any language, Ana Tijoux has been winning over fans around the world since her debut ‘1977’ bubbled up from an underground sensation into mainstream recognition after being featured on the hit TV show ‘Breaking Bad’ and favorited by Radiohead’s Thom Yorke.\nAna Tijoux’s new album ‘Vengo’ showcase the nimble MC over lush, golden-era hip-hop production rooted in traditional Latin instrumentation. Rolling Stone named her performance at SXSW on of the best concerts of this year’s festival, while the New York Times has called her “South America’s answer to Lauryn Hill: equally skillful at singing and rapping.” Born in France to Chilean parents in political exile during Pinochet’s dictatorship, Tijoux moved back to Chile as a teenager and found a home in the emerging hip-hop scene of Santiago.\nIn concert, Tijoux takes the stage with a full band that brings to life the intricate arrangements of the new album, a whirlwind trip through hip-hop, jazz, and funk, spiced with a bit of politics and her great sense of humor that has led audiences around the globe fall in love with her.\nLoco Tranquilo\nCombining his love of music and adventure, Julián Gervasi writes, produces and performs under the moniker Loco Tranquilo to bring a genre-bending blend of ethereal vocals and freak folk instrumentation.\nFollowing childhood beginnings of learning the guitar by listening to his father’s records,and bohemian experiences living and playing music on the streets of Buenos Aires, Madrid and California, he has been making music in the creative swirl of San Francisco since 2013.\nHis key musical influences and inspirations – including Devendra Banhart, Mac Demarco, T. Rex, Kurt Cobain and David Bowie – have informed and evolved his unique sound of psychedelic, dream-pop, surf-rock melodies.\n“For the majority of people that hear Tropicalia artists and those of a similar ilk, the experience is akin to seeing colour for the first time. Music never felt as flavoursome, rich and well-intended. If you have not yet heard that kind of music, Loco Tranquilo could well represent your portal into a holy world of sound.”"},{"date":"2022-06-02T00:00:00.000+00:00","img":"","title":"2022 Banding Together to End Domestic Violence","url":"https://givebutter.com/BandingTogether22","details":""},{"date":"2022-06-03T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiYTI0NTczYjUtZTk1Yi00NGI0LWJmNDgtYmI3YjNlMGIwMzgzIiwiZWRpdHMiOnt9fQ==","title":"Bedouine","url":"https://wl.seetickets.us/event/Bedouine/465685?afflky=TheChapel","details":"$20 advance and $22 day of show\nCOVID POLICY FOR THIS SHOW PER THE ARTIST'S REQUEST: Proof of vaccination or negative test (within 48 hours) is required for entry.\nPlease note this show has been rescheduled from January 12, 2022. All original tickets remain valid. \nBedouine, a gallicized riff on bedouin, the nomad, the wanderer. Anyone can assume such a name, but Azniv Korkejian has an experience of what it means, the type of ground it covers. “Moving around so much caused me at some point to feel displaced, to not really belong anywhere and I thought that was a good title.” Her development was shaped by political landscapes and family opportunities, her adult life patterned by paths of her own. Born in Aleppo, Syria to Armenian parents, Korkejian spent her childhood in Saudi Arabia, moving to America when her family won a Green Card lottery. They settled in Boston, then Houston, but she split for L.A. as soon as she could. A casual offer to stay on a horse farm took her to the rolling hills of Lexington, Kentucky, followed by a year in Austin, and a trip east to Savannah for a degree in sound design. Returning to L.A., she discovered a close-knit community of musicians in Echo Park that started to feel like home. Maybe America is just a highway that leads back to L.A.\nKorkejian works with sound professionally, in dialogue editing and music editing, a slice of Hollywood’s sprawling industry. She never set out to be a singer in L.A., taking a zen approach to that part of her life, thinking that if it happens, it happens. “I just kept meeting the right people, who were professional musicians, and even though they were going on these big legitimate tours, they were still coming back to this amazing small scene, still demoing at home, and I immediately felt welcomed to join in on that. L.A. actually made me less jaded.” One day she walked into the studio of bass player / producer Gus Seyffert (Beck, Norah Jones, The Black Keys) to inquire about portable reel-to-reel tape machines and ended up cutting “Solitary Daughter in a first take. So they began another kind of journey.\nBedouine has a sound. Sixties folk meets seventies country-funk with a glimmer of bossa nova cool. Lithe guitar picking and precise lyrical excursions. That mesmerizing voice and phrasing. Working on around thirty tracks over three years, with contributions from a remarkable cast of players like guitarist Smokey Hormel (Tom Waits, Joe Strummer, Johnny Cash), Seyffert and Korkejian brought a selection of ten songs to Richmond, Virginia. She specifically sought out Spacebomb, approaching Matthew E. White after a show in L.A. He remembers listening to the song she sent over and over, on and off the road, “‘One of These Days’ became our alarm when we woke up for almost all of that tour.” Anticipating this future collaboration, the tracks were created with breathing room for the Spacebomb touch and Trey Pollard’s sinuous symphonic arrangements. Back in California, Thom Monahan (Pernice Brothers, Devendra Banhart, Vetiver) brought all the elements together in a masterful final mix.\nEschewing notions of nomadic chic, Bedouine represents minimalism motivated by travel, paring down and paring down until only the essential remains. Her music establishes a sustained and complete mood, reflecting on the unending reverberations of displacement, unafraid to take pleasure along the way. At the end of “Summer Cold” Korkejian composed an interstitial piece to recreate the sounds of her grandmother’s street in Aleppo. Partly due to America’s role in destabilizing Syria, this sonic memory is the only way to return to her birthplace. Worlds that have been lost might only be accessed through a song, in a line or a melody or a trace of tape, but they must be looked for in order to be found, so she wanders on."},{"date":"2022-06-04T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiYTA3MTYxOTMtMDM2Zi00OTQyLTk3YmYtYTAwZjM4Y2I5MGM0IiwiZWRpdHMiOnt9fQ==","title":"Monophonics","url":"https://wl.seetickets.us/event/Monophonics/474710?afflky=TheChapel","details":"$35 advance and $40 day of show\nNOTE: There is no opener for this show\nFor information on our current COVID policy, please click here. \nThe world's premier psychedelic soul band, Monophonics, cordially invites you to attend the grand re-opening of the once thriving, once vibrant establishment, the legendary Sage Motel. A place where folks experience the highs and lows of human existence. A place where big dreams and broken hearts live, where people arrive without ever knowing how they got there. It's where individuals find themselves at a crossroads in life.\nWhat started as a quaint motor lodge and a common pitstop for travelers and truckers in the 1940s morphed into a bohemian’s hang by the 1960s and 1970s. Artists, musicians, and vagabonds of all types would stop there as seedy ownership pumped obnoxious amounts of money into high end renovations, eventually attracting some of the most prominent acts of the era. But when the money ran out, The Sage Motel devolved into a place where you rent by the hour."},{"date":"2022-06-05T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiNzFjN2MwMDQtNmM2OC00OGYzLTlhMzAtZDAyZTUzN2MwNzJjIiwiZWRpdHMiOnt9fQ==","title":"Sugar Candy Mountain","url":"https://wl.seetickets.us/event/Sugar-CandyMountain/465687?afflky=TheChapel","details":"$16 advance and $18 day of show\nFor information on our current COVID policy, please click here. \nPlease note this show has been rescheduled from January 27, 2022. All original tickets remain valid. \nHelping to spearhead a revival of neo-psychedelic pop, California's Sugar Candy Mountain fuses sunny, retro sounds with lush, sophisticated composition. Blending classic '60s West Coast psychedelia with pastoral folk and pulling inspiration from pop experimentalists and Brazilian Tropicalia. Their latest album \"Do Right\" takes a more modern approach layering vibrant synths alongside more organic instrumentation. Oscillating between the hazy psychedelic pop of Mild High Club, the driving energy of Tame Impala and the danceable familiarity of The Supremes, the band is a perfect cocktail of old and new, imploring the listener to take a ride into the sunset with Sugar Candy Mountain."}]