[{"date":"2022-05-06T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiN2RiYzVkNTQtMzdmOC00ZGNlLWIwZDAtNGU2YTg1MWFjZThiIiwiZWRpdHMiOnt9fQ==","title":"The Mother Hips (rescheduled from 4/23)","url":"https://wl.seetickets.us/event/The-MotherHipsrescheduledfrom423/472358?afflky=TheChapel","details":"$28 advance and $30 day of show\nFor information on our current COVID policy, please click here.\nPLEASE NOTE: THIS SHOW HAS BEEN RESCHEDULED FROM SATURDAY, APRIL 23. ALL ORIGINAL TICKETS REMAIN VALID. \nHope. Warmth. Companionship. Few things in this world can conjure up such sensations quite like the sight of a glowing lantern in a darkened window.\n“The glowing lantern is a universal symbol for sanctuary,” says Mother Hips co-founder Tim Bluhm. “That’s what we wanted this album to be: a warm safe place to get in out of the dark cold night.”\nWritten and recorded through the heart of the COVID-19 pandemic, Glowing Lantern is indeed a work of great comfort, even as it grapples with the profound anxiety of these troubling and uncertain times. The songs here are weighty, abstract ruminations wrapped in unflagging optimism, bittersweet streams of consciousness delivered with a jaunty confidence in better days to come. Bluhm and fellow co-founder Greg Loiacono produced the album themselves, and the juxtaposition of darkness and light in their stark lyrics and buoyant arrangements reflect a tension familiar to anyone who’s ever struggled to find their footing or make sense of the inexplicable. At the heart of it all, though, is a distinct sense of camaraderie, a feeling of closeness and brotherhood that the band has ironically only come to rediscover as a result of the past year of isolation and lockdowns. Glowing Lantern is as collaborative a record as The Mother Hips have ever made, and it’s impossible not to feel the joy, gratitude, and friendship radiating out of it like a beacon in the night."},{"date":"2022-05-07T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiNmRjOGMyZGQtZjg0Mi00YzU5LTkzNWMtYjUwYWYwMGJhYjZmIiwiZWRpdHMiOnt9fQ==","title":"Anaïs Mitchell","url":"https://wl.seetickets.us/event/Anas-Mitchell/465695?afflky=TheChapel","details":"$30 advance and $35 day of show\nFor information on our current COVID policy, please click here. \n\nANAÏS MITCHELL is a Vermont and Brooklyn-based singer- songwriter, and the Tony and Grammy award-winning creator of the Broadway musical Hadestown for which she wrote the book, music and lyrics. Hadestown won 8 Tony Awards overall including Best Musical as well as the Grammy for Best Musical Theater Album. Mitchell was named to TIME’s prestigious TIME100 list in 2020, and her first book, ‘Working on a Song – The Lyrics of Hadestown’ was published by Penguin/Plume in the same year. Dubbed by NPR as “one of the greatest songwriters of her generation”, Mitchell comes from the world of narrative folksong, poetry and balladry. Her recordings include the original studio album of Hadestown (2010, featuring Justin Vernon and Ani Difranco) and Young Man in America (2012), along with reinterpretations of traditional music including Child Ballads (2013, with Jefferson Hamer) and Bonny Light Horseman (2020, as Bonny Light Horseman, which received two Grammy nominations). She has headlined worldwide and supported tours for Bon Iver, Josh Ritter and Punch Brothers, and her music has featured in year-end best lists including NPR, Wall Street Journal, MOJO, Uncut, The Guardian, Sunday Times and The Observer. If there's a common thread in Mitchell's work it's that she's as interested in the world around her as the one inside her. As the New York Times wrote, “Ms Mitchell’s songs address contemporary angst with uncanny vision….a formidable songwriting talent.”"},{"date":"2022-05-08T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiYzUxZDllZjktY2FkNy00N2ZiLWFhNDktYzkwY2ZiM2Q0ZDlmIiwiZWRpdHMiOnt9fQ==","title":"Jenny Don't and the Spurs","url":"https://wl.seetickets.us/event/Jenny-DontandtheSpurs/474400?afflky=TheChapel","details":"$20 advance and $25 day of show\nFor information on our current COVID policy, please click here. \n\nSince their inception in 2012, the Spurs have kept a relentless schedule of recording, playing locally, and touring. After nearly 500 live appearances in almost a dozen countries, and with a slew of albums and singles to their name, Jenny Don’t And The Spurs are just getting warmed up.\nThe Spurs were founded one cold, winter’s evening by Jenny and Kelly. Jenny had been fronting her own band, DON’T, for some time, as well as playing the occasional solo acoustic set here and there. Kelly, who had been in a slew of Portland punk bands since the 80’s, and who had spent the previous several years balancing a grueling touring schedule playing drums with the garage rock trio PIERCED ARROWS and bass with Portland punk-rock destroyers P.R.O.B.L.E.M.S., and wanted to switch gears a bit. After the concept of forming a raw, real, and back-to-the-roots country band had taken hold, it wasn’t long before the couple was rehearsing a seminal set of standards by such influential early country crooners and outlaws like Patsy Cline, Loretta Lynn, Ernest Tubb, and Hank Sr., as well as a sprinkling of originals. It was only a few weeks later that Kelly’s bandmates Fred and Toody Cole got wind of the developing musical project that was taking form in Jenny and Kelly’s kitchen and decided to call their bluff by giving them an unsolicited support slot on an upcoming show featuring the Cole’s own solo two-piece act. Not having anticipated such a high-profile live appearance as a first live outing, and feeling like the guitar-and-bass-only lineup that the band had started life as was lacking something on the rhythm end of things, they decided to ask their friend Sam Henry to join them on drums. Sam, who in addition to being Jenny’s bandmate in DON’T and sometimes solo-set-collaborator, had already had a long, well respected career as one of Portland’s best drummers, having played with such first-generation punk bands as the Wipers, The Rats and Napalm Beach. After a couple of weeks of practice, the debut live appearance of the band went off without a hitch and the core lineup of Jenny Don’t And The Spurs was born.\nThe trio of Jenny, Kelly, and Sam existed in this form for the first year-an-a-half or so of the band’s existence, playing whatever local venue would take them – bars, clubs, porches, basements, backyards, and even a bookstore. This worked well for a while, and occasionally the Spurs would enlist talent from a pool of several friends to sit in on lead guitar or lap steel. The addition of a second guitar rounded out the sound of the band to the point where Jenny and Co. decided to make it a permanent part of the band’s lineup. After a couple of false starts and a bit of difficulty finding a fourth member who could commit to the Spur’s sometimes grueling touring schedule, the incredible Christopher March became a member of the family in early 2017. Christopher brought with him a wealth of talent and live gig experience, having spent years playing on the Northwest Country, Rockabilly, and Honky-Tonk circuit.\nNow, with several West Coast and North American tours, as well as three European tours and hundreds of local shows under their tooled-leather Western belts, the Spurs are gearing up for the release of their third full-length studio album. The Spurs are a musical force to be reckoned with, the intensity and energy of their live set, and dazzling Western outfits handmade by Jenny herself, the band is a must-see for anyone who enjoys spirited garage-infused country music played with sincerity and raw conviction."},{"date":"2022-05-09T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiZDE1ZWNhMWEtMjU4ZC00NjBkLWI4YzQtZmQxZTA1ZDhhNGZmIiwiZWRpdHMiOnt9fQ==","title":"Dehd","url":"https://wl.seetickets.us/event/Dehd/470307?afflky=TheChapel","details":"$19 advance and $23 day of show\nFor information on our current COVID policy, please click here. \nUpon arrival during the fraught summer of 2020, Flower of Devotion felt like Dehd’s necessary prescription for us all. That was, of course, a moment of unprecedented anxiety and uncertainty, when just contemplating the future could seem overly optimistic. But Dehd captured and shared the precarious balance between real life and real hope, a feat mirrored by instant pop melodies and infectious punk energy. The Chicago trio had the audacity to look ahead when many of us didn’t, to imagine improvement through mere existence. It was an album we needed. We need its follow-up, the triumphant Blue Skies, even more. \nDehd’s fourth album (and first for Fat Possum) is also the band’s second consecutive breakthrough, loaded with the most compelling, compulsive, and expansive songs of their career. Blue Skies offers another jolt of timely hope, only with twice the power. These 13 hits feel like flashlights in the dark, acknowledging how difficult everything from love and sex to living and dying can be while supplying the inspiration of their own experiences. “There’s a hole in my window/I was wondering how the rain was getting in,” Emily Kempf sings during the magnetic “Window,” acknowledging the problem before jubilantly exclaiming she’s moving toward something new. “Blue skies!” \nThe rapturous reception of Flower of Devotion gave Dehd access to more resources — budgets, studios, producers. Rather than seek something new, however, they invested in themselves, their process, and their deep belief in what they have always done. They booked the same studio where they had recorded Flower of Devotion but tripled their stay, giving themselves time to play with arrangements and delight in a wonderland of drum machines and synthesizers. \nThrough Dehd’s career, Jason Balla has been building his chops as a producer, so this was a chance to indulge and explore. Eric McGrady, meanwhile, considered how much more he could deliver as a drummer, adding layers to the thump of his past. And Emily, who admits that the process of making records has always been emotionally draining, focused on harnessing her indomitable energy, funneling her power into these songs without being overpowered by them. Dehd gave themselves runway to make mistakes and the space to make a statement. Blue Skies is their poignant, redemptive, and deeply fun testament to trusting and pushing yourself.\nThese 33 minutes run like a series of interconnected singles, each song so hooky and strong that you’ll be hard-pressed to name a favorite. The triumphant “Bad Love” is a surge of self-liberation, Emily leading the charge through an anthem about admitting your faults, seeking forgiveness, and finding a way forward. “I got a heart full/I got a heart full of redemption,” she offers at the start, a moment that suggests Springsteen writing with The Go-Go’s. A Tom Verlaine quiver to his voice, Jason takes a nighttime walk in the city as anxiety closes in during the irrepressible “Stars,” calming himself with a concrete reminder he’s still here. And there’s Eric’s splendid “Hold,” a chiming wonder with elastic bass lines and cascading piano parts that interlock beneath his hypnotic voice. He affirms the impact of simple acts of love.\nBut even when they sound ebullient, Dehd has never shied from troubles, the balance that has made them so magnetic. Above wafting synths and marching drum machines, “Memories” feels first like an electro dirge, memorializing lost friends. Such moments — and there are several clouds amid these Blue Skies — are pointed signals of our collective woe. Dehd presses ahead, though, into a future that offers something else if not always something better. What hope, after all, is more dependable? They end “Memories” in a refrain of pure persistence: “I’m doing all I can.” Blue Skies gets real. Blue Skies never wallows.\nToward the end of 2021, Dehd shared stages with Julien Baker, their first substantive chance to take Flower of Devotion on the road. Every night after their set, fans would tell the band how those songs had helped during the toughest times of the last two years. Those listeners had recognized what makes Emily, Jason, and Eric so compelling — they put their individual experiences on the page, then project them together with heart and empathy into instant hooks. Those post-show admissions could be a lot to process for the band, but they provided galvanizing confirmations that they’d made the right decision with Blue Skies. They would keep pulling light out of the dark with songs that feel so fucking good to hear right now. \nThe writing is sharper and smarter on Blue Skies. The harmonies and rhythms are more sophisticated and considered. The moods are deeper, the swings between them more inspiring. But this is still Dehd, just more wild and wonderful than ever before. “This is all we get,” Emily shouts with relish on the record’s last lines, during a song about the ways geologic deep time should free us all to live more. “Best to take the risk.” Heard, loud and clear."},{"date":"2022-05-13T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiNGVjYzRiYjYtNGI2ZC00MDBkLTg2MDctOWZhMTYxMTE2YTU0IiwiZWRpdHMiOnt9fQ==","title":"HTRK","url":"https://wl.seetickets.us/event/HTRK/465694?afflky=TheChapel","details":"$18 advance and $20 day of show\nFor information on our current COVID policy, please click here. \nPlease Note: At the Artists' request, masks are to be worn at all times (unless actively eating or drinking.) \n\nFew groups in history, recent or otherwise, elevate mood to such singular, smoldering supremacy as the Australian duo of Jonnine Standish and Nigel Yang aka HTRK [‘Hate Rock']. Across nearly two decades of work, wounds (co-founder Sean Stewart tragically took his own life in 2010), and world tours, their sound has shape-shifted between densities and intensities, noise and nakedness, but never wavered in its delicate poetic gravity. Theirs is a chemistry of smoke, echo, and the undertows of desire, the dislocation of cities and memory, the melancholy of distance and deepening night. It’s music of solitude and sensuality, for small hours and lost weekends, spoken in an intimate shadowplay language of skeletal electronics, velvet voice, and noir guitar.\nHTRK’s albums have been released by an array of international labels including Fire (Nostalgia), Blast First Petite (Marry Me Tonight), Boomkat Editions (Over The Rainbow), and Ghostly International (Psychic 9-5 Club, Venus In Leo). For the occasion of their most recent full-length, the celebrated slowburn suite Rhinestones, they founded their own artist imprint, N\u0026J Blueberries. In the live setting they transform spectral torch songs into quiet storms of tension, texture, and transcendence."}]