[{"date":"2022-05-27T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiOWM0MzZlOWItZjQxOC00OTUyLTkwZDAtZjE5ZjMxZWMxNzNmIiwiZWRpdHMiOnt9fQ==","title":"SAMBADÁ","url":"https://wl.seetickets.us/event/SAMBAD-/477431?afflky=TheChapel","details":"$20 advance and $22 day of show\nNOTE: THIS IN AN OUTDOOR SHOW\nFor information on our current COVID policy, please click here. \nFor over 20 years, SambaDá has been mixing contemporary sounds with the roots of Brazilian culture. Brazilian natives Papiba Godinho and Dandha da Hora bring their profound knowledge and respect for the roots of Brazilian and Afro-Brazilian song and dance to the rest of the  band’s diverse members and  have developed a type of samba-reggae-funk with a universal appeal. SambaDá musically brings together the Americas and Africa, drawing from percussion based styles of South and Central America and Senegal, and blends it with that good old funk, rock and reggae backbeat so familiar to crowds of North America.\nThe magic that unites this band is a magic that is felt by both the band and the audience. SambaDá brings joy to each performance, and keeps their fans asking for more!!"},{"date":"2022-05-28T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiY2YxY2JjOWEtMzk4Yi00OTBhLTljNTYtYmNhZWNiZTQ1OTYyIiwiZWRpdHMiOnt9fQ==","title":"Jerry's Middle Finger","url":"https://wl.seetickets.us/event/Jerrys-MiddleFinger/474593?afflky=TheChapel","details":"$25 advance and $30 day of show\nFor information on our current COVID policy, please click here. \nIt’s no longer a secret that Los Angeles-based Jerry's Middle Finger (JMF) delivers the best Jerry Garcia Band tribute experience in the world - performing and celebrating the music of JGB with unparalleled sound and energy.\nHumbly formed in 2015 by a group of professional musicians passionate about Jerry Garcia and the Grateful Dead, JMF started honing its one-of-a-kind sound at LA speakeasies and beachside dive bars. Audiences of all ages instantly fell in love and soon JMF was playing explosive shows up and down the West coast, packing legendary venues like Sweetwater Music Hall, Terrapin Crossroads, and Pappy \u0026 Harriet’s—dazzling new fans on the scene and pulling even the most discerning Jerry fanatics out of their seats for the first time in decades.\nThe magic all starts with lead vocalist and guitarist Garrett Deloian. As a seasoned veteran of the blues circuit, he channels his lifelong love for the work of Garcia into every lick with his unparalleled high-octane guitar tone. The rhythm section features JMF drummer/founder Rodney Newman and bassist Burt Lewis. Rounding things out are two powerhouse vocalists, Halina Janusz and Lisa Malsberger, and veteran pianist Jon Gold.\nThe future looks bright for JMF as they get ready to take their heartfelt magical dance parties to further points across the country. So whether you saw Jerry 500 times or were born after his time on earth, this much is true: JMF will make you feel like he’s still here."},{"date":"2022-05-29T00:00:00.000+00:00","img":"https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F287544079%2F244156907830%2F1%2Foriginal.20220519-064023?w=600\u0026auto=format%2Ccompress\u0026q=75\u0026sharp=10\u0026rect=0%2C0%2C1024%2C512\u0026s=54f43747c15176c8dd6e25bb5ddcf440","title":"San Francisco Carnaval after party Live music by Namorados da Lua NDL Band Dj’s El Kool Kyle, Lando, Ras Rican and Dj Stepwise","url":"https://www.eventbrite.com/e/official-after-party-san-francisco-carnaval-tickets-344588873597","details":""},{"date":"2022-05-30T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiZTU1YzMxMGYtYjMyYy00OTRiLTk0ZDktZjhkYjFkZWM4OTIwIiwiZWRpdHMiOnt9fQ==","title":"Ana Tijoux","url":"https://wl.seetickets.us/event/Ana-Tijoux/474381?afflky=TheChapel","details":"$30 advance and $33 day of show \nFor information on our current COVID policy, please click here. \n\nAna Tijoux\nOne of the most respected MCs in any language, Ana Tijoux has been winning over fans around the world since her debut ‘1977’ bubbled up from an underground sensation into mainstream recognition after being featured on the hit TV show ‘Breaking Bad’ and favorited by Radiohead’s Thom Yorke.\nAna Tijoux’s new album ‘Vengo’ showcase the nimble MC over lush, golden-era hip-hop production rooted in traditional Latin instrumentation. Rolling Stone named her performance at SXSW on of the best concerts of this year’s festival, while the New York Times has called her “South America’s answer to Lauryn Hill: equally skillful at singing and rapping.” Born in France to Chilean parents in political exile during Pinochet’s dictatorship, Tijoux moved back to Chile as a teenager and found a home in the emerging hip-hop scene of Santiago.\nIn concert, Tijoux takes the stage with a full band that brings to life the intricate arrangements of the new album, a whirlwind trip through hip-hop, jazz, and funk, spiced with a bit of politics and her great sense of humor that has led audiences around the globe fall in love with her.\nLoco Tranquilo\nCombining his love of music and adventure, Julián Gervasi writes, produces and performs under the moniker Loco Tranquilo to bring a genre-bending blend of ethereal vocals and freak folk instrumentation.\nFollowing childhood beginnings of learning the guitar by listening to his father’s records,and bohemian experiences living and playing music on the streets of Buenos Aires, Madrid and California, he has been making music in the creative swirl of San Francisco since 2013.\nHis key musical influences and inspirations – including Devendra Banhart, Mac Demarco, T. Rex, Kurt Cobain and David Bowie – have informed and evolved his unique sound of psychedelic, dream-pop, surf-rock melodies.\n“For the majority of people that hear Tropicalia artists and those of a similar ilk, the experience is akin to seeing colour for the first time. Music never felt as flavoursome, rich and well-intended. If you have not yet heard that kind of music, Loco Tranquilo could well represent your portal into a holy world of sound.”"},{"date":"2022-06-02T00:00:00.000+00:00","img":"","title":"2022 Banding Together to End Domestic Violence","url":"https://givebutter.com/BandingTogether22","details":""},{"date":"2022-06-03T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiYTI0NTczYjUtZTk1Yi00NGI0LWJmNDgtYmI3YjNlMGIwMzgzIiwiZWRpdHMiOnt9fQ==","title":"Bedouine","url":"https://wl.seetickets.us/event/Bedouine/465685?afflky=TheChapel","details":"$20 advance and $22 day of show\nCOVID POLICY FOR THIS SHOW PER THE ARTIST'S REQUEST: Proof of vaccination or negative test (within 48 hours) is required for entry.\nPlease note this show has been rescheduled from January 12, 2022. All original tickets remain valid. \nBedouine, a gallicized riff on bedouin, the nomad, the wanderer. Anyone can assume such a name, but Azniv Korkejian has an experience of what it means, the type of ground it covers. “Moving around so much caused me at some point to feel displaced, to not really belong anywhere and I thought that was a good title.” Her development was shaped by political landscapes and family opportunities, her adult life patterned by paths of her own. Born in Aleppo, Syria to Armenian parents, Korkejian spent her childhood in Saudi Arabia, moving to America when her family won a Green Card lottery. They settled in Boston, then Houston, but she split for L.A. as soon as she could. A casual offer to stay on a horse farm took her to the rolling hills of Lexington, Kentucky, followed by a year in Austin, and a trip east to Savannah for a degree in sound design. Returning to L.A., she discovered a close-knit community of musicians in Echo Park that started to feel like home. Maybe America is just a highway that leads back to L.A.\nKorkejian works with sound professionally, in dialogue editing and music editing, a slice of Hollywood’s sprawling industry. She never set out to be a singer in L.A., taking a zen approach to that part of her life, thinking that if it happens, it happens. “I just kept meeting the right people, who were professional musicians, and even though they were going on these big legitimate tours, they were still coming back to this amazing small scene, still demoing at home, and I immediately felt welcomed to join in on that. L.A. actually made me less jaded.” One day she walked into the studio of bass player / producer Gus Seyffert (Beck, Norah Jones, The Black Keys) to inquire about portable reel-to-reel tape machines and ended up cutting “Solitary Daughter in a first take. So they began another kind of journey.\nBedouine has a sound. Sixties folk meets seventies country-funk with a glimmer of bossa nova cool. Lithe guitar picking and precise lyrical excursions. That mesmerizing voice and phrasing. Working on around thirty tracks over three years, with contributions from a remarkable cast of players like guitarist Smokey Hormel (Tom Waits, Joe Strummer, Johnny Cash), Seyffert and Korkejian brought a selection of ten songs to Richmond, Virginia. She specifically sought out Spacebomb, approaching Matthew E. White after a show in L.A. He remembers listening to the song she sent over and over, on and off the road, “‘One of These Days’ became our alarm when we woke up for almost all of that tour.” Anticipating this future collaboration, the tracks were created with breathing room for the Spacebomb touch and Trey Pollard’s sinuous symphonic arrangements. Back in California, Thom Monahan (Pernice Brothers, Devendra Banhart, Vetiver) brought all the elements together in a masterful final mix.\nEschewing notions of nomadic chic, Bedouine represents minimalism motivated by travel, paring down and paring down until only the essential remains. Her music establishes a sustained and complete mood, reflecting on the unending reverberations of displacement, unafraid to take pleasure along the way. At the end of “Summer Cold” Korkejian composed an interstitial piece to recreate the sounds of her grandmother’s street in Aleppo. Partly due to America’s role in destabilizing Syria, this sonic memory is the only way to return to her birthplace. Worlds that have been lost might only be accessed through a song, in a line or a melody or a trace of tape, but they must be looked for in order to be found, so she wanders on."},{"date":"2022-06-04T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiYTA3MTYxOTMtMDM2Zi00OTQyLTk3YmYtYTAwZjM4Y2I5MGM0IiwiZWRpdHMiOnt9fQ==","title":"Monophonics","url":"https://wl.seetickets.us/event/Monophonics/474710?afflky=TheChapel","details":"$35 advance and $40 day of show\nFor information on our current COVID policy, please click here. \nThe world's premier psychedelic soul band, Monophonics, cordially invites you to attend the grand re-opening of the once thriving, once vibrant establishment, the legendary Sage Motel. A place where folks experience the highs and lows of human existence. A place where big dreams and broken hearts live, where people arrive without ever knowing how they got there. It's where individuals find themselves at a crossroads in life.\nWhat started as a quaint motor lodge and a common pitstop for travelers and truckers in the 1940s morphed into a bohemian’s hang by the 1960s and 1970s. Artists, musicians, and vagabonds of all types would stop there as seedy ownership pumped obnoxious amounts of money into high end renovations, eventually attracting some of the most prominent acts of the era. But when the money ran out, The Sage Motel devolved into a place where you rent by the hour."},{"date":"2022-06-05T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiNzFjN2MwMDQtNmM2OC00OGYzLTlhMzAtZDAyZTUzN2MwNzJjIiwiZWRpdHMiOnt9fQ==","title":"Sugar Candy Mountain","url":"https://wl.seetickets.us/event/Sugar-CandyMountain/465687?afflky=TheChapel","details":"$16 advance and $18 day of show\nFor information on our current COVID policy, please click here. \nPlease note this show has been rescheduled from January 27, 2022. All original tickets remain valid. \nHelping to spearhead a revival of neo-psychedelic pop, California's Sugar Candy Mountain fuses sunny, retro sounds with lush, sophisticated composition. Blending classic '60s West Coast psychedelia with pastoral folk and pulling inspiration from pop experimentalists and Brazilian Tropicalia. Their latest album \"Do Right\" takes a more modern approach layering vibrant synths alongside more organic instrumentation. Oscillating between the hazy psychedelic pop of Mild High Club, the driving energy of Tame Impala and the danceable familiarity of The Supremes, the band is a perfect cocktail of old and new, imploring the listener to take a ride into the sunset with Sugar Candy Mountain."},{"date":"2022-06-08T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiN2Y4Y2U0ZTItOTg5Mi00NjgzLWIwZTctYjQxMDNjYmUxZmMzIiwiZWRpdHMiOnt9fQ==","title":"Son Volt","url":"https://wl.seetickets.us/event/Son-Volt/470299?afflky=TheChapel","details":"$30 advance and $35 day of show\nFor information on our current COVID policy, please click here. \nPlease note this show has been rescheduled from January 25, 2022 and all original tickets remain valid. \n2020 was not quite what Jay Farrar was expecting for the 25th anniversary of Son Volt, the band he started in 1995 after leaving the seminal group Uncle Tupelo, whose No Depression album helped define the alt-country and Americana genre. The group had just finished an Outlaw Country Cruise when the pandemic hit and sent them into their homes on lockdown.\nInstead of a triumphant tour marking the illustrious landmark, Farrar was forced indoors by the pandemic, and his “Reverie” during that time helped define Electro Melodier, Son Volt’s 10th studio album – and third for influential Nashville indie Thirty Tigers. The title, taken from the names of two vintage amplifiers from the late ‘40s and early ‘50s, also describes the disc’s unique blend of folk, country, blues, soul and rock – an electric troubadour with melodies that hit and stick. Social protest songs like “Living in the U.S.A.” and “The Globe,” the former about the promises of this nation gone wrong, the latter referencing the street protests accompanying the Black Lives Matter movement, exist side by side with odes to long-term relationships (specifically his 25-year marriage) in “Diamonds and Cigarettes” and “Lucky Ones.” Once again accompanied by the current Son Volt line up – keyboardist/steel guitarist Mark Spencer, bassist Andrew Duplantis, guitarist Chris Frame and drummer Mark Patterson –Farrar takes a slight turn from 2019’s politically pointed Union to a series of songs that asks questions rather than demanding answers – think of “Living in the U.S.A.” as Farrar’s version of Bruce Springsteen’s “Born in the U.S.A.,” Neil Young’s “Rockin’ in the Free World” or Patti Smith’s “People Have the Power,” an anthem to unite the populace.\n“I had more time to devote to and concentrate on the writing,” says Farrar about his enforced quarantine. “We were fortunate in that we had just released Union and toured the country, so we were off cycle. It was still a rough year, but as a songwriter, I was able to make the most of it.”\nOne listen to Electro Melodier, which opens with “Reverie,” describing Farrar’s contemplative state gazing out his window, enlivened with Mark Spencer’s “Wichita Lineman” guitar riffs andthe lush Big Star melodies, and you wonder why no other rock ‘n’ roll bands or singer/songwriters are making albums like this about what we’re all going through.\n“I wanted to concentrate on the melodies which got me into music in the first place,” says Farrar. “I wanted politics to take a back seat this time, but it always seems to find a way back in there.”\nListen to the Moog line from The Who’s “Won’t Get Fooled Again” channeled in “The Globe,” or the Led Zeppelin homage in “Someday Is Now,” the nod to gut-bucket Mississippi delta blues in the Lightnin’ Hopkins low-tuned guitar stylings of “War on Misery” or Spencer’s haunting slide on the funereal dirge of “The Levee On Down,” which takes Andrew Jackson to task for everything from the “Trail of Tears” massacre of the Cherokees to his face on the $20 bill instead of Harriet Tubman. The environmentally conscious “Arkey Blue” nods to a honky-tonk in Bandera, TX, Arkey Blue’s Silver Dollar, where Hank Williams, Sr. allegedly carved his name into one of the wood tables, and even quotes Pope Francis on “turbulent rains never before seen.”\n“I’m just asking the same question, how can so much go wrong in a country that is held up as an example to the world of something righteous,” explains Farrar about songs like “Living in the U.S.A.,” in which you can hear doomsaying prophecies like Barry McGuire’s “Eve ofDestruction” set to the guitar riffs of Lou Reed’s “Sweet Jane.”\nStill based in St. Louis (“It kinda makes sense as a central location for touring because all the interstates connect through here”), Farrar was born in Belleville, IL, where he formed Uncle Tupelo with his high school classmate Jeff Tweedy. “We had similar musical interests and took it from there,” says Jay modestly about the groundbreaking group.\nFarrar is grateful to his wife of 25 years, a sentiment which he expresses lovingly on “Diamonds and Cigarettes” – featuring vocals by country singer Laura Cantrell, along with songs like the soulful “Lucky Ones” and “Sweet Refrain,” a song that captures the spirit of Bentonia, Mississippi, home of Skip James along with name checks for local legends Jimmy “Duck” Holmes and the Bluefront Cafe. “These are the Times” was recorded entirely remotely by Zoom, signaling one of the new methods of making music ushered in by Covid.\nWith tour dates scheduled in 2022, Son Volt is ready to return to what they know best after a welcome period of introspection. “It’s a good time to take stock of what’s lost and what’s gained,” said Farrar. “At this point, we’re not even sure what we’re going to get back.”\nThe songs of Electro Melodier help remind us to be thankful of what we still have – new music from Jay Farrar and Son Volt.\n“Daylight brings the clues to the world to life/Make or break gotta do what it takes to survive.” - “Sweet Refrain”"},{"date":"2022-06-09T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiM2QzYjZlYmMtMmY4MC00MDhhLTg2ZGMtNzlkYTIxODMzNWRmIiwiZWRpdHMiOnt9fQ==","title":"Woods","url":"https://wl.seetickets.us/event/Woods/481321?afflky=TheChapel","details":"$22 advance and $25 day of show\n\nFor information on our current COVID policy, please click here. \n\n“Dreaming doesn’t come easy these shadowed days, which is why Strange To Explain by Woods is such a welcome turning of new colors. \nIt presents an extended moment of sweet reflection for the 15-year-old band, bouncing back to earth as something hopeful and weird and resolute. Like everything else they’ve recorded, it sounds exactly like themselves, but with subtly different shades and breaths and rhythmic feels and everything else that changes, the natural march of time and the intentional decisions of the musicians moving in what feels like an uncommonly organic alignment.\nStrange To Explain trades in a different kind of dependability, maintaining a steady connection to the voice on the other side of the record needle. After quickly recording and releasing 2017’s Love Is Love in response to the tumultuous events of their (and our) 2016, Jeremy Earl and company took their time with what came next. Parenthood arrived, as did a short songwriting pause. The band went bicoastal when Jarvis Taveniere headed west. And when they returned to their posts, there on the other side of this particular mirror, they made this, an album that not only catches and holds and shares the light in yet another new way, but recognizes that there’s still light to be caught, which is also no small thing.\nA bend beyond the last bend beyond, Woods keep on changing, thoughtfully and beautifully. The colors were always there, like trees blossoming just slightly differently each season, a synesthetic message coded in slow-motion. Recorded in Stinson Beach, the kind of place that seems like an AI simulation of an idyllic northern California coastal escape, the familiar jangling guitars recede to the background. John Andrews’s warm keyboards and twining Mellotron rise around Earl’s songs and dance across the chord changes like warm sunlight off the Pacific. The music feels a karmic landmass away from the creepiness of the uncanny valley. \nJust dig into “Can’t Get Out” or “Fell So Hard” and it’s easy to spot the affable hooks and fuzzed-out bass and third-eye winks and fun harmonies that Woods have produced reliably since way back ‘round 2004 (which, in the buzz-buzz world of psych-pop really is a grand achievement, too). But listen carefully, also, to the sound of our (and their) world in transition, the ambient humming of spring peepers behind “Where Do You Go When You Dream.” Especially sink into the intention-setting opening trio of songs, emerging from (and shimmering inside) an atmosphere that could only be made by musicians who’ve been working together for nearly 20 years, as Earl and Taveniere have. It’s hardly a secret language, but you try verbalizing it, let alone communicating in it.\nDepending on where in the time-track one stands, it’s their 11th full length (not counting collaborations, split LPs, EPs, and singles), and the 99th release on Earl’s Woodsist label. By any standards, Strange To Explain is the work of a mature band, capable of both heavy atmospheric declarations like “Just To Fall Asleep” and extended-form pieces like the album-closing “Weekend Wind,” unfolding in layers of trumpet and vibraphone and ambient guitars and stereoscopic percussion. There are backwards messages and forward ones, lyrical and otherwise. There are melodies that (at least to me) come back nonlinearly but happily throughout the day when I’m not listening to the music itself, finding some hidden perch and maybe soon transforming into the folk songs of the mind.\nFor contemporary heads, it can be nearly a full-time job to filter out all the bad energy being blasted through nearly all media channels from every conceivable direction. But not all media channels. These benevolent, Mellotron-dabbed dream-sounds constitute some of the more welcome transmissions on these shores in a Venusian minute, just what my kosmik transom was designed to accept. They’re sure to brighten any desert solarium, LED-lit pod, portable Bucky-dome, eco-fit Airstream, or whatever other cozy dwelling your time-mind is currently occupying.” – Jesse Jarnow"},{"date":"2022-06-10T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiMTBmZjZmOTktZDk5Yi00OGI2LTgxZTctZWNkYWZjMGQyNGU3IiwiZWRpdHMiOnt9fQ==","title":"Chali 2na \u0026 Cut Chemist","url":"https://wl.seetickets.us/event/Chali-2naandCutChemist/477495?afflky=TheChapel","details":"$35 advance and $40 day of show\nFor information on our current COVID policy, please click here. \nChali 2na and Cut Chemist have been inseparable for 35 years. It all started in 1987 when they formed their first group UNITY Committee just a couple years after Chali move from Chicago to Los Angeles.\nIn 1994 they combined forces with local rap group Rebels Of Rhythm to form Jurassic 5. Although J5 was in full swing making music and doing shows, Chali and Cut also were founding members of the fusion Latin group Ozomatli in 1995. Since then the two have been busy with both groups and still managed to find time to separate and embark in solo careers on the side. Cut Chemist went on to do remixes and features for such acts as DJ Shadow, Less Than Jake and Blackalicious. Chali also explored his rap prowess with such acts as Roots Manuva, Lyrics Born, Slightly Stoopid and Galactic just to name a few. Separately they also landed solo deals with Interscope and Warner Brothers.\nFor the last three years they’ve been doing a special collaborative performance that tells the story of their lives in music together. The catalogue is as endless as the time they spent together creating over the years. "},{"date":"2022-06-11T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiMjFjYTdkZGMtZjNlNy00MmE5LWI5ZWUtZTY5OTI4NjI2ZGYwIiwiZWRpdHMiOnt9fQ==","title":"Santa Jam Vó Alberta","url":"https://wl.seetickets.us/event/Santa-JamVAlberta/483809?afflky=TheChapel","details":"$25 advance and $30 day of show\n\nFor information on our current COVID policy, please click here. \nStudents of all genres of traditional music both from the US and from Brazil, Santa Jam (Vó Alberta) has long been a leading light in the rapidly growing Brazilian independent scene. Having toured several times in the US, Argentina, Uruguay and of course Brazil, the band has amassed incredible accolades, such as an award-winning documentary, their own TEDx talk, and a loyal ever-growing following, both online and out in the real world.\n\n\n\"Vó Alberta means Grandma Alberta (in Portuguese) and it is an allusion to the blues ambassadress Ms. Alberta Hunter who, for years, set aside her guitar working to serve as a nurse and take care of the physical body of her patients. What a noble cause but what a waste of talent, eh?! Luckily, one (beautiful) day she decided to return to the blues and embrace the power of healing through music. After all, music inspires, heals and communicates the deepest things out there.\"\n\n\n\"We play gypsy folk blues Brazilian regional songs and... of course: our own songs! Santa Jam was born in a carpentry house when, at the end of the work, some good friends gathered to play everything they had experienced that day. Like good jazz/blues, the songs relieved pain and shared the joys through instruments and voices. We started to build some of our own instruments...and those jam sessions led into the streets of São Paulo (Brazil), Buenos Aires (Argentina), San Francisco, New York and beyond!\""},{"date":"2022-06-12T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiN2I3ZGEzMzEtMjUwNC00ZGVhLWFkNTAtMWE5M2Q3NGJhZDk0IiwiZWRpdHMiOnt9fQ==","title":"Midlake","url":"https://wl.seetickets.us/event/Midlake/475693?afflky=TheChapel","details":"$25 advance and $30 day of show\n\nFor information on our current COVID policy, please click here. \nLoss and hope, isolation and communion, the cessation and renewal of purpose. Timeless and salient, these themes echo throughout the fifth album from Midlake, their first since Antiphon in 2013. Produced to layered, loving perfection by John Congleton, For the Sake of Bethel Woods is an album of immersive warmth and mystery from a band of ardent seekers, one of our generation’s finest: a band once feared lost themselves by fans, perhaps, but here revivified with freshness and constancy of intent.\nFrom the cover to the title and beyond, a longing to reconnect with that which seems lost and seek purpose in its passing sits at the record’s core. The cover star is keyboardist/flautist Jesse Chandler’s father, who, tragically, passed away in 2018. As singer Eric Pulido explains, “He was a lovely human, and it was really heavy and sad, and he came to Jesse in a dream. I reference it in a song. He said, ‘Hey, Jesse, you need to get the band back together.’ I didn’t take that lightly. We had already had these feelings with everyone in the band of, oh, this could be a cool thing to do. But the dream was a kind of beautiful depiction of a purpose to reconvene and make music together as friends.”\nFeaturing Chandler’s father during John Sebastian’s set, the cover image was taken from the 1970 documentary Woodstock. In 1969, Jesse’s then-16-year-old dad had joined a friend and hitchhiked from Ridgewood, New Jersey, to the legendary festival. Raised in Woodstock after his father moved there in 1981, Jesse later paid pilgrimage to Bethel Woods with his father; there, the elder Chandler recorded an audio account of his festival experience in the museum’s public database. “So for me, the picture of that kid, my dad, forever frozen in time,” says Chandler, “encapsulates what it means to be in the throes of impressionable and fleeting youth, and all that the magic of music, peace, love and communion bring to it, whether one knows it at the time or not. (I think he knew it).”\nA desire to commune with the past and connect with present, lived experience asserts itself from the opening of the album. A song that resonates with Midlake’s return and, perhaps, our lockdown era, ‘Commune’ can also be read in terms of a deeper urge to re-engage with sometimes neglected ideals and beliefs. ‘Bethel Woods’ sustains and develops that reconnection, evoking the steadfast and contemplative urgency of The Trials of Van Occupanther to back a lyric steeped in yearning for a paradisal time and place of hope and optimism. Soaring guitars and atmospheric noise effects extend a sonic scope further developed by ‘Glistening,’ where arpeggios dance like light glancing off a lake. In just three songs, Midlake reintroduce themselves and reach out into fresh territory with a richly intuitive dynamism, honoring their past as a seedbed of possibility.\nThe psychedelic space-rock and sticky guitars of ‘Exile’ shift the album to another plane, promising rich returns live, before ‘Feast of Carrion’ splices apocalyptic imagery with lustrous harmonies: darkness and light, held in rarefied balance. A deeply personal turn follows on ‘Noble,’ a song of tender innocence named after drummer McKenzie Smith’s infant son, born with a rare brain disorder called Semi-Lobar Holoprosencephaly. Pulido, who has been friends with McKenzie since they were 16 years old, kept McKenzie in mind for the lyrics. “I wrote the song from his perspective in a way, his expression to me of how he had been feeling towards his son. And then among the lament of his condition, it’s also embracing this child who has only joy. Noble doesn’t know that he has a condition, he just loves life. And smiles, and is so innocent, and perfect in so many ways.”\nElsewhere, the prog-enhanced funk-rock of ‘Gone’ seeks to find hope in relationships that seem fragile. The ELO-esque ‘Meanwhile...’ draws inspiration from what happened when Midlake paused after Antiphon, developing universal resonance as a song about the beautiful growths that can emerge from the cracks and gaps between things. ‘Dawning’ draws on 1970s soft-rock stylings for another song searching for hope, its keyboard line reaching out towards an uncertain future while everything seems to collapse around it; ‘The End’ reflects on the difficulties of partings. Finally, ‘Of Desire’ meditates on letting go of what you can’t control and attending to what you can during uncertain times. “It’s about finding peace in that humbling,” says Pulido. “Sometimes it’s hard to have a large effect, so it’s just about shrinking that and saying, these are the things I can do and the rest is to be seen, to be known.”\nMidlake began re-attending to their patch in 2019, with the bulk of the album’s work undertaken when the world shut down in 2020. The lockdown turned out to be helpful, in terms of offering an escape from grim reality and focusing the band’s energies – essential for an outfit whose members (Pulido, Chandler, Smith, Eric Nichelson and Joey McClellan) had all pursued alternative ventures following Antiphon. Also on-hand was new collaborator John Congleton, who produced, engineered and mixed the album, marking Midlake’s first record with an outside producer. “I can’t say enough just how much his influence brought our music to another sonic place then we would have,” says Pulido. “I don’t want to record without a producer again. Part of that is the health of the band, because as you get older you get more opinionated and you kind of need that person who says, ‘No, it’s going to be this way!’ It’s hard to do that with your friends.”\nThe result is a powerful, warming expression of resolve and renewal for Midlake, opening up new futures for the band and honoring their storied history. Formed in the small town of Denton, with roots in the University of North Texas College of Music, Midlake delivered an auspicious debut with 2004’s Bamnan and Slivercork. For the follow-up, they looked further afield and deeper within to deliver 2006’s wondrous The Trials of Van Occupanther, a modern classic pitched between 1871, 1971 and somewhere out of time: between Henry David Thoreau and Neil Young’s After the Gold Rush, between 1970s Laurel Canyon thinking and a longing for something more mysterious.\nConfidence bolstered by a growing fanbase and a developed sense of their own far- reaching abilities, Midlake – a band acutely attuned to seasonal shifts – then embraced change. In 2010, they visited darker psych-folk thickets for The Courage of Others and backed John Grant on his lustrously spiky breakthrough album, Queen of Denmark. When singer Tim Smith departed Midlake in 2012, Pulido stepped up to the lead vocal role for 2013’s freshly exploratory Antiphon, teasing out singular routes through vintage electric-folk pastures.\nSince then, domestic projects have beckoned as children entered various band- members’ lives. Pulido joined Bob Dylan’s 75th birthday celebrations at Nashville’s prestigious Ryman Auditorium and launched the project BNQT with a cast of all-star guests, backed by Chandler, McClellan and Smith; Pulido and Chandler also recorded solo albums.\nIn reuniting, the bandmates were adamant that Midlake needed their absolute focus. The result is an album of tremendously engaged thematic and sonic reach with a warm, wise sense of intimacy at its heart: an album to break bread and commune with, honor the past and travel onwards with. In ‘Bethel Woods’, Pulido sings of gathering seeds. On For the Sake of Bethel Woods, those seeds are lovingly nurtured, taking rich and spectacular bloom."},{"date":"2022-06-13T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiYjY1ODE2YWQtY2FlMC00MDU2LTk2ZWMtYmZmZDA1NjAyODk5IiwiZWRpdHMiOnt9fQ==","title":"Bobby Oroza","url":"https://wl.seetickets.us/event/Bobby-Oroza/481512?afflky=TheChapel","details":"$20 advance and $25 day of show\n\nFor information on our current COVID policy, please click here. \nAfter years of grinding as a sideman in the Finnish music scene, Bobby Oroza has stepped up to make his voice heard. Always with an air of crude romanticism, Bobby pushes towards an expression transcending the borders of soul and rock balladry. His dark and intimate debut single ”This Love” didn’t take long to reach the ears and hearts of a worldwide soul music community and is already a proper classic amongst the lowrider and soul collector scenes. \nBobby was born in Helsinki, Finland into a family of musicians and artists. During frequent family parties Bobby´s Bolivian grandfather would pick up a guitar and sing Latin canciones and Cuban classics. Bobby´s mother is a singer and his father a gypsy-style jazz guitarist. All his siblings work in show business and music. As a kid, Bobby was lucky to grow up surrounded by his parents’ record collection which included early jazz and blues, Motown hits, gospel ensembles, and doo-wop groups like The Drifters and The Clovers. The Soul records were balanced out by Brazilian ones, African ones, his mother’s collection of North and South American folk songs, and Nuyorican Salsa albums. All of these influences show up in Bobby’s music. \nBobby started working professionally as a musician in his early teens. His main instruments are guitar and percussion. Before finishing high school Bobby decided he needed to experience the rhythmic source that had inspired him the most, and travelled to Santiago, Cuba. There he studied percussion and singing intensively for months. Since his return he’s been producing, recording and performing music to make a living for his family. Teaming up with the Timmion Records house band Cold Diamond \u0026 Mink, led by Jukka Sarapää, Sami Kantelinen, and guitarist/composer Seppo Salmi, he has a tight quartet of musicians to support his vision. With his instant classic, debut album “This Love” Oroza has shared his strange and unique shade of Soul with the world, creating a cult-like following for his sound from Finland to sunny Southern California and beyond."},{"date":"2022-06-14T00:00:00.000+00:00","img":"https://d1htavafy9m5bl.cloudfront.net/eyJidWNrZXQiOiJwcm9kLXNpaC5zZWV0aWNrZXRzdXNhLnVzIiwia2V5IjoiOWNiYjQxMGUtNTgyYy00NmNkLWE2NjAtNjdmZWMyM2Q5ZjliIiwiZWRpdHMiOnt9fQ==","title":"Modern English","url":"https://wl.seetickets.us/event/Modern-English/465684?afflky=TheChapel","details":"$27 advance and $30 day of show\nFor information on our current COVID policy, please click here. \nModern English are an English rock band best remembered for their songs \"I Melt with You,\" \"Hands Across the Sea,\" and \"Ink and Paper.\" The group disbanded for a period in 1991, but later recorded in 1995 with some new members. The original members reformed in 2009.\nFormed in Colchester, Essex, England, in 1979 by Robbie Grey (vocals), Gary McDowell (guitar, vocals), and Michael Conroy (bass, vocals), Modern English were originally known as The Lepers. The group expanded to \"Modern English\" when Richard Brown (drums) and Stephen Walker (keyboards) were subsequently added to the line-up of the band.\nAfter a single on their own 'Limp' label in 1979, the band signed to 4AD the following year, with two further singles released, and a session for John Peel recorded before the band's debut album, Mesh \u0026 Lace, in 1981, the band in the early days showing a strong Joy Division influence. A second Peel session was recorded in October 1981. The follow-up, After The Snow (April 1982), was more keyboard-oriented and was compared to Simple Minds and Duran Duran. It was also released in the United States by Sire Records the following year, where it reached number 70 on the Billboard chart, and sold over 500,000 copies. Grey said of the album, \"We used to think 'God, we'll never make a pop record. We're artists!', but things don't always turn out as you planned and when you actually create a pop record, it's so much more of a thrill than anything else.\" The second single from the album was also a hit in the US, the jangly \"I Melt With You\" reaching number 78. When he reviewed the album, Johnny Waller of Sounds described the track as \"A dreamy, creamy celebration of love and lust, which deserves to be showcased on as 12\" single all by itself, with no b-side,\" while his colleague Tony Mitchell described it as \"suburban amateurism at its most unrewarding.\" The band relocated to New York City and worked on a third album, Ricochet Days, which again made the top 100 in the US, after which the band left 4AD and were solely signed to Sire. The single \"Stop Start\" (1986) was the last record Modern English record released by Sire, the band splitting up.\nGrey and Conroy along with Modern English worked with This Mortal Coil before re-forming Modern English with Mick Conroy and Aaron Davidson for a new album in 1990, Pillow Lips, now on the American TVT label. The album featured a re-recorded \"I Melt With You,\" which was released as a single, and saw the band again in the Billboard top 100. The band split up for a second time in 1991, after contractual problems with TVT, with Grey forming Engine. In 1995, with the legal issues with TVT sorted out, Engine evolved into the next incarnation of Modern English and signed to the Imago label, with Grey and Matthew Shipley (keyboards). This line-up recorded the 1996 album Everything Is Mad.\nRobbie Grey toured the US with a new Modern English lineup coast to coast across the US and recorded a new album with Hugh Jones (producer of I Melt With You). The songs written with guitarist Steven Walker and other members came together on the road and back home in London between tours, after a few years on the shelf this collection of songs was released in May 2010 called \"Soundtrack,\" along side the reissued and remastered \"Stop Start\" album also released at the same time. The original members reunited \u0026 reformed in 2009.\nAfter reforming with original band members and extensive touring, Modern English released their first new album in 30 years, \"Take Me To The Trees\" was finally released in 2016. In 2020 the band had planned to tour and play their 40th Anniversary Tour Worldwide, but the global pandemic had different plans. Modern English played the whole After The Snow album virtually online in its entirety throughout 2020. 2022 looks exciting, as Modern English are in the studio working on brand new material. Stay tuned..."}]