[{"date":"2022-06-04T00:00:00.000+00:00","url":"https://theuctheatre.org/events/buy-tickets/crown-the-empire-the-fallout-10-year-anniversary-tour/detail","title":"Crown The Empire: The Fallout 10 Year Anniversary Tour","img":"https://theuctheatre.org/userfiles/events/images/508/crown-the-empire-the-fallout-10-year-anniversary-tour.jpeg?20220530183511","details":"Standing room only - limited seating available\n\nWith D.R.U.G.S, The Word Alive, Until I Awake"},{"date":"2022-06-07T00:00:00.000+00:00","url":"https://theuctheatre.org/events/buy-tickets/violent-femmes-1/detail","title":"Violent Femmes","img":"https://theuctheatre.org/userfiles/events/images/509/violent-femmes-1.jpeg?20220530183512","details":"Standing Room Only - Limited Seats Available\n\nWith Deap Valley\n\nViolent Femmes 10th studio album, HOTEL LAST RESORT, resides among the groundbreaking band’s finest work, simultaneously refining and redefining their one-of-a-kind take on American music, mingling front porch folk, post punk, spiritual jazz, country blues, avant garde minimalism and golden age rock ‘n’ roll into something still altogether their own. Founded and fronted of course by singer/ guitarist Gordon Gano and acoustic bass guitarist Brian Ritchie, the Milwaukee-born combo remains as warm, wise and weird as ever before, with such new favorites as “Another Chorus” and “Everlasting You” continuing to mine the vast range of ideas, melodic complexity and organic sonic craftsmanship that has characterized the band’s body of work since their landmark self-titled 1983 debut.\n\n“I think it’s probably the best [album] we’ve made since HALLOWED GROUND,” Ritchie says. “We didn’t really know that we had something to say, but it turns out that the songs are really good and we were able to sink our teeth into them and come up with something which is just as good as anything we’ve ever done. I’m even a little bit surprised myself.”\nViolent Femmes are undeniably one of the most inventive and original bands of this or any other era, constantly pushing forward with their singular blend of folk and punk, sarcasm and spirituality. Founded in 1981, the originally Milwaukee-based band’s remarkable three-decade-plus career has produced a series of truly iconic singles – among them such classics as “American Music,” “Gone Daddy Gone,” “Nightmares,” “Add It Up” and of course, “Blister In The Sun” – along with cumulative worldwide album sales in excess of 10 million, with 1983’s VIOLENT FEMMES awarded RIAA platinum eight years after its initial release."},{"date":"2022-06-08T00:00:00.000+00:00","url":"https://theuctheatre.org/events/buy-tickets/yann-tiersen/detail","title":"Yann Tiersen - Live A/N Tour 2022","img":"https://theuctheatre.org/userfiles/events/images/397/yann-tiersen.jpeg?20220530183512","details":"KALW Presents\n\nGuillaume Yann Tiersen (born June 23, 1970 in Brittany, France) is a French musician who is best known for being the composer of the soundtrack for the popular 2001 movie \"Le fabuleux destin d'Amélie Poulain\". He has received classical training at several musical academies, including those in Rennes, Nantes, and Boulogne.\n\nHis music is mostly instrumental, decorated with piano, accordion, harpsicord, violin, mandolin, bass, guitar, banjo, melodica, toy piano, typewriter, vibraphone and various rhythm instruments. Yann Tiersen has also collaborated with vocal artists like Claire Pichet (\"Le phare\" and \"Rue des cascades\"), Elizabeth Fraser (\"Les retrouvailles\") and Shannon Wright (\"Yann Tiersen and Shannon Wright\"). Other musicians he has worked with include The Divine Comedy, Noir Désir, dominique A., Francoiz Breut, Les Têtes Raides and The Married Monk."},{"date":"2022-06-10T00:00:00.000+00:00","url":"https://theuctheatre.org/events/buy-tickets/fantastic-negrito-1/detail","title":"Fantastic Negrito","img":"https://theuctheatre.org/userfiles/events/images/454/fantastic-negrito-1.jpeg?20220530183513","details":"KALW Presents\n\nWith The Stone Foxes and Cowboy and His Sometimes Blue Band\n\nFantastic Negrito’s upcoming album \"White Jesus Black Problems\" was inspired by learning that his 7th generation grandmother was a Scottish indentured servant who entered into a common law marriage with an African American enslaved man, his 7th generation grandfather, in open defiance of the racist laws of 1750’s colonial Virginia. The resulting work is part love story, part historical excavation, an extraordinary and exhilarating ode to the power of family and the enduring resilience of our shared humanity. The collection is bold and thought provoking, grappling with racism, capitalism, and the very meaning of freedom itself, all without ever losing sight of the desire and determination at the heart of the tale. The performances, meanwhile, are similarly ambitious and emotionally charged, mixing blistering rock and roll grit with infectious R\u0026B grooves and buoyant funk energy to deliver a sound that manages to feel both vintage and experimental all at once. The experience challenges our notions of who we are, where we come from, and, perhaps most importantly, where we’re headed. "},{"date":"2022-06-12T00:00:00.000+00:00","url":"https://theuctheatre.org/events/buy-tickets/neko-case/detail","title":"Neko Case","img":"https://theuctheatre.org/userfiles/events/images/496/neko-case.jpeg?20220530183513","details":"KALW Presents\n\nStanding room - limited seats available. \n\nwith special guest Leyla McCalla"},{"date":"2022-06-17T00:00:00.000+00:00","url":"https://theuctheatre.org/events/buy-tickets/simu-liu-we-were-dreamers-tour-late-show-added/detail","title":"Simu Liu: WE WERE DREAMERS Tour - Late Show Added","img":"https://theuctheatre.org/userfiles/events/images/520/simu-liu-we-were-dreamers-tour-late-show-added.jpeg?20220530183514","details":"Every ticket includes a copy of WE WERE DREAMERS: An Immigrant Superhero Origin Story (a $28 value).\n\nSpend an evening with the star of Marvel's first ever Asian superhero movie, Simu Liu, as he traces his path from his humble upbringing in China to the bright lights of Hollywood.\nSimu gives fans an inside look at growing up between cultures, battling stereotypes, and landing the role of a lifetime in Shang-Chi in his new memoir, WE WERE DREAMERS. Joined on book tour by special guests, Simu will share inspiring insights into how we can all become the heroes of our own life stories. \n "},{"date":"2022-06-17T00:00:00.000+00:00","url":"https://theuctheatre.org/events/buy-tickets/simu-liu-we-were-dreamers-tour/detail","title":"Simu Liu: WE WERE DREAMERS Tour","img":"https://theuctheatre.org/userfiles/events/images/506/simu-liu-we-were-dreamers-tour.jpeg?20220530183514","details":"Every ticket includes a copy of WE WERE DREAMERS: An Immigrant Superhero Origin Story (a $28 value).\n\nSpend an evening with the star of Marvel's first ever Asian superhero movie, Simu Liu, as he traces his path from his humble upbringing in China to the bright lights of Hollywood.\nSimu gives fans an inside look at growing up between cultures, battling stereotypes, and landing the role of a lifetime in Shang-Chi in his new memoir, WE WERE DREAMERS. Joined on book tour by special guests, Simu will share inspiring insights into how we can all become the heroes of our own life stories. \n "},{"date":"2022-07-05T00:00:00.000+00:00","url":"https://theuctheatre.org/events/buy-tickets/ukraine-benefit-concert-the-hardkiss-ivan-dorn-onuka-and-artem-pivovarov/detail","title":"Ukraine Benefit Concert - The Hardkiss, Ivan Dorn, ONUKA, and Artem Pivovarov","img":"https://theuctheatre.org/userfiles/events/images/516/ukraine-benefit-concert-the-hardkiss-ivan-dorn-onuka-and-artem-pivovarov.jpeg?20220530183515","details":"Standing room with limited VIP Tables available.\n\nThe Hardkiss, Ivan Dorn, ONUKA, and Artem Pivovarov will give concerts in the United States in support of Ukraine.\nConcerts will be held in the summer of 2022 in 6 cities - Miami, Chicago, New York, Berkeley, Los Angeles, and Seattle.\nWith these performances, musicians want to continue to tell, sing and draw attention to the war in Ukraine and raise funds to support humanitarian and cultural campaigns in Ukraine.\nThis tour is another drop in the ocean of help needed by Ukraine and the Ukrainian people, who have demonstrated their indomitable will and strength of spirit. Strength to victory and freedom.\nThe purpose of these concerts is to gather as many caring people who want and can help: in word, deed, money.\nTour dates:\nJune, 28 - Miami - Sport of Kings\nJuly, 01 - Chicago - Park West\nJuly, 03 - New York - Melrose Ballroom\nJuly, 05 - Berkeley - The UC Theater\nJuly, 07 - Los Angeles - Avalon\nJuly, 08 - Seattle – Showbox\n  The Hardkiss, Ivan Dorn, ONUKA, Artem Pivovarov дадуть концерти в США на підтримку України.\nКонцерти пройдуть влітку 2022 року у 6 містах — Маямі, Чикаго, Нью-Йорк, Сан-Франциско, Лос-Анджелес, Сієтл.\nЦими виступами музиканти хочуть і надалі розповідати, співати та привертати увагу до війни в Україні та зібрати кошти на підтримку гуманітарних та культурних програм в Україні.\nЦей тур — ще одна крапля в океані допомоги, якої потребує Україна та український Народ, який продемонстрував свою незламну волю та силу духу. Силу до перемоги та свободи.\nМетою цих концертів є зібрати якомога більше небайдужих людей, які хочуть та можуть допомогти: словом, ділом, коштами.\nДати концертів:\n28 червня - Маямі - Sport of Kings\n1 липня - Чикаго - Park West\n3 липня - Нью-Йорк - Melrose Ballroom\n5 липня - Сан-Франциско - The UC Theater\n7 липня - Лос-Анджелес - Avalon\n8 липня - Сієтл – Showbox"},{"date":"2022-07-09T00:00:00.000+00:00","url":"https://theuctheatre.org/events/buy-tickets/monobloco/detail","title":"Monobloco","img":"https://theuctheatre.org/userfiles/events/images/517/monobloco.jpeg?20220530183515","details":"With Special Guest Allex Costa"},{"date":"2022-07-10T00:00:00.000+00:00","url":"https://theuctheatre.org/events/buy-tickets/motion-city-soundtrack-1/detail","title":"Motion City Soundtrack","img":"https://theuctheatre.org/userfiles/events/images/377/motion-city-soundtrack-1.jpeg?20220530183516","details":"Standing room - limited seats available. \n\nWith All Get Out and Neil Rubenstein\nMotion City Soundtrack formed in Minneapolis in 1997 and has since built an extraordinary career for themselves with their unique style of indie rock meets power pop and quirkily smart lyrics that has resulted in six fan-coveted studio albums. "}]