[{"date":"2022-05-06T00:00:00.000+00:00","url":"https://theuctheatre.org/events/buy-tickets/los-van-van-havana-d-primera/detail","title":"Los Van Van \u0026 Havana D'Primera","img":"https://theuctheatre.org/userfiles/events/images/497/los-van-van-havana-d-primera.jpeg?20220506094810","details":"Standing room - limited seats available. \n\nLos Van Van is one of the leading musical groups of post-revolutionary Cuba. It was founded in 1969 by bassist Juan Formell, who directed the band until his death in 2014. Formell and former band members Changuito and Pupy are some of the most important figures in contemporary Cuban music, having contributed to the development of songo and timba, two popular dance music genres.\nThe band has a Grammy Award to their credit, the 2000 Grammy awarded to the album Van Van is Here ('Llegó Van Van').\nIn January 2010 \"A Cali,\" a song from Van Van's latest album was selected as one of the winning songs of the 2009 Cali Fair held in the Cali (Colombia), a city known as Colombia's \"salsa capital\". The selection was made through a public poll that registered 30,742 votes. Van Van's \"A Cali\" received 7,905 of the votes, or 26% of the total.\n\nHAVANA D'PRIMERA\n\nHavana D’Primera is the Cuban band directed and founded by Alexander Abreu in 2008, who is widely recognized as one of the greatest trumpet players of his generation.\nThe band was formed by a collective of the best musicians and Cuban-All-Stars artists in the current Cuban scene including, not only revolutionary dominating musicians in the 90’s, but also the most talented up and coming musicians around. Alexander is considered one of the most versatile Cuban musicians, who has created a fusion of Salsa, Jazz, Funk and Afro-Cuban. Abreu y Havana D’ Primera have been escalating in the last ten (10) years in popularity throughout Cuba and the world. They are, without a doubt, known as the most “popular “ Cuban band!\n "},{"date":"2022-05-13T00:00:00.000+00:00","url":"https://theuctheatre.org/events/buy-tickets/behemoth-arch-enemy/detail","title":"Behemoth / Arch Enemy","img":"https://theuctheatre.org/userfiles/events/images/491/behemoth-arch-enemy.jpeg?20220506094811","details":"Standing room - limited seats available. \n\nwith special guests Napalm Death and Unto Others"},{"date":"2022-05-15T00:00:00.000+00:00","url":"https://theuctheatre.org/events/sales-ended/zero-david-nelson-band/detail","title":"**CANCELED**Zero \u0026 David Nelson Band","img":"https://theuctheatre.org/userfiles/events/images/502/zero-david-nelson-band.jpeg?20220506094812","details":"**THIS EVENT HAS BEEN CANCELLED** Please refer to your purchasing email for refund information\n\nWavy Gravy’s 86th Birthday Benefit for Seva\nSeva is a global nonprofit eye care organization that works with local communities around the world to develop self-sustaining programs that preserve and restore sight.\n "},{"date":"2022-05-17T00:00:00.000+00:00","url":"https://theuctheatre.org/events/buy-tickets/dying-fetus/detail","title":"Dying Fetus","img":"https://theuctheatre.org/userfiles/events/images/494/dying-fetus.jpeg?20220506094812","details":"Standing room - limited seats available. \n\nWith Chelsea Grin, Bodysnatcher, Frozen Soul, Undeath"},{"date":"2022-05-21T00:00:00.000+00:00","url":"https://theuctheatre.org/events/buy-tickets/destroyer/detail","title":"Destroyer","img":"https://theuctheatre.org/userfiles/events/images/478/destroyer.jpeg?20220506094813","details":"KALW Presents\n\nStanding room - limited seats available.\n\nWith special guest Rosali\nDestroyer’s latest album, LABYRINTHITIS, brims with mystic and intoxicating terrain, the threads of Dan Bejar’s notes woven through by a trove of allusions at once eerily familiar and intimately perplexing. The record circuitously draws ever inward, each turn offering giddy surprise, anxious esoterica, and thumping emotionality at equal odds. “Do you remember the mythic beast?” Bejar asks at the outset of “Tintoretto, It’s for You,” the album’s first single, casting torchlight over the labyrinth’s corridors. “Tintoretto, it’s for you/ The ceiling’s on fire and the contract is binding.” Delivered in a Marlene Dietrich smolder, Bejar’s lyrical menace seeps like smoke through the brazen march’s woozy synths and dizzied guitar. “There’s some character here that feels new to me, a low drawl, an evening gown draped over a piano,” Bejar says of the song. Throughout, LABYRINTHITIS insists that everything’s not all right, but that even isolation and dissolution can be a source of joy— stepping into the sunlight at the other end of the maze in your ear, Bejar strolling alongside like a wild-maned, leisure- suited minotaur.\n\nLABRYNTHITIS out now!"},{"date":"2022-05-22T00:00:00.000+00:00","url":"https://theuctheatre.org/events/buy-tickets/simu-liu-we-were-dreamers-tour/detail","title":"Simu Liu: WE WERE DREAMERS Tour","img":"https://theuctheatre.org/userfiles/events/images/506/simu-liu-we-were-dreamers-tour.jpeg?20220506094813","details":"Every ticket includes a copy of WE WERE DREAMERS: An Immigrant Superhero Origin Story (a $28 value).\n\nSpend an evening with the star of Marvel's first ever Asian superhero movie, Simu Liu, as he traces his path from his humble upbringing in China to the bright lights of Hollywood.\nSimu gives fans an inside look at growing up between cultures, battling stereotypes, and landing the role of a lifetime in Shang-Chi in his new memoir, WE WERE DREAMERS. Joined on book tour by special guests, Simu will share inspiring insights into how we can all become the heroes of our own life stories. \n "},{"date":"2022-06-04T00:00:00.000+00:00","url":"https://theuctheatre.org/events/buy-tickets/crown-the-empire-the-fallout-10-year-anniversary-tour/detail","title":"Crown The Empire: The Fallout 10 Year Anniversary Tour","img":"https://theuctheatre.org/userfiles/events/images/508/crown-the-empire-the-fallout-10-year-anniversary-tour.jpeg?20220506094813","details":"Standing room only - limited seating available\n\nWith D.R.U.G.S, The Word Alive, Until I Awake"},{"date":"2022-06-07T00:00:00.000+00:00","url":"https://theuctheatre.org/events/buy-tickets/violent-femmes-1/detail","title":"Violent Femmes","img":"https://theuctheatre.org/userfiles/events/images/509/violent-femmes-1.jpeg?20220506094814","details":"Standing Room Only - Limited Seats Available\n\nWith Deap Valley\n\nViolent Femmes 10th studio album, HOTEL LAST RESORT, resides among the groundbreaking band’s finest work, simultaneously refining and redefining their one-of-a-kind take on American music, mingling front porch folk, post punk, spiritual jazz, country blues, avant garde minimalism and golden age rock ‘n’ roll into something still altogether their own. Founded and fronted of course by singer/ guitarist Gordon Gano and acoustic bass guitarist Brian Ritchie, the Milwaukee-born combo remains as warm, wise and weird as ever before, with such new favorites as “Another Chorus” and “Everlasting You” continuing to mine the vast range of ideas, melodic complexity and organic sonic craftsmanship that has characterized the band’s body of work since their landmark self-titled 1983 debut.\n\n“I think it’s probably the best [album] we’ve made since HALLOWED GROUND,” Ritchie says. “We didn’t really know that we had something to say, but it turns out that the songs are really good and we were able to sink our teeth into them and come up with something which is just as good as anything we’ve ever done. I’m even a little bit surprised myself.”\nViolent Femmes are undeniably one of the most inventive and original bands of this or any other era, constantly pushing forward with their singular blend of folk and punk, sarcasm and spirituality. Founded in 1981, the originally Milwaukee-based band’s remarkable three-decade-plus career has produced a series of truly iconic singles – among them such classics as “American Music,” “Gone Daddy Gone,” “Nightmares,” “Add It Up” and of course, “Blister In The Sun” – along with cumulative worldwide album sales in excess of 10 million, with 1983’s VIOLENT FEMMES awarded RIAA platinum eight years after its initial release."},{"date":"2022-06-08T00:00:00.000+00:00","url":"https://theuctheatre.org/events/buy-tickets/yann-tiersen/detail","title":"Yann Tiersen - Live A/N Tour 2022","img":"https://theuctheatre.org/userfiles/events/images/397/yann-tiersen.jpeg?20220506094814","details":"KALW Presents\n\nGuillaume Yann Tiersen (born June 23, 1970 in Brittany, France) is a French musician who is best known for being the composer of the soundtrack for the popular 2001 movie \"Le fabuleux destin d'Amélie Poulain\". He has received classical training at several musical academies, including those in Rennes, Nantes, and Boulogne.\n\nHis music is mostly instrumental, decorated with piano, accordion, harpsicord, violin, mandolin, bass, guitar, banjo, melodica, toy piano, typewriter, vibraphone and various rhythm instruments. Yann Tiersen has also collaborated with vocal artists like Claire Pichet (\"Le phare\" and \"Rue des cascades\"), Elizabeth Fraser (\"Les retrouvailles\") and Shannon Wright (\"Yann Tiersen and Shannon Wright\"). Other musicians he has worked with include The Divine Comedy, Noir Désir, dominique A., Francoiz Breut, Les Têtes Raides and The Married Monk."},{"date":"2022-06-10T00:00:00.000+00:00","url":"https://theuctheatre.org/events/buy-tickets/fantastic-negrito-1/detail","title":"Fantastic Negrito","img":"https://theuctheatre.org/userfiles/events/images/454/fantastic-negrito-1.jpeg?20220506094815","details":"KALW Presents\n\nFantastic Negrito’s upcoming album \"White Jesus Black Problems\" was inspired by learning that his 7th generation grandmother was a Scottish indentured servant who entered into a common law marriage with an African American enslaved man, his 7th generation grandfather, in open defiance of the racist laws of 1750’s colonial Virginia. The resulting work is part love story, part historical excavation, an extraordinary and exhilarating ode to the power of family and the enduring resilience of our shared humanity. The collection is bold and thought provoking, grappling with racism, capitalism, and the very meaning of freedom itself, all without ever losing sight of the desire and determination at the heart of the tale. The performances, meanwhile, are similarly ambitious and emotionally charged, mixing blistering rock and roll grit with infectious R\u0026B grooves and buoyant funk energy to deliver a sound that manages to feel both vintage and experimental all at once. The experience challenges our notions of who we are, where we come from, and, perhaps most importantly, where we’re headed. "},{"date":"2022-06-12T00:00:00.000+00:00","url":"https://theuctheatre.org/events/buy-tickets/neko-case/detail","title":"Neko Case","img":"https://theuctheatre.org/userfiles/events/images/496/neko-case.jpeg?20220506094815","details":"KALW Presents\n\nStanding room - limited seats available. \n\nwith special guest Leyla McCalla"},{"date":"2022-07-10T00:00:00.000+00:00","url":"https://theuctheatre.org/events/buy-tickets/motion-city-soundtrack-1/detail","title":"Motion City Soundtrack","img":"https://theuctheatre.org/userfiles/events/images/377/motion-city-soundtrack-1.jpeg?20220506094816","details":"Standing room - limited seats available. \n\nWith All Get Out and Neil Rubenstein\nMotion City Soundtrack formed in Minneapolis in 1997 and has since built an extraordinary career for themselves with their unique style of indie rock meets power pop and quirkily smart lyrics that has resulted in six fan-coveted studio albums. "},{"date":"2022-07-17T00:00:00.000+00:00","url":"https://theuctheatre.org/events/buy-tickets/memphis-may-fire-remade-in-misery-tour-presented-by-siriusxm-octane/detail","title":"Memphis May Fire: Remade In Misery Tour presented by SiriusXM Octane","img":"https://theuctheatre.org/userfiles/events/images/512/memphis-may-fire-remade-in-misery-tour-presented-by-siriusxm-octane.jpeg?20220506094816","details":"Limited Seating Available - Standing Room Only\n\nWith Rain City Drive and Wolves At The Gate "},{"date":"2022-07-23T00:00:00.000+00:00","url":"https://theuctheatre.org/events/buy-tickets/ney-matogrosso/detail","title":"Ney Matogrosso","img":"https://theuctheatre.org/userfiles/events/images/504/ney-matogrosso.jpeg?20220506094817","details":"Ney Matogrosso, Brazil’s most extravagant artist will make a rare visit to the US in July 2022! From the Secos e Molhados period in the 1970s through today, Ney has been a creative powerhouse for several decades. Renowned for his flamboyance, stage theatrics, loud costumes and a singular high-pitched voice, Ney is in a world of his own artistically. Rolling Stone magazine ranked him as being one of the top three greatest Brazilian artists of all time. Witness one of the most unique and dazzling performers to have ever come out of Latin America."},{"date":"2022-07-28T00:00:00.000+00:00","url":"https://theuctheatre.org/events/just-announced/rising-appalachia-2/detail","title":"Rising Appalachia","img":"https://theuctheatre.org/userfiles/events/images/513/rising-appalachia-2.jpeg?20220506094817","details":"Limited Seating Available - Standing Room Only\n\nWith Jeffrey Martin\n\nAs world travelers for nearly two decades, Rising Appalachia have merged multiple global music influences with their own southern roots to create the inviting new folk album, Leylines. Remarkably the band has built its legion of listeners independently -- a self-made success story that has led to major festival appearances and sold-out shows at venues across the country.\n\nFounded by sisters Leah and Chloe Smith, the band established an international fan base due to relentless touring, tireless activism, and no small degree of stubborn independence. However, for the first time, they opted to bring in a producer for the new album, teaming up with the legendary Joe Henry on the sessions. These were also their first recording sessions outside of the South. For 10 days, all six band members lived and recorded in a castle-like studio in Marin County, California, overlooking the Pacific Ocean. As a result, a sense of unity and immediacy can be heard throughout their seventh album, Leylines."},{"date":"2022-08-01T00:00:00.000+00:00","url":"https://theuctheatre.org/events/buy-tickets/new-found-glory-20-years-of-sticks-and-stones/detail","title":"New Found Glory - 20 Years of Sticks and Stones","img":"https://theuctheatre.org/userfiles/events/images/495/new-found-glory-20-years-of-sticks-and-stones.jpeg?20220506094817","details":"Standing room - limited seats available. \n\nWith Four Year Strong and Be Well"},{"date":"2022-08-19T00:00:00.000+00:00","url":"https://theuctheatre.org/events/buy-tickets/at-the-gates/detail","title":"At The Gates","img":"https://theuctheatre.org/userfiles/events/images/511/at-the-gates.jpeg?20220506094818","details":"Limited Seating Available - Standing Room Only \n\nWith Municipal Waste, Thrown Into Exile"},{"date":"2022-08-20T00:00:00.000+00:00","url":"https://theuctheatre.org/events/buy-tickets/carpenter-brut/detail","title":"Carpenter Brut","img":"https://theuctheatre.org/userfiles/events/images/499/carpenter-brut.jpeg?20220506094818","details":"Standing room - limited seats available. \n\nFour years after the 130 shows across the northern hemisphere with the Leather Patrol Tour, Carpenter Brut will hit the road again in 2022 with the second part of his second trilogy: the Leather Terror Tour. \nThe story, entirely written and composed by Carpenter Brut, takes a new turn. Bret Halford becomes a blood-thirsty serial killer. Taking advantage of his tours with his band, Leather Patrol, he hunts down all of those who bullied him during his teenage years, he seeks revenge. Here is what lies at the core of the writing for this second opus entitled Leather Terror. \nWith killer riffs and metallic drums, Carpenter Brut clearly states his love for the 1980’s trash metal while the singing takes a more important part in the compositions. This new show will be as powerful as it will be catchy, the combination of both leading to a music more electrifying than ever. "},{"date":"2022-08-22T00:00:00.000+00:00","url":"https://theuctheatre.org/events/buy-tickets/warpaint/detail","title":"Warpaint","img":"https://theuctheatre.org/userfiles/events/images/510/warpaint.jpeg?20220506094819","details":"Standing Room Only - Limited Seating Available\n\nWarpaint are a 4-piece band from California whose unique brand of intricate guitar lines, hypnotic vocals and driving post punk rhythms combine to create a gorgeous, unique sound. Both on record and on stage Warpaint sound like they're channeling something truly otherworldly and mystical. Warpaint have seen constant exposure in publications such as The Guardian, The Independent, Rolling Stone, Spin, Mojo, Q, Crack Magazine, Interview, Nylon, Bust, NME and was featured on the cover of the LA Weekly, as well as having performed on television programs such as Conan, Ellen and Later With Jools Holland.\nWarpaint's debut album The Fool was named on of the 50 Best Albums of the Decade by NME; their sophomore album 'Warpaint' debuted in the top 10 of the Billboard Alternative Album Chart as well as the U.K. Album Chart, and was named one of the albums of the year in publications such as The Chicago Tribune, LA Magazine, Time Out, NME and American Songwriter. Their third album 'Heads Up' enjoyed a Top 40 debut on the Billboard Current Albums Chart, #13 on the U.K. Album Chart. ‘Radiate Like This’, the bands forthcoming album will be release May 6, 2022. "},{"date":"2022-08-25T00:00:00.000+00:00","url":"https://theuctheatre.org/events/just-announced/circle-jerks-descendents/detail","title":"Circle Jerks / Descendents","img":"https://theuctheatre.org/userfiles/events/images/514/circle-jerks-descendents.jpeg?20220506094819","details":"Limited Seating Available - Standing Room Only\n\nWith Grumpster\n\nCircle Jerks\nCircle Jerks emerged from the punk underbelly of LA’s South Bay in 1979. After serving as a co-founder and lead vocalist of Black Flag during the recording of its essential Nervous Breakdown EP, Keith Morris joined forces with former Redd Kross guitarist Greg Hetson to form what would become Circle Jerks. Unlike much of the unapologetic hardcore that seeped through the cracks of American suburbia, the music of the Circle Jerks was thoughtfully steadfast, yet relentless and ferocious in nature. Bringing together a potent, articulate rhythm section with earnest yet oftentimes derisive lyrics and themes, the band was thereafter heralded as a leader of the pack - and a force to be reckoned with. Plowing forward with a relentless, tooth-cutting work ethic and a rousing stage presence, the band would soon find itself headlining shows at LA’s 5,000-capacity Olympic Auditorium and emblazoned in cult video classics like Decline of Western Civilization, Repo Man, New Wave Theatre, and The Slog Movie. Over the decades, Circle Jerks would release six studio albums, including the acclaimed Group Sex (1980) Wild in the Streets (1982), Golden Shower of Hits (1983), Wonderful (1985), and IV (1987), where they would become a major headliner during the alternative music explosion of the 80’s and 90’s. Morris and Hetson remain the only consistent members since the band’s creation. Bassist Zander Schloss (The Weirdos, Joe Strummer) has been a member since the 1980’s. \n\nDescendents\nSince first emerging from (and defining) the Southern California pop-punk scene in 1978, the legendary Descendents have released classic after classic, from their landmark 1982 LP Milo Goes to College to 2016's Hypercaffium Spazzinate. Now, after issuing a flurry of singles to get fans through the past few years, the band -- Milo Aukerman (vocals), Bill Stevenson (drums), Stephen Egerton (guitar), and Karl Alvarez (bass) -- will be touring in support of a new album. With a very cool twist.\n\nWhat started with Milo Goes to College now comes full circle on the blistering 9th \u0026 Walnut (Epitaph), a \"lost album\" quietly recorded in 2002 by the MGTC lineup of Stevenson, Aukerman, Tony Lombardo on bass, and Frank Navetta (d. 2008) on guitar. Audiences should be geared up for shows featuring songs spanning Descendents' incredible career, from \"Suburban Home\" and \"Silly Girl\" to \"I'm the One\" and \"Without Love,\" and including 9th \u0026 Walnut tracks like first single \"Baby Doncha Know\" and its incendiary follow-up, \"Nightage.\""}]