[{"date":"2022-06-02T00:00:00.000+00:00","url":"https://www.thewarfieldtheatre.com/events/detail/428801","img":"https://images.discovery-prod.axs.com/2022/03/griselda-tickets_06-02-22_17_6230ebda792cf.jpg","title":"GRISELDA With Westside Gunn, Conway The Machine, Benny The Butcher \u0026 Doe Boy","details":""},{"date":"2022-06-04T00:00:00.000+00:00","url":"https://www.thewarfieldtheatre.com/events/detail/423003","img":"https://images.discovery-prod.axs.com/2022/01/hayden-james-lifted-tour-tickets_06-04-22_17_61de38e2a89f8.jpg","title":"HAYDEN JAMES - LIFTED TOUR with Cassian","details":"Hayden James has been producing immense summer house jams with soulful and evocative vocals ever since he burst onto the Australian music scene in 2013. He's since captured worldwide attention and critical success with multiple Platinum-certified hits and a music collection that's amassed 97 million streams just last year alone.His debut EP out on tastemaker label Future Classic put his name on the map,but didn’t prepare the indie label for the success Hayden would have with hit single \"Something About You\", released early 2015 on the label’s yearly compilation album and now counting over 58 million streams and a Gold certification in Australia. He followed this success with sold out shows across Australia, Europe and the US while also finding the time to co-write and produce a number of tracks for international megastar Katy Perry.His track “NUMB,” released in October 2017 scored a Platinum certification in Australia, a #32 position on Triple J’s Hottest 100 and spawned a huge headline tour of North America. 2018 was a breakout year with hits “Better Together” featuring Running Touch and “Just Friends” featuring singer Boy Matthews, two singles that enjoying chart positioning on both ARIA and Spotify since their release. \"Just Friends\" became one of his quickest-streaming songs ever, going double Platinum in Australia and currently boasting over 40 million streams. This was also the first year Hayden had two singles in the coveted Triple J Top 100, with \"Just Friends\" reaching the highest position at #15 and \"Better Together\" at #75. Following sold out summer runs in the US and Europe, Hayden returned with his biggest Australian headline tour to date featuring an all-new custom production, along with a run of sold out DJ setsin the US.2019 is shaping up to be Hayden's biggest year yet, with a new single to be released in May, closely followed by some exciting news that his audience has eagerly been waiting for."},{"date":"2022-06-05T00:00:00.000+00:00","url":"https://www.thewarfieldtheatre.com/events/detail/422723","img":"https://images.discovery-prod.axs.com/2022/01/parkway-drive-north-america-2022-tickets_06-05-22_17_61d77e65ecbdb.jpg","title":"PARKWAY DRIVE - CANCELLED with Crown the Empire, Hatebreed, The Black Dahlia Murder","details":"Formed in Byron Bay in 2002, Parkway Drive have released six studio albums, all on Epitaph: Killing with a Smile (2005), Horizons (2007), Deep Blue (2010), Atlas (2012), IRE (2015), Reverence (2018). Reverence entered the official German and Swiss albums charts at #3, Austrian at #5, Belgian at #6, United Kingdom at #14, and US at #35. In their home country Australia, it debuted at #1.\nIn 2020 band released the documentary ‘Viva The Underdogs,’ which features over a decade of behind the scenes personal footage, coupled with unprecedented access to the band’s most explosive live tours and world’s biggest music festivals. The soundtrack for the documentary was released in the same year. Featuring 11 live tracks from the band’s 2019 headlining set at German heavy metal festival Wacken Open Air, the soundtrack also includes 3 studio tracks recorded in German; “Würgegriff (Vice Grip)”, “Die Leere (The Void)”, and “Schattenboxen (Shadow Boxing)” which features German rapper Casper."},{"date":"2022-06-12T00:00:00.000+00:00","url":"https://www.thewarfieldtheatre.com/events/detail/394549","img":"https://images.discovery-prod.axs.com/2020/03/olafur-arnalds-tickets_11-10-20_17_5e617353af349.jpg","title":"ÓLAFUR ARNALDS","details":"Award-winning artist, composer and producer Ólafur Arnalds is back on the road with brand new material. After a triumphant return to the stage in 2018, the re:act tour represents Ólafur's final set of shows after nearly three years of touring.\n  Ólafur’s performances continue to captivate audiences across the globe as he invites them to join him on a new journey where he presents his most personal and raw music to date — a counterpoint to the exuberant energy of his latest album ‘re:member’."},{"date":"2022-06-28T00:00:00.000+00:00","url":"https://www.thewarfieldtheatre.com/events/detail/418432","img":"https://images.discovery-prod.axs.com/2021/11/benee-world-tour-2022-tickets_06-28-22_17_618d9b68168ef.jpg","title":"BENEE WORLD TOUR 2022 with Dreamer Boy","details":""}]